Repository: sjentsch/jamoviDocs-i18n
Catalog: */LC_MESSAGES/howto.po
Languages: de, ja, nb, ta, uk

source: Now you are set to run analyses. Please note that the :red:`PROCESS-macro for R uses a different random number generator than SPSS and SAS`\ [#]_ and that therefore the :red:`bootstrapping confidence intervals for the Indirect effect(s) of X on Y are different` from what the output shown in the book. Furthermore, does the current version of the :red:`PROCESS-macro for R accept data only in numeric format`.\ [#]_ Thus, factors must be converted to numeric form (e.g., ``0`` and ``1``) prior to their use in a PROCESS command. This can be done using the following command in ``Rj`` (just copy-and-paste it).
de: Jetzt können Sie die Analysen durchführen. Bitte beachten Sie, dass das :red:`PROCESS-Makro für R einen anderen Zufallszahlengenerator verwendet als SPSS und SAS`\ [#]_ und dass daher die :red:`Bootstrapping-Konfidenzintervalle für den/die indirekten Effekt(e) von X auf Y anders sind` als die im Buch gezeigte Ausgabe. Außerdem akzeptiert die aktuelle Version des :red:`PROCESS-Makros für R nur Daten im numerischen Format`.\ [#]_ Deshalb müssen Faktoren vor ihrer Verwendung in einem PROCESS-Befehl in die numerische Form konvertiert werden (z. B. ``0`` und ``1``). Dies kann mit dem folgenden Befehl in ``Rj`` geschehen (einfach kopieren und einfügen).
ja: これで分析を実行する準備が整いました。:red:`R用のPROCESSマクロは、SPSSやSASとは異なる乱数生成器を使用している`\\ [#]_ ため、:red:`XのYに対する間接効果のブートストラップ信頼区間は、本に示されている出力とは異なる` ことに注意してください。さらに、現在のバージョンの :red:`R用PROCESSマクロは、数値形式のデータのみを受け入れます` 。\\ [#]_ したがって、PROCESSコマンドで使用する前に、因子を数値形式（例： ``0`` と ``1`` ）に変換する必要があります。これは、 ``Rj`` で次のコマンドを使用して実行できます（コピー＆ペーストしてください）。
nb: Nå er du satt til å kjøre analyser. Vær oppmerksom på at :red:`PROCESS-makroen for R bruker en annen generator for tilfeldige tall (*random numbers*) for enn SPSS og SAS`\ [#]_ og at derfor :red:`bootstrapping-konfidensintervallene for de(n) indirekte effekten(e) av X på Y er forskjellig fra det som vises i boken`. I tillegg aksepterer den nåværende versjonen av :red:`PROCESS-makroen for R data kun i numerisk format`.\ [#]_ Derfor må faktorer konverteres til numerisk form (f.eks. ``0`` og ``1``) før de kan brukes i en PROCESS-kommando. Dette kan gjøres ved å bruke den følgende kommandoen i ``Rj`` (bare kopier og lim den inn).
ta: இப்போது நீங்கள் பகுப்பாய்வுகளை இயக்க அமைக்கப்பட்டுள்ளீர்கள். தயவுசெய்து: Red: `R க்கான செயல்முறை-மேக்ரோ SPSS மற்றும் SAS \ [#] _ _ ஐ விட வேறு சீரற்ற எண் செனரேட்டரைப் பயன்படுத்துகிறது: எனவே: சிவப்பு:` ஃச் on இன் மறைமுக விளைவு (கள்) க்கான நம்பிக்கை இடைவெளிகளை பூட்ச்ட்ராப்பிங் செய்கிறது புத்தகத்தில் காட்டப்பட்டுள்ள வெளியீட்டிலிருந்து ஒய் வேறுபட்டது. மேலும், தற்போதைய பதிப்பு: சிவப்பு: `R க்கான செயல்முறை-மேக்ரோ தரவுகளை எண் வடிவத்தில் மட்டுமே ஏற்றுக்கொள்கிறது. \ [#] _ ஆகவே, காரணிகள் எண் வடிவமாக மாற்றப்பட வேண்டும் (எ.கா.,` 0` மற்றும் `` ` 1``) ஒரு செயல்முறை கட்டளையில் பயன்படுத்தப்படுவதற்கு முன்பு. `` Rj`` இல் பின்வரும் கட்டளையைப் பயன்படுத்தி இதைச் செய்யலாம் (அதை நகலெடுத்து ஒட்டவும்).
uk: Тепер ви готові до виконання аналізів. Зверніть увагу, що макрос :red:`PROCESS для R використовує інший генератор випадкових чисел, ніж SPSS та SAS`\ [#]_, і тому довірчі інтервали :red:`бутстрепінгу для непрямого(их) впливу(ів) X на Y відрізняються` від результату, показаного в книзі. Крім того, чи приймає поточна версія макросу :red:`PROCESS для R дані лише в числовому форматі`.\ [#]_ Таким чином, фактори необхідно перетворити на числову форму (наприклад, ``0`` та ``1``) перед їх використанням у команді PROCESS. Це можна зробити за допомогою наступної команди в ``Rj`` (просто скопіюйте та вставте її).

source: Once this is done, you may just write (or copy-and-paste if you own the e-book) the commands that are shown in the book. Please note that you have to change the name of the data set: in this example, taken from p. 188 of Hayes (2022), the dataset ``pmi`` is required (to download the `data sets <https://afhayes.com/public/hayes2022data.zip>`__). Thecommand in the book has to be adjusted by changing ``data = pmi`` into ``data = data`` (``data`` refers to the currently opened dataset in jamovi).
de: Sobald dies geschehen ist, können Sie einfach die Befehle schreiben, die im Buch gezeigt werden (oder diese kopieren und einfügen, wenn Sie das e-Book besitzen). Bitte beachten Sie, dass Sie den Namen des Datensatzes ändern müssen: für dieses Beispiel, das S. 188 von Hayes (2022) entnommen wurde, wird der Datensatz ``pmi`` benötigt (um die `Datensätze herunterzuladen <https://afhayes.com/public/hayes2022data.zip>`__\). Die Anweisung im Buch muss angepasst werden, indem ``data = pmi`` in ``data = data`` geändert wird (``data`` bezieht sich auf den aktuell in jamovi geöffneten Datensatz).
ja: これが完了したら、本に示されているコマンドを記述（または電子書籍をお持ちの場合はコピー＆ペースト）するだけです。データセットの名前を変更する必要があることに注意してください。Hayes (2022) のp. 188から引用したこの例では、データセット ``pmi`` が必要です（ `データセット <https://afhayes.com/public/hayes2022data.zip>`__ をダウンロードするため）。本のコマンドは、 ``data = pmi`` を ``data = data`` に変更して調整する必要があります（ ``data`` はjamoviで現在開いているデータセットを指します）。
nb: Når dette er gjort, kan du bare skrive kommandoene slik som de vises i boken (eller kopiere og lime inn hvis du eier e-boken). Vær oppmerksom på at du må endre navnet på datasettet: i dette eksemplet, hentet fra s. 188 av Hayes (2022), er datasettet ``pmi`` nødvendig (for `å laste ned datasettene <https://afhayes.com/public/hayes2022data.zip>`__\). Kommandoen i boken må justeres ved å endre ``data = pmi`` til ``data = data`` (``data`` refererer til det datasettet som er åpnet i jamovi).
ta: இது முடிந்ததும், புத்தகத்தில் காட்டப்பட்டுள்ள கட்டளைகளை நீங்கள் எழுதலாம் (அல்லது நீங்கள் மின் புத்தகத்தை வைத்திருந்தால் நகலெடுத்து ஒட்டவும்). தரவு தொகுப்பின் பெயரை நீங்கள் மாற்ற வேண்டும் என்பதை நினைவில் கொள்க: இந்த எடுத்துக்காட்டில், ப. ஏய்சின் 188 (2022), தரவுத்தொகுப்பு `` pmi`` தேவைப்படுகிறது (`தரவு தொகுப்புகளை <https://afhayes.com/public/hayes2022data.zip> __) பதிவிறக்கம் செய்ய. `` தரவு = pmi`` ஐ `` தரவு = தரவு`` (`` தரவு`` என்பது சாமோவியில் தற்போது திறக்கப்பட்ட தரவுத்தொகுப்பைக் குறிக்கிறது) மாற்றுவதன் மூலம் புத்தகத்தில் உள்ள theCommand ஐ சரிசெய்ய வேண்டும்.
uk: Після цього ви можете просто написати (або скопіювати та вставити, якщо у вас є електронна книга) команди, показані в книзі. Зверніть увагу, що вам потрібно змінити назву набору даних: у цьому прикладі, взятому зі с. 188 книги Hayes (2022), потрібен набір даних ``pmi`` (для завантаження `наборів даних <https://afhayes.com/public/hayes2022data.zip>`__). Команду в книзі потрібно скоригувати, змінивши ``data = pmi`` на ``data = data`` (``data`` стосується поточного відкритого набору даних у jamovi).

source: Please remember that you have to run the ``source…`` command again whenever you open a new dataset / a new jamovi session. If you want to run several analyses with the same dataset / within the same jamovi session, this is not required.
de: Bitte denken Sie daran, dass Sie den Befehl ``source…`` erneut ausführen müssen, wenn Sie einen neuen Datensatz / eine neue jamovi-Sitzung öffnen. Wenn Sie mehrere Analysen mit demselben Datensatz / innerhalb derselben jamovi-Sitzung durchführen möchten, ist dies nicht erforderlich.
ja: 新しいデータセットを開くか、新しいjamoviセッションを開始するたびに、 ``source…`` コマンドを再度実行する必要があることを忘れないでください。同じデータセット（同じjamoviセッション内）で複数の分析を実行したい場合、これは必要ありません。
nb: Husk at du må kjøre kommandoen ``source…`` igjen hver gang du åpner et nytt datasett / en ny jamovi-sesjon. Hvis du ønsker å kjøre flere analyser med samme datasett / innenfor samme jamovi-sesjon, er dette ikke nødvendig.
ta: நீங்கள் ஒரு புதிய தரவுத்தொகுப்பு / புதிய சாமோவி அமர்வைத் திறக்கும்போதெல்லாம் `` மூலத்தை… `` மீண்டும் கட்டளையிட வேண்டும் என்பதை நினைவில் கொள்க. ஒரே தரவுத்தொகுப்புடன் / அதே சாமோவி அமர்வுக்குள் பல பகுப்பாய்வுகளை இயக்க விரும்பினால், இது தேவையில்லை.
uk: Пам’ятайте, що вам потрібно повторно запускати команду ``source…`` щоразу, коли ви відкриваєте новий набір даних / новий сеанс jamovi. Якщо ви хочете виконати кілька аналізів з одним і тим самим набором даних / в межах одного сеансу jamovi, це не обов’язково.

source: “The default random number generator in R is diﬀerent than the default random number generator in SPSS and SAS. Thus, bootstrap confidence intervals generated by R will be diﬀerent than those produced by SPSS and SAS even when the same seed is used when estimating the same model using the same data.” (Hayes, 2022, p. 613)
de: „Der Standard-Zufallszahlengenerator in R ist anders als der Standard-Zufallszahlengenerator in SPSS und SAS. Daher sind die von R erzeugten Bootstrap-Konfidenzintervalle anders als die von SPSS und SAS erzeugten, selbst wenn derselbe *random seed* bei der Schätzung desselben Modells mit denselben Daten verwendet wird.“ (Hayes, 2022, S. 613)
ja: 「Rのデフォルトの乱数生成器は、SPSSやSASのデフォルトの乱数生成器とは異なります。したがって、同じデータを使用して同じモデルを推定するときに同じシードを使用しても、Rによって生成されるブートストラップ信頼区間は、SPSSやSASによって生成されるものとは異なります。」(Hayes, 2022, p. 613)
nb: «Standardgeneratoren for tilfeldig tall i R er forskjellig fra generatoren i SPSS og SAS. Dermed vil bootstrap-konfidensintervaller generert av R være forskjellig fra de som genereres av SPSS og SAS, selv når det samme *random seed* brukes når man estimerer den samme modellen ved å bruke de samme dataene.» (Hayes, 2022, s. 613)
ta: “R இல் இயல்புநிலை சீரற்ற எண் செனரேட்டர் SPSS மற்றும் SAS இல் இயல்புநிலை சீரற்ற எண் செனரேட்டரை விட di ﬀ erent ஆகும். ஆகவே, ஒரே தரவைப் பயன்படுத்தி ஒரே மாதிரியை மதிப்பிடும்போது அதே விதை பயன்படுத்தும்போது கூட, R ஆல் உருவாக்கப்பட்ட தொடக்கவார் நம்பிக்கை இடைவெளிகள் SPSS மற்றும் SAS ஆல் விளைவாக்கம் செய்யப்படுவதை விட டி -எரென்ட் இருக்கும். ” (ஏய்ச், 2022, பக். 613)
uk: «Генератор випадкових чисел за замовчуванням у R відрізняється від генератора випадкових чисел за замовчуванням у SPSS та SAS. Таким чином, довірчі інтервали бутстрепу, згенеровані R, відрізнятимуться від тих, що створюються SPSS та SAS, навіть якщо використовується те саме початкове значення під час оцінювання тієї ж моделі з використанням тих самих даних». (Hayes, 2022, с. 613)

source: “PROCESS for R accepts data only in numeric format. Thus, for example, if a variable named sex were coded M and F in the data, these alphabetic codes must be converted to numeric form (e.g., 0 and 1) prior to their use in a PROCESS command.” (Hayes, 2022, p. 612)
de: „PROCESS für R akzeptiert nur Daten im numerischen Format. Wenn also beispielsweise eine Variable mit dem Namen Geschlecht in den Daten mit M und F codiert ist, müssen diese alphabetischen Codes vor ihrer Verwendung in einem PROCESS-Befehl in numerische Form (z. B. 0 und 1) umgewandelt werden.“ (Hayes, 2022, S. 612)
ja: 「R用のPROCESSは、数値形式のデータのみを受け入れます。したがって、たとえば、データ内でsexという名前の変数がMおよびFとしてコード化されている場合、これらのアルファベットコードは、PROCESSコマンドで使用する前に数値形式（例：0および1）に変換する必要があります。」(Hayes, 2022, p. 612)
nb: «PROCESS for R aksepterer kun data i numerisk format. Således, for eksempel, hvis en variabel kalt kjønn ble kodet M og F i dataene, må disse alfabetiske kodene konverteres til numerisk form (f.eks. 0 og 1) før de brukes i en PROCESS-kommando.» (Hayes, 2022, s. 612)
ta: “R க்கான செயல்முறை எண் வடிவத்தில் மட்டுமே தரவை ஏற்றுக்கொள்கிறது. எனவே, எடுத்துக்காட்டாக, பாலினம் என்ற மாறி தரவுகளில் M மற்றும் F குறியிடப்பட்டிருந்தால், இந்த அகரவரிசை குறியீடுகள் ஒரு செயல்முறை கட்டளையில் பயன்படுத்தப்படுவதற்கு முன்பு எண் வடிவமாக (எ.கா., 0 மற்றும் 1) மாற்றப்பட வேண்டும். ” (ஏய்ச், 2022, பக். 612)
uk: «PROCESS для R приймає дані лише в числовому форматі. Наприклад, якщо змінна з іменем «стать» була закодована в даних як M та F, ці літерні коди необхідно перетворити на числову форму (наприклад, 0 та 1) перед їх використанням у команді PROCESS». (Hayes, 2022, с. 612)

source: The aim of the following section is to clear and simple instructions on how to deal with common tasks within jamovi.
de: Ziel des folgenden Abschnitts ist es, klare und einfache Anleitungen zu geben, wie sich häufig benötigte Aufgaben innerhalb von jamovi lösen lassen.
ja: 次のセクションの目的は、jamovi内の一般的なタスクを処理する方法について、明確で簡単な指示を提供することです。
nb: Målet med den følgende avsnitt er å gi enkle, praktiske instruksjoner om hvordan du kan håndtere oppgaver som trenges ofte når en bruker jamovi.
ta: சமோவிக்குள் பொதுவான பணிகளை எவ்வாறு கையாள்வது என்பது குறித்த தெளிவான மற்றும் எளிய வழிமுறைகளை பின்வரும் பிரிவின் நோக்கம்.
uk: Мета наступного розділу — надати чіткі та прості інструкції щодо виконання поширених завдань у jamovi.

source: jamovi user interface
ja: jamoviユーザーインターフェース
uk: інтерфейс користувача jamovi

source: Analyses
de: Analysen
ja: 分析
nb: Analyser
ta: சமோவியின் பயனர் இடைமுகம்
uk: Аналізи
