Repository: sjentsch/jamoviDocs-i18n
Catalog: */LC_MESSAGES/howto.po
Languages: de, ja, nb, ta, uk

source: How do I identify outliers and filter them out from being used in analyses?
de: Wie erkenne ich Ausreißer und filtere sie aus den Analysen heraus?
ja: 外れ値を特定し、分析から除外するには？
nb: Hvordan identifiserer jeg ekstremverdier og filtrerer dem ut fra analysene?
ta: வெளியீட்டாளர்களை எவ்வாறு அடையாளம் காண்பது மற்றும் பகுப்பாய்வுகளில் பயன்படுத்தப்படுவதிலிருந்து அவற்றை எவ்வாறு வடிகட்டுவது?
uk: Як мені виявити викиди та відфільтрувати їх для використання в аналізах?

source: open the ``Data`` tab and select ``Filter`` (either by using the symbol in the icon bar or the one in the bottom-left corner of the jamovi window)
de: Öffnen Sie die Registerkarte ``Data`` und wählen Sie ``Filter`` (entweder über das Symbol in der Symbolleiste oder über das Symbol in der unteren linken Ecke des jamovi-Fensters)
ja: ``データ`` （Data）タブを開き、 ``フィルタ`` （Filter）を選択してください（アイコンバーのシンボルを使用するか、jamoviウィンドウの左下角にあるシンボルを使用してください
nb: åpne ``Data``-fanen og velg ``Filter`` (enten ved å bruke symbolet i ikonlinjen eller symbolet i nederste venstre hjørne av jamovi-vinduet)
ta: `` தரவு` தாவலைத் திறந்து `` வடிகட்டி`` என்பதைத் தேர்ந்தெடுக்கவும் (ஐகான் பட்டியில் உள்ள சின்னத்தைப் பயன்படுத்துவதன் மூலம் அல்லது சாமோவி சாளரத்தின் கீழ்-இடது மூலையில் ஒன்றைப் பயன்படுத்துவதன் மூலம்)
uk: відкрийте вкладку ``Data`` та виберіть ``Filter`` (використовуючи символ на панелі значків або символ у лівому нижньому куті вікна jamovi)

source: in order to access functions, press the ``fx`` icon in the filter settings
de: um auf die Funktionen zuzugreifen, drücken Sie das Symbol ``fx`` in den Filtereinstellungen
ja: 関数にアクセスするには、フィルタの設定で ``fx`` アイコンを選択します
nb: for å få tilgang til funksjoner, trykk på ikonet ``fx`` i filterinnstillingene
ta: செயல்பாடுகளை அணுக, வடிகட்டி அமைப்புகளில் `` fx`` ஐகானை அழுத்தவும்
uk: Щоб отримати доступ до функцій, натисніть значок ``fx`` у налаштуваннях фільтра

source: there also is a switch where you can activate or deactivate the filter (see the comment in red below)
de: es gibt auch einen Schalter, mit dem Sie den Filter aktivieren oder deaktivieren können (siehe den roten Kommentar weiter unten)
ja: フィルタを有効化または無効化できるスイッチもあります（下の赤字のコメントを参照）
nb: det finnes også en bryter hvor du kan aktivere eller deaktivere filteret (se kommentaren i rødt nedenfor)
ta: வடிகட்டியை நீங்கள் செயல்படுத்த அல்லது செயலிழக்கச் செய்யக்கூடிய ஒரு சுவிட்சும் உள்ளது (கீழே உள்ள கருத்தை கீழே காண்க)
uk: також є перемикач, за допомогою якого можна активувати або деактивувати фільтр (див. коментар, виділений червоним кольором нижче)

source: you close the filter settings by pressing the arrow in the top-right corner
de: Sie schließen die Filtereinstellungen, indem Sie auf den Pfeil in der oberen rechten Ecke drücken
ja: 右上の矢印を押して、フィルタ設定を閉じます
nb: du lukker filterinnstillingene ved å trykke på pilen i øverste høyre hjørne
ta: மேல்-வலது மூலையில் அம்புக்குறியை அழுத்துவதன் மூலம் வடிகட்டி அமைப்புகளை மூடுகிறீர்கள்
uk: Ви закриваєте налаштування фільтра, натискаючи стрілку у верхньому правому куті

source: there are three large approaches, to exclude outliers:
de: es gibt drei generelle Ansätze, um Ausreißer auszuschließen:
ja: 外れ値を除外するには、大きく分けて3つのアプローチがあります。
nb: det eksisterer tre store tilnærminger for å utelukke ekstremverdier:
ta: வெளிநாட்டினரை விலக்க மூன்று பெரிய அணுகுமுறைகள் உள்ளன:
uk: Існує три основні підходи для виключення викидів:

source: based upon z-scores (the absolute value should be larger 3.3; this equals to a probability of 0.1% = 1 / 1000; based upon a standard normal distribution ~ parametric)
de: basierend auf z-Scores (der absolute Wert sollte größer als 3,3 sein; dies entspricht einer Wahrscheinlichkeit von 0,1% = 1 / 1000; basierend auf einer Standardnormalverteilung ~ parametrisch)
ja: zスコアに基づく方法（絶対値が3.3より大きい場合。これは確率0.1% = 1 / 1000に相当します。標準正規分布に基づくパラメトリック法）
nb: basert på z-skårer (absoluttverdien bør være større enn 3,3; dette tilsvarer en sannsynlighet på 0,1 % = 1 / 1000; basert på en standard normalfordeling ~ parametrisk)
ta: Z- மதிப்பெண்களின் அடிப்படையில் (முழுமையான மதிப்பு பெரியதாக இருக்க வேண்டும் 3.3; இது 0.1% = 1 /1000 நிகழ்தகவுக்கு சமம்; ஒரு நிலையான இயல்பான விநியோகத்தின் அடிப்படையில் ~ அளவுரு)
uk: на основі z-показників (абсолютне значення має бути більше 3,3; це дорівнює ймовірності 0,1% = 1/1000; на основі стандартного нормального розподілу ~ параметричного)

source: based upon the IQR (like in a box plot; based upon ranks and quantiles ~ non-parametric)
de: basierend auf dem IQR (wie in einem Boxplot; basierend auf Rängen und Quantilen ~ nicht-parametrisch)
ja: （箱ひげ図のように）IQR（四分位範囲）に基づく方法。順位と分位数に基づくノンパラメトリック法）
nb: basert på IQR (som i et boksplott; basert på rangeringer og kvantiler ~ ikke-parametrisk)
ta: IQR ஐ அடிப்படையாகக் கொண்டு (ஒரு பெட்டி சதித்திட்டத்தைப் போல; அணிகள் மற்றும் அளவுகளை அடிப்படையாகக் கொண்டது ~ அளவுரு அல்லாதது)
uk: на основі міжквартильного коефіцієнта розбіжності (як у коробчастій діаграмі; на основі рангів та квантилів ~ непараметрично)

source: based on the Mahalanobis distance (multivariate outliers)
de: auf der Grundlage der Mahalanobis-Distanz (multivariate Ausreißer)
ja: マハラノビス距離に基づく方法（多変量外れ値）
nb: basert på Mahalanobis-distansen (multivariate ekstremverdier)
ta: மஆலனோபிச் தூரத்தின் அடிப்படையில் (பன்முக வெளிநாட்டவர்கள்)
uk: на основі відстані Махаланобіса (багатовимірні викиди)

source: for 1. and 2., there exist functions in jamovi (see next bullet points), for 3. you have to use R-code (decribed two bullet point below); for 2. you could also do it visually (three bullet points below)
de: für 1. und 2. gibt es Funktionen in jamovi (siehe die nächsten Aufzählungspunkte), für 3. muss man ``R``-Code verwenden (zwei Aufzählungspunkte weiter unten beschrieben); für 2. kann man es auch visuell machen (drei Aufzählungspunkte weiter unten)
ja: 1.と2.については、jamoviに関数が用意されています（次の箇条書きを参照）。3.については、Rコードを使用する必要があります（2つ下の箇条書きで説明）。2.については、視覚的に行うこともできます（3つ下の箇条書きを参照）
nb: for 1. og 2. finnes det funksjoner i jamovi (se neste kulepunkt), for 3. må du bruke R-kode (beskrevet to kulepunkt nedenfor); for 2. kan du også gjøre det visuelt (tre kulepunkt nedenfor)
ta: 1. மற்றும் 2 க்கு, சாமோவியில் செயல்பாடுகள் உள்ளன (அடுத்த புல்லட் புள்ளிகளைப் பார்க்கவும்), 3 க்கு. நீங்கள் R-குறியீட்டைப் பயன்படுத்த வேண்டும் (கீழே இரண்டு புல்லட் புள்ளியை குறைத்தது); 2 க்கு. நீங்கள் அதை பார்வைக்கு செய்யலாம் (கீழே மூன்று புல்லட் புள்ளிகள்)
uk: для 1. та 2. існують функції в jamovi (див. наступні пункти), для 3. потрібно використовувати R-код (описано двома пунктами нижче); для 2. також можна зробити це візуально (три пункти нижче)

source: you can either use an function-based selection; the functions below filter out lines based on either the z-scores (first line), the interquartile range (IQR, second line) or by excluding certain rows / row numbers (e.g., based upon the output from the calculation of the Mahalanobis distance further below; third line):
de: Sie können entweder eine funktionsbasierte Auswahl verwenden; die nachstehenden Funktionen filtern Zeilen entweder auf der Grundlage der z-Scores (erste Zeile), des Interquartilsbereichs (IQR, zweite Zeile) oder durch Ausschluss bestimmter Zeilen/Zeilennummern (z. B. auf der Grundlage der Ergebnisse der Berechnung des Mahalanobis-Abstands weiter unten; dritte Zeile):
ja: 関数ベースの選択を使用することもできます。以下の関数は、zスコア（1行目）、四分位範囲（IQR、2行目）、または特定の行/行番号の除外（例：さらに下のマハラノビス距離の計算結果に基づく場合、3行目）に基づいて行を除外します。
nb: du kan enten bruke et funksjonsbasert utvalg; funksjonene nedenfor filtrerer ut linjer basert på enten z-skårene (første linje), det interkvartilavstand (IQR, andre linje) eller ved å ekskludere visse rader / radtall (f.eks. basert på resultatet fra beregningen av Mahalanobis-distansen lenger nede; tredje linje):
ta: நீங்கள் ஒரு செயல்பாட்டு அடிப்படையிலான தேர்வைப் பயன்படுத்தலாம்; Z- மதிப்பெண்கள் (முதல் வரி), இடைநிலை வரம்பு (IQR, இரண்டாவது வரி) அல்லது சில வரிசைகள் / வரிசை எண்களைத் தவிர்ப்பதன் மூலம் (எ.கா. கீழே மூன்றாவது வரி:
uk: Ви можете використовувати вибір на основі функцій; наведені нижче функції фільтрують рядки на основі z-оцінок (перший рядок), міжквартильного діапазону (IQR, другий рядок) або виключаючи певні рядки/номери рядків (наприклад, на основі результатів обчислення відстані Махаланобіса далі; третій рядок):

source: the following code example detects multivariate outliers based upon the Mahalanobis distance (remember to adjust the variable names in VL)
de: das folgende Codebeispiel erkennt multivariate Ausreißer auf der Grundlage der Mahalanobis-Distanz (denken Sie daran, die Variablennamen in VL anzupassen)
ja: 以下のコード例は、マハラノビス距離に基づいて多変量外れ値を検出します（VL内の変数名を調整することを忘れないでください）
nb: de følgende kodeeksemplene oppdager multivariate ekstremverdier basert på Mahalanobis-distansen (husk å tilpasse variabelnavnene i VL)
ta: பின்வரும் குறியீடு எடுத்துக்காட்டு மஅலானோபிச் தூரத்தின் அடிப்படையில் பன்முக வெளியீட்டாளர்களைக் கண்டறிகிறது (வி.எல் இல் மாறி பெயர்களை சரிசெய்ய நினைவில் கொள்ளுங்கள்)
uk: У наступному прикладі коду виявляється багатовимірний викид на основі відстані Махаланобіса (не забудьте налаштувати назви змінних у VL)

source: the output from the ``R``-code tells you which lines you should de-select
de: die Ausgabe des ``R``-Codes sagt Ihnen, welche Zeilen Sie herausfiltern sollten
ja: ``R`` コードの出力は、どの行を選択解除すべきかを示しています
nb: utgaven fra ``R``-koden forteller deg hvilke linjer du bør velge bort
ta: `` r``-குறியீட்டிலிருந்து வெளியீடு நீங்கள் எந்த வரிகளைத் தேர்ந்தெடுக்க வேண்டும் என்பதை உங்களுக்குக் கூறுகிறது
uk: Вивід з ``R``-коду показує, які рядки слід скасувати вибір

source: you use the scripts within the `Rj editor <jamovi-module_Rj>`__, just copy-and-paste them and run them by hitting the ►-button (the little green triangle)
de: Sie verwenden die Skripte im `Rj-Editor <jamovi-module_Rj>`__, kopieren Sie sie einfach und fügen Sie sie ein und führen Sie sie aus, indem Sie auf die ►-Taste drücken (das kleine grüne Dreieck)
ja: スクリプトは `Rj editor <jamovi-module_Rj>`__ 内で使用します。コピー＆ペーストして、►ボタン（緑色の小さな三角形）を押して実行してください
nb: du bruker skriptene i `Rj-editoren <jamovi-module_Rj>`__ ved å bare kopiere dem og lim dem inn, kjør dem ved å trykke på ►-knappen (den lille grønne trekanten)
ta: நீங்கள் `ஆர்.சே. எடிட்டர் <சாமோவி-மோட்யூல்_ஆர்சே> __ __ க்குள் ச்கிரிப்ட்களைப் பயன்படுத்துகிறீர்கள், அவற்றை நகலெடுத்து ஒட்டவும், ►-பட்டனை (சிறிய பச்சை முக்கோணம்) தாக்கி அவற்றை இயக்கவும்
uk: Ви використовуєте скрипти в редакторі `Rj <jamovi-module_Rj>`__, просто скопіюйте та вставте їх і запустіть, натиснувши кнопку ► (маленький зелений трикутник)

source: the filter conditions can then be combined using boolean ``and`` / ``or``:
de: die Filterbedingungen können dann mit booleschen ``and`` / ``or`` kombiniert werden:
ja: フィルタ条件は、ブール演算子の ``and`` / ``or`` を使って組み合わせることができます。
nb: filterbetingelsene kan kombineres ved hjelp av de booleanske uttrykene ``and`` / ``or``:
ta: வடிகட்டி நிலைமைகளை பூலியன் `` மற்றும்`` / `அல்லது`` ஐப் பயன்படுத்தி இணைக்கலாம்:
uk: умови фільтра потім можна комбінувати за допомогою логічного виразу ``and`` / ``or``:

source: instead of using the second line (``MAXABSIQR``) you could also de-select cases by excluding their respective row numbers in the dataset (as in the third line; you would then visually check the outliers in the box-plots under ``Descriptives``, ensuring that the tick box ``Label outliers`` is set and exclude the row numbers that are marked as outliers)
de: anstelle der zweiten Zeile (``MAXABSIQR``) könnten Sie auch Fälle herausfiltern, indem Sie die entsprechenden Zeilennummern im Datensatz ausschließen (wie in der dritten Zeile; Sie würden dann die Ausreißer in den Box-Plots unter ``Descriptives`` visuell überprüfen und sicherstellen, dass das Kontrollkästchen ``Label outliers`` gesetzt ist und die Zeilennummern, die als Ausreißer markiert sind, ausschließen)
ja: 2行目（ ``MAXABSIQR`` ）を使用する代わりに、データセット内のそれぞれの行番号を除外することで（3行目のように）ケースの選択を解除することもできます。その場合、 ``Descriptives`` （記述統計）の箱ひげ図で外れ値を視覚的に確認し、 ``Label outliers`` （外れ値にラベル）のチェックボックスがオンになっていることを確認した上で、外れ値としてマークされた行番号を除外します
nb: i stedet for å bruke den andre linjen (``MAXABSIQR``) kan du også velge bort tilfeller ved å ekskludere deres respektive radnumre i datasettet (som i den tredje linjen; du vil da visuelt sjekke ekstremverdiene i boksplottene under ``Descriptives``, sørg for at avmerkingsboksen ``Label outliers`` er satt og ekskludere radnumrene som er merket som ekstremverdier)
ta: இரண்டாவது வரியைப் பயன்படுத்துவதற்குப் பதிலாக (`` `maxabsiqr``) தரவுத்தொகுப்பில் அந்தந்த வரிசை எண்களைத் தவிர்ப்பதன் மூலம் வழக்குகளைத் தேர்ந்தெடுக்கலாம் (மூன்றாவது வரியைப் போல; பின்னர் நீங்கள்` கீழ் பெட்டி-அடுக்குகளில் உள்ள வெளிநாட்டினரை பார்வைக்கு சரிபார்க்கிறீர்கள் `விளக்கங்கள்``, டிக் பாக்ச்` `லேபிள் வெளியீட்டாளர்கள்`` அமைக்கப்பட்டிருப்பதை உறுதிசெய்து, வெளிநாட்டவர்கள் எனக் குறிக்கப்பட்ட வரிசை எண்களை விலக்கவும்)
uk: Замість використання другого рядка (``MAXABSIQR``) ви також можете скасувати вибір випадків, виключивши їхні відповідні номери рядків у наборі даних (як у третьому рядку; потім ви візуально перевірите викиди на діаграмах у розділі ``Descriptives``, переконавшись, що встановлено прапорець ``Label outliers``, та виключите номери рядків, позначені як викиди)

source: Install modules in jamovi
de: Module in jamovi installieren
ja: jamoviにモジュールをインストールする
nb: Installer moduler i jamovi
ta: சமோவியில் தொகுதிகள் நிறுவவும்
uk: Встановлення модулів у jamovi

source: Click on the «+»-icon in the top-right corner to install modules from the jamovi library.
de: Klicken Sie auf das «+»-Symbol oben rechts, um Module aus der jamovi-Bibliothek zu installieren.
ja: 右上の「＋」アイコンをクリックすると、jamoviライブラリからモジュールをインストールできます。
nb: Klikk på «+»-ikonet øverst til høyre for å installere moduler fra jamovi-biblioteket.
ta: சாமோவி நூலகத்திலிருந்து தொகுதிகளை நிறுவ மேல்-வலது மூலையில் உள்ள «+»-ஐகானைக் சொடுக்கு செய்க.
uk: Натисніть на значок «+» у верхньому правому куті, щоб встановити модулі з бібліотеки jamovi.

source: Choose the jamovi library from the menu that opens.
de: Wählen Sie den ``jamovi library``-Tab aus dem sich öffnenden Menü aus.
ja: 開いたメニューからjamoviライブラリを選択します。
nb: Velg ``jamovi library``-fanen fra menyen som åpnes.
ta: திறக்கும் மெனுவிலிருந்து சாமோவி நூலகத்தைத் தேர்வுசெய்க.
uk: Виберіть бібліотеку jamovi з меню, що відкриється.

source: In the window that opens now, first click on «Available» (top-middle). Then go through the list with modules and click «INSTALL» at any module that you would like to use. Finally, close this window by clicking on the arrow pointing up (top-right corner).
de: In dem sich nun öffnenden Fenster klicken Sie zunächst auf „Available“ (oben, in der Mitte). Gehen Sie dann die Liste mit den Modulen durch und klicken Sie bei jedem Modul, das Sie verwenden möchten, auf „INSTALL“. Zum Schluss schließen Sie dieses Fenster, indem Sie auf den nach oben zeigenden Pfeil klicken (oben, rechts).
ja: 開いたウィンドウで、まず «Available» （利用可能）（上部中央）をクリックします。次に、モジュールのリストを見て、使用したいモジュールの «INSTALL» （インストール）をクリックします。最後に、上向きの矢印（右上隅）をクリックして、このウィンドウを閉じます。
nb: I vinduet som åpner nå klikker du først på «Available» (øverst i midten). Gå deretter gjennom listen med moduler og klikk «INSTALL» nesten ved modul du ønsker å bruke. Til slutt lukker du dette vinduet ved å klikke på pilen som peker opp (øverst til høyre).
ta: இப்போது திறக்கும் சாளரத்தில், முதலில் «கிடைக்கும்» (மேல்-நடுத்தர) இல் சொடுக்கு செய்க. நீங்கள் பயன்படுத்த விரும்பும் எந்த தொகுதியிலும் தொகுதிகள் மூலம் பட்டியல் வழியாக சென்று «நிறுவு» என்பதைக் சொடுக்கு செய்க. இறுதியாக, சுட்டிக்காட்டி அம்புக்குறியைக் சொடுக்கு செய்வதன் மூலம் இந்த சாளரத்தை மூடு (மேல்-வலது மூலையில்).
uk: У вікні, що відкриється, спочатку натисніть на «Доступно» (угорі посередині). Потім перегляньте список модулів і натисніть «ВСТАНОВИТИ» на будь-якому модулі, який ви хочете використовувати. Нарешті, закрийте це вікно, натиснувши на стрілку, що вказує вгору (у верхньому правому куті).

source: Use the R-version of the PROCESS-macro from within jamovi
de: So verwenden Sie die R-Version des PROCESS-Makros innerhalb von jamovi
ja: jamoviからRのPROCESSマクロを使用する
nb: Bruk R-versjonen av PROCESS-makroen innenfor jamovi
ta: சாமோவிக்குள் இருந்து செயல்முறை-மேக்ரோவின் ஆர்-பதிப்பைப் பயன்படுத்தவும்
uk: Використовуйте R-версію макросу PROCESS з jamovi

source: In preparation: You need to install Rj and to download the most recent version of the `PROCESS-macro <from http://processmacro.org/download.html>`__\ . Open the ZIP-file that you downloaded, go into the folder ``PROCESS v... for R`` and extract the ``process.R``-file into your ``Documents``-directory.
de: Zur Vorbereitung: Installieren Sie Rj und laden Sie die neueste Version des `PROCESS-Makros <from http://processmacro.org/download.html>`__\ herunter. Öffnen Sie die ZIP-Datei, die Sie heruntergeladen haben, gehen Sie in den Ordner ``PROCESS v... for R`` und extrahieren Sie die ``process.R``-Datei in Ihr ``Documents``-Verzeichnis.
ja: 準備：Rjをインストールし、 `PROCESSマクロ <from http://processmacro.org/download.html>`__\\ の最新バージョンをダウンロードする必要があります。ダウンロードしたZIPファイルを開き、 ``PROCESS v... for R`` フォルダに移動して、 ``process.R`` ファイルを ``Documents`` （ドキュメント）ディレクトリに展開してください。
nb: Forberedelse: Du må installere Rj og laste ned den nyeste versjonen av `PROCESS-macro <from http://processmacro.org/download.html>`__\ . Åpne ZIP-filen du har lastet ned, gå inn i mappen ``PROCESS v... for R`` og ekstrahere ``prosessen. R``-fil til ``Documents``-mappen (eller ``Dokumenter`` hvis mappenavn et på norsk).
ta: தயாரிப்பில்: நீங்கள் ஆர்.சே.யை நிறுவ வேண்டும் மற்றும் http://processmacro.org/download.html> __ \ க்கு இலிருந்து `செயல்முறை-மேக்ரோ <இன் மிக அண்மைக் கால பதிப்பை பதிவிறக்கம் செய்ய வேண்டும். நீங்கள் பதிவிறக்கம் செய்த சிப்-கோப்பைத் திறந்து, `` செயல்முறை V ... கோப்புறையில் சென்று r`` க்கு `` செயல்முறை.ஆர்``-கோப்பை உங்கள் `` ஆவணங்கள்`-இயக்குநராக பிரித்தெடுக்கவும்.
uk: Підготовка: Вам потрібно встановити Rj та завантажити найновішу версію `PROCESS-macro <з http://processmacro.org/download.html>`__\ . Відкрийте завантажений ZIP-файл, перейдіть до папки ``PROCESS v... for R`` та розпакуйте файл ``process.R`` у каталог ``Documents``.

source: Open a data file that you want to use for your analyses. Afterwards, open ``Rj`` using the ``R``-symbol in the ``Analyses``-icon-bar (``Rj`` is a jamovi module; if you have not installed it yet, you may check :doc:`Install modules in jamovi <howto_Install_modules>`).
de: Öffnen Sie die Datendatei, die Sie für Ihre Analysen verwenden möchten. Öffnen Sie anschließend ``Rj`` mit dem ``R``-Symbol im ``Analyses``-Menüband (``Rj`` ist ein jamovi-Modul; wenn Sie es noch nicht installiert haben, können Sie :doc:`Module in jamovi <howto_Install_modules>` installieren).
ja: "分析に使用したいデータファイルを開きます。その後、 ``Analyses`` （分析）アイコンバーの ``R`` シンボルを使って ``Rj`` を開きます（ ``Rj`` はjamoviのモジュールです。まだインストールしていない場合は、 :doc:`jamoviにモジュールをインストールする <howto_Install_modules>` を確認してください）。
nb: Åpne datafilen du vil bruke for analysene dine. Etterpå åpner du ``Rj`` ved å bruke ``R``-symbolet i ``Analyses``-mnybånd (``Rj`` er en jamovi-modul; hvis du ikke har installert den ennå, kan du sjekke :doc:`Installer moduler i jamovi <howto_Install_modules>`).
ta: உங்கள் பகுப்பாய்வுகளுக்கு நீங்கள் பயன்படுத்த விரும்பும் தரவுக் கோப்பைத் திறக்கவும். பின்னர், `` அனலீச்ச்`-ஐகான்-பட்டியில் `` ஆர்`-சிம்போலைப் பயன்படுத்தி `` ஆர்.சே`` திறக்கவும் (`` ஆர்.சே`` ஒரு சமோவி தொகுதி; நீங்கள் இன்னும் நிறுவவில்லை என்றால், நீங்கள் சரிபார்க்கலாம் .
uk: Відкрийте файл даних, який ви хочете використовувати для аналізу. Після цього відкрийте ``Rj`` за допомогою символу ``R`` на панелі значків ``Analyses`` (``Rj`` — це модуль jamovi; якщо ви ще його не встановили, ви можете перевірити :doc:`Install modules in jamovi <howto_Install_modules>`).

source: Now you are ready to write R-code inside jamovi. Run the following code in the ``Rj`` text box for commands. You may just copy-and-paste the following code.
de: Jetzt sind Sie bereit, R-Code in jamovi zu schreiben. Führen Sie den folgenden Code in der ``Rj`` Textbox für Befehle aus. Sie können den folgenden Befehl einfach kopieren und einfügen.
ja: これで、jamovi内でRコードを記述する準備ができました。コマンド用の ``Rj`` テキストボックスで次のコードを実行してください。次のコードをコピー＆ペーストするだけで構いません。
nb: Nå er du klar til å skrive R-kode innenfor jamovi. Kjør følgende kode i ``Rj``-tekstboksen for kommandoer. Du kan bare kopiere og lime inn den følgende kommandoen.
ta: இப்போது நீங்கள் சாமோவிக்குள் ஆர்-குறியீட்டை எழுத தயாராக உள்ளீர்கள். கட்டளைகளுக்கு `` rj`` உரை பெட்டியில் பின்வரும் குறியீட்டை இயக்கவும். நீங்கள் பின்வரும் குறியீட்டை நகலெடுத்து ஒட்டலாம்.
uk: Тепер ви готові писати R-код всередині jamovi. Виконайте наступний код у текстовому полі ``Rj`` для команд. Ви можете просто скопіювати та вставити наступний код.

source: on Windows
de: unter Windows
ja: Windowsの場合
nb: på Windows
ta: சாளரங்களில்
uk: на Windows

source: on Mac and Linux
de: unter MacOS und Linux
ja: MacおよびLinuxの場合
nb: på MacOS og Linux
ta: மேக் மற்றும் லினக்சில்
uk: на Mac та Linux

source: Run this code (``source…``) by pressing the green triangle. Please be patient, it might take a moment (up to a minute, depending on how fast your computer is). You should see an output like this
de: Führen Sie diesen Code aus (``source…``), indem Sie auf das grüne Dreieck drücken. Bitte haben Sie etwas Geduld, es kann einen Moment dauern (bis zu einer Minute, je nachdem, wie schnell Ihr Computer ist). Dann sollten Sie eine Ausgabe wie diese sehen
ja: 緑色の三角形を押して、このコード（ ``source…`` ）を実行します。しばらく時間がかかる場合があります（コンピュータの速度によっては最大1分程度）ので、お待ちください。次のような出力が表示されるはずです
nb: Kjør denne koden (``source…``) ved å trykke på den grønne trekanten. Vær tålmodig, det kan ta et øyeblikk (opptil et minutt, avhengig av hvor rask datamaskinen din er). Du bør se en utgave som likner dette
ta: பச்சை முக்கோணத்தை அழுத்துவதன் மூலம் இந்த குறியீட்டை (`` மூல… ``) இயக்கவும். தயவுசெய்து பொறுமையாக இருங்கள், இது ஒரு கணம் ஆகலாம் (உங்கள் கணினி எவ்வளவு வேகமாக இருக்கிறது என்பதைப் பொறுத்து ஒரு மணித்துளி வரை). இது போன்ற ஒரு வெளியீட்டை நீங்கள் காண வேண்டும்
uk: Запустіть цей код (``source…``), натиснувши зелений трикутник. Будь ласка, будьте терплячими, це може зайняти деякий час (до хвилини, залежно від швидкості вашого комп'ютера). Ви повинні побачити подібний результат

source: Afterwards, the PROCESS-macro is initialized and you can comment the line out (by putting a ``#`` at the start of the line) → ``# source(…``
de: Dadurch wurde das PROCESS-Makro initialisiert und Sie können die Zeile auskommentieren (indem Sie ein ``#`` an den Anfang der Zeile setzen) → ``# source(…``
ja: その後、PROCESSマクロが初期化されるので、そのあとは行をコメントアウトできます（ ``# source(…`` のように行の先頭に ``#`` を置くことでコメントアウトされます）
nb: Etterpå PROCESS-makroen er initialisert og du kan kommentere linjen ut (ved å sette en ``#`` på begynnelsen av linjen) → ``# source(…``
ta: பின்னர், செயல்முறை-மேக்ரோ துவக்கப்பட்டு, நீங்கள் வரியை கருத்தில் கொள்ளலாம் (வரியின் தொடக்கத்தில் ``# `` வைப்பதன் மூலம்) → ``# மூல (… ``
uk: Після цього макрос PROCESS ініціалізується, і ви можете закоментувати рядок (додавши символ ``#`` на початку рядка) → ``# source(…``
