Repository: sjentsch/jamoviDocs-i18n
Catalog: */LC_MESSAGES/index.po
Languages: de, ja, uk

source: Getting Started
de: Erste Schritte
ja: はじめに
uk: Початок роботи

source: Analyses
de: Analysen
ja: 分析
uk: Аналізи

source: How to...
de: So wird es gemacht...

source: jamovi-modules
de: jamovi-Module

source: From SPSS to jamovi
de: Von SPSS zu jamovi
ja: SPSSからjamoviへ
uk: Від SPSS до jamovi

source: Welcome to the documentation for `jamovi <https://www.jamovi.org>`__, a free and open statistical software to bridge the gap between researcher and statistician.
de: Willkommen zur Dokumentation von `jamovi <https://www.jamovi.org>`__, einer kostenlosen und quelloffenen Statistiksoftware. jamovi möchte Wissenschaftlern einen einfachen Zugang zu komplexen statistischen Methoden bieten.
ja: `jamovi <https://www.jamovi.org>`__ のドキュメントページへようこそ。jamoviは研究者と統計学者を橋渡しする、フリーでオープンな統計ソフトウェアです。
uk: Ласкаво просимо до документації для `jamovi <https://www.jamovi.org>`__, безкоштовного та відкритого статистичного програмного забезпечення, що допомагає подолати розрив між дослідником та статистиком.

source: Before we begin, a brief remark on how to use this web page. The content is available in different languages. To change the language, please head to the “jamovi documentation” roll-up menu (in the bottom-left corner) and click on it. A larger menu unfolds where you can select the language you would like to read the documentation in. So far, only a few languages are translated completely, but you are very welcome to contribute to a `translation into your language <https://hosted.weblate.org/projects/jamovidocs/>`__.
de: Bevor wir beginnen, eine kurze Bemerkung zum Benutzen dieser Webseite. Der Inhalt ist in verschiedenen Sprachen verfügbar. Um die Sprache zu ändern, klicken Sie bitte auf das Rollup-Menü „jamovi documentation“ (in der linken unteren Ecke). Es öffnet sich ein Menü, in dem Sie die Sprache auswählen können, in der Sie die Dokumentation lesen möchten. Bisher sind nur wenige Sprachen vollständig übersetzt, aber Sie können gern zu einer `Übersetzung in Ihre Sprache beizutragen <https://hosted.weblate.org/projects/jamovidocs/>`__.
ja: 最初に、このウェブページの使い方について簡単に説明します。コンテンツは複数の言語で利用できます。言語を変更するには、画面左下にある「jamovi documentation」ロールアップメニューに移動し、クリックしてください。すると、より大きなメニューが表示され、ドキュメントの表示言語を選択できます。現時点では、翻訳済みの言語はまだ少数ですが、翻訳に貢献していただくのは大歓迎です。
uk: Перш ніж ми почнемо, коротке зауваження щодо використання цієї веб-сторінки. Контент доступний різними мовами. Щоб змінити мову, перейдіть до розгортаючого меню «документація jamovi» (у лівому нижньому куті) та натисніть на нього. Розгорнеться більше меню, де ви зможете вибрати мову, якою ви хочете читати документацію. Наразі повністю перекладено лише кілька мов, але ви можете зробити свій внесок у `переклад вашою мовою <https://hosted.weblate.org/projects/jamovidocs/>`__.

source: Getting started
de: Erste Schritte
ja: はじめに
uk: Початок роботи

source: The following topics should get you up and running with jamovi, with additional topics available from the menu to the left.
de: Die folgende Themenübersicht soll Ihnen den Einstieg in jamovi erleichtern. Weitere Themen finden Sie im Menü auf der linken Seite.
ja: 以下のトピックを読めば、jamoviの基本的な使い方が分かります。さらに詳しいトピックについては、左側のメニューからご覧いただけます。
uk: Наведені нижче теми допоможуть вам розпочати роботу з jamovi, а додаткові теми доступні в меню ліворуч.

source: You can find further topics in the menu on the right-hand side: step-for-step instructions for conducting common analyses (“Analyses”), brief instructions how to deal with common tasks (“How to...”), information regarding how to get started with developing modules to extend the function of jamovi (“jamovi-modules”), and information for users of other statistics software packages (“jamovi and other software”) aiming to help with the transition from SPSS, as well as with how to use jamovi and R together.
de: Weitere Themen finden Sie im Menü auf der rechten Seite: Schritt-für-Schritt-Anleitungen zur Durchführung gängiger Analysen („Analysen“), Kurzanleitungen zur Bewältigung gängiger Aufgaben („So wird es gemacht...“), Informationen zum Einstieg in die Entwicklung von Modulen zur Erweiterung von jamovi-Funktionen („Developers Hub“) und Informationen, die den Umstieg von SPSS erleichtern sollen („Von SPSS zu jamovi“).

source: How to…
ja: 操作手順
uk: Як до…

source: Developer hub
ja: 開発者ハブ
uk: Центр розробників

source: You can find further topics in the menu on the right-hand side: step-for-step instructions for conducting common analyses (“Analyses”), brief instructions how to deal with common tasks (“How to…”), information regarding how to get started with developing modules to extend the function of jamovi (“Developers Hub”), and information aiming to ease the transition from SPSS (“From SPSS to jamovi”).
ja: さらに詳しいトピックは、左側のメニューからご覧いただけます。そこには、よく使われる分析を実行する際のステップごとの手順（「分析」）、一般的な操作方法に関する簡単な説明（「操作手順」）、jamoviの機能拡張モジュールの開発に関する情報（「開発者ハブ」）、そしてSPSSからjamoviへの移行をスムーズにするための情報（「SPSSからjamoviへ」）が含まれています。
uk: Ви можете знайти додаткові теми в меню праворуч: покрокові інструкції щодо проведення поширених аналізів («Аналізи»), короткі інструкції щодо виконання поширених завдань («Як…»), інформацію про те, як розпочати розробку модулів для розширення функціональності jamovi («Центр розробників») та інформацію, спрямовану на полегшення переходу з SPSS («З SPSS на jamovi»).
