Repository: sjentsch/jamoviDocs-i18n
Catalog: */LC_MESSAGES/jamovi2r.po
Languages: nb

source: Rj Editor for jamovi
nb: Rj-modulen for jamovi

source: Preparation
nb: Forberedelse

source: First you have to :doc:`install the module <../howto/howto_Install_modules>` Rj from the jamovi library. This will create a «R»-icon in the icon bar.
nb: Først må du :doc:`installere modulen <../howto/howto_Install_modules>` Rj fra jamovi-biblioteket. Dette vil opprette et «R»-ikon på ikonlinjen.

source: Running R commands
nb: Kjøre R-kommandoer

source: Click on the «R» icon and select «Rj Editor».
nb: Klikk på «R»-ikonet og velg «Rj Editor».

source: This opens an input field on the left side where you can use R commands.
nb: Dette åpner et tekstinngavefelt på venstre side hvor du kan skrive inn R-kommandoer.

source: You can access your dataset with the variable ``data``. The first line selects the first three columns of your dataset. Alternatively, you can use variable names as shown in the second line.
nb: Du kan få tilgang til datasettet ditt gjennom variabelen ``data``. Den kommando i første linjen velger de tre første kolonnene i datasettet. Alternativt kan du bruke variabelnavn som vist i kommando på den andre linjen.

source: Sometimes you may need a list of all your variables as a string (e.g., for using them in connection with functions in Computed variables). Of course, you can as well restrict the variables with the column indices as in the command above. Afterwards, you can just copy the output text and insert it, e.g., into a function for a computed variable: ``SUM([insert text you copied])``
nb: Noen ganger kan du trenge en liste over alle variablene dine som en streng (f.eks. for å bruke dem i forbindelse med funksjoner i beregnede variabler). Selvfølgelig kan du like godt begrense variablene med kolonneindeksene som i kommandoen ovenfor. Etterpå kan du bare kopiere utgaveteksten og sette den inn, for eksempel i en funksjon for en beregnet variabel: ``SUM([sett inn tekst du kopierte])``

source: But you can also use functions from R libraries (e.g., ``stats``). When doing so, you may have to precede these functions with the name of the package and ``::``.
nb: Men du kan også bruke funksjoner fra R-biblioteker (f.eks. ``stats``). Når du gjør det, må du kanskje skrive navnet på bibliotek og ``::`` foran disse funksjonene.

source: It may take a bit of time to figure out how to use these functions, especially to discover, e.g., which format is required for the data matrices you use as input to functions (those may need to be converted to numbers with ``as.numeric()`` or to a list with ``list``). But once you managed that, you have unlimited access to (almost) any kind of statistical analysis you can imagine.
nb: Det kan ta litt tid å finne ut hvordan du bruker disse funksjonene, spesielt for å finne ut hvilket format som kreves for datamatrisene du bruker som inngav til funksjoner (de må kanskje konverteres til tall med ``as. numeric()`` eller til en liste med ``list``). Men når du først klarte det, har du ubegrenset tilgang til (nesten) enhver form for statistisk analyse du kan tenke deg.

source: The following commands permits you to list the wealth of R libraries included with jamovi and Rj:
nb: Du kan få en liste av de mange R-bibliotekene som er inkludert med jamovi og Rj med følgende kommandoer:

source: Some of these libraries are especially interesting:
nb: Noen av disse bibliotekene er spesielt interessante:

source: |stats|_ to get access to a wealth of statistical analyses (e.g., ``stats::glm`` for fitting Generalized Linear Models or ``stats:kmeans`` for running k-means cluster analyses)
nb: |stats|_ for å få tilgang til mange statistiske analyser (f.eks. ``stats::glm`` for generaliserte lineære modeller eller ``stats:kmeans`` for k-means-clusteranalyser)

source: |lme4|_ to calculate Linear, Generalized Linear, and Nonlinear mixed modells
nb: |lme4|_ for å beregne *Linear Models*, *Generalized Linear Models* og *Nonlinear Mixed Models*

source: |MASS|_ implements analyses from Venables og Ripley's famous book «Modern Applied Statistics with S» (which includes, e.e., linear discriminant analysis ``MASS::lda``)
nb: |MASS|_ implementerer analyser fra Venables og Ripleys berømte bok «Modern Applied Statistics with S» (som inkluderer, f.eks. lineær diskriminantanalyse ``MASS::lda``)

source: |lavaan|_ to run a wide range of analyses with latent variables (incl. confirmatory factor analysis, structural equation modeling and latent growth curve models)
nb: |lavaan|_ for et bredt spekter av analyser med latente variabler (inkl. bekreftende faktoranalyse, strukturelle ligningsmodeller og latente vekstkurvemodeller)

source: |BayesFactor|_ to run several types of Bayes-analyses to complement your «classical» (frequentist) statistics (e.g. the Bayes-equivalent of the t-test; NB: it is of course easier to use the jamovi-module «jsq» for that)
nb: |BayesFactor|_ for å kjøre flere typer Bayes-analyser i tillegg til din «klassisk» (frekventistisk) statistikk (f.eks. Bayes-ekvivalenten til t-testen; NB: det er selvsagt enda enklere å bruke jamovi-modulen «jsq» for dette)

source: |cluster|_ to run several types of cluster analyses
nb: |cluster|_ for å kjøre flere typer klyngeanalyser

source: |ggplot2|_ to produce (almost) any type of fancy `figures <http://www.ggplot2-exts.org/gallery/>`__ you can imagine
nb: |ggplot2|_ for å produsere (nesten) alle typer `diagrammer <http://www.ggplot2-exts.org/gallery/>`__ du kan forestille deg

source: there are also several of Hadley Wickham's |tidyverse|_ libraries included, e.g., |dplyr|_, |stringr|_ or |tidyselect|_
nb: inkludert er også flere av Hadley Wickhams |tidyverse|_-biblioteker, f.eks. |dplyr|_, |stringr|_ eller |tidyselect|_

source: Switch between R-versions
nb: Bytt mellom R-versjoner

source: Per default, Rj uses the R-installation that is included with jamovi. For most circumstances this will be sufficient (not the least because quite a wealth of libraries is included; see above). However, there might be occasions where you would like to use the R-installation on your computer; typically, if you want to use libraries that are not included in jamovi's R-version. To do this, click on the cogwheel symbol in the top-right corner of the Rj-input field. A window opens where you can set whether you would like to use jamovi's R version («jamovi R» in the dropdown box at the bottom) or your system's R version («System R»). Please note that this option this option is not available for certain system-and-R-version-combinations (e.g., R > 3.4 on Linux).
nb: Som standard bruker Rj R-installasjonen som følger med jamovi. For de fleste omstendigheter vil dette være tilstrekkelig (ikke minst fordi ganske mange biblioteker er allerede inkludert; se ovenfor). Men det kan imidlertid være tilfeller der du vil bruke R-installasjonen på datamaskinen din. Vanligvis skjer det, hvis du ønsker å bruke biblioteker som ikke er inkludert i jamovis R-versjon. For å gjøre dette, klikk på tannhjulsymbolet øverst til høyre i Rj-inngavefeltet. Et vindu åpnes hvor du kan angi om du vil bruke jamovis R-versjon («jamovi R» i rullegardinlisten nederst) eller systemets R-versjon («System R»). Vær oppmerksom på at dette alternativet ikke er tilgjengelig for visse system- og R-versjonskombinasjoner (f.eks. på Linux).

source: jamovi and R
nb: jamovi og R

source: There are a few ways to use jamovi and R together. The first is to use of the :doc:`Rj Editor <j2R_Rj>`, a module available from the jamovi library that allows executing R code from within jamovi.
nb: Det er flere måter å bruke jamovi og R sammen. Den første er å bruke :doc:`Rj Editor <j2R_Rj>`, en modul tilgjengelig fra jamovi-biblioteket som tillater å kjøre R-kode fra jamovi.

source: Another is to use the :doc:`jmv R package <../jmv/jmv_overview>` which makes all the analyses included with jamovi available from an interactive R session (such as in RStudio). jamovi can also provide the equivalent R syntax for each analysis with :doc:`Syntax mode <../usermanual/um_6_syntax_mode>`.
nb: En annen mulighet er å bruke :doc:`jmv R-bibliotek <../jmv/jmv_overview>` som gjør alle analysene inkludert i jamovi tilgjengelig i en R-sesjon (f.eks. i RStudio). jamovi kan gi ut R-syntaks for hver analyse med :doc:`Syntax mode <../usermanual/um_6_syntax_mode>`.
