Repository: sjentsch/jamoviDocs-i18n
Catalog: */LC_MESSAGES/usermanual.po
Languages: de, ja, nb, ta

source: Installation
ja: インストール
nb: Installasjon
ta: நிறுவல்

source: jamovi is available for Windows Vista (64-bit) and above. Installation on windows is quite straight-forward, and should be familiar to anyone who has installed software on Windows before. Download the latest version from the `download page <https://www.jamovi.org/download.html>`__, and double-click the icon.
de: jamovi ist für Windows Vista (64-Bit) und neuere Windows-Versionen verfügbar. Die Installation unter Windows ist einfach: Laden Sie die gewünschte Version von der `Download-Seite <https://www.jamovi.org/download.html>`__ herunter und doppelklicken Sie auf das Symbol der heruntergeladenen Datei.
ja: jamoviは、Windows Vista（64ビット）以降で利用できます。Windowsへのインストールは非常に簡単で、これまでにWindowsでソフトウェアをインストールしたことがある方なら、すぐに分かるはずです。最新版を `ダウンロードページ <https://www.jamovi.org/download.html>`__ から入手し、アイコンをダブルクリックしてください。
nb: jamovi er tilgjengelig for Windows Vista (64-bit) og nyere. Installasjon på Windows er ganske enkel, og bør være kjent for alle som har installert programvare på Windows før. Last ned den nyeste versjonen fra `nedlastingssiden <https://www.jamovi.org/download.html>`__, og dobbeltklikk på ikonet.
ta: சாளரங்கள் விச்டா (64-பிட்) மற்றும் அதற்கு மேல் சாமோவி கிடைக்கிறது. சாளரங்களில் நிறுவல் மிகவும் நேராக முன்னோக்கி உள்ளது, மேலும் இதற்கு முன்பு சாளரங்களில் மென்பொருளை நிறுவிய எவருக்கும் தெரிந்திருக்க வேண்டும். `பதிவிறக்கப் பக்கத்திலிருந்து அண்மைக் கால பதிப்பைப் பதிவிறக்கவும்.

source: At some institutions (particularly universities), the “normal” approach to installing software is blocked by IT security policies. In this case, you can download our ``.zip``-version. To use this, simply download, unzip to a location on the computer, and naviagate to the bin folder. Double-clicking ``jamovi.exe`` will begin jamovi. It’s possible that additional security restrictions prevent jamovi from working in this way, in which case it would be worth raising the issue with your IT staff.
de: In einigen Institutionen (insbesondere Universitäten) wird der „normale“ Ansatz zur Installation von Software (.exe) durch IT-Sicherheitsrichtlinien blockiert. In diesem Fall können Sie die ``.zip``-Version herunterladen. Um diese zu verwenden, laden Sie es einfach herunter, entpacken Sie die Datei in einen Ordner auf dem Computer und navigieren Sie in diesem Ordner zum Unterverzeichnis ``bin``. Durch Doppelklicken auf ``jamovi.exe`` wird jamovi gestartet. Es ist möglich, dass zusätzliche Sicherheitsbeschränkungen verhindern, dass Jamovi auf diese Weise funktioniert. In diesem Fall müssen Sie das Problem bei Ihren IT-Mitarbeitern ansprechen und gemeinsam nach einer Lösung suchen.
ja: 一部の機関（とくに大学など）では、ITセキュリティポリシーにより「普通の方法」でのソフトウェアのインストールが制限されている場合があります。その場合は、 ``.zip`` バージョンをダウンロードしてください。こちらを利用する場合は、ファイルをダウンロードし、パソコン上の任意の場所に展開してください。binフォルダーにある ``jamovi.exe`` をダブルクリックすると、jamoviが起動します。さらに厳しいセキュリティ制限がある場合は、この方法でもjamoviが動作しないことがあります。その際は、IT担当者に相談することをおすすめします。
nb: Noen institusjoner (spesielt universiteter) blokkerer den «vanlige» måten å installere programvare ifm. IT-sikkerhetspolicyer. I dette tilfellet kan du laste ned ``.zip``-versjon. Etter nedlasting pakker du den ut til et sted på datamaskinen, og naviger til bin-mappen. Hvis du dobbeltklikker på ``jamovi.exe`` starter jamovi. Det er fremdeles mulig at ytterligere sikkerhetsbegrensninger hindrer jamovi i å fungere på denne måten, i så fall vil er du nødt å ta opp problemet med IT-avdelingen.
ta: சில நிறுவனங்களில் (குறிப்பாக பல்கலைக்கழகங்கள்), மென்பொருளை நிறுவுவதற்கான “இயல்பான” அணுகுமுறை செய்தி தொழில்நுட்ப பாதுகாப்புக் கொள்கைகளால் தடுக்கப்படுகிறது. இந்த விசயத்தில், நீங்கள் எங்கள் `` .zip`- பதவியைப் பதிவிறக்கலாம். இதைப் பயன்படுத்த, வெறுமனே பதிவிறக்குங்கள், கணினியில் ஒரு இருப்பிடத்திற்கு அன்சிப், மற்றும் பின் கோப்புறைக்கு நாவியாகேட். `` Jamovi.exe`` இரட்டை சொடுக்கு செய்வது சாமோவியைத் தொடங்கும். கூடுதல் பாதுகாப்பு கட்டுப்பாடுகள் சாமோவி இந்த வழியில் செயல்படுவதைத் தடுக்கக்கூடும், இந்த விசயத்தில் உங்கள் செய்தி தொழில்நுட்ப ஊழியர்களுடனான பிரச்சினையை எழுப்புவது மதிப்பு.

source: jamovi is available for macOS 10.9+ (Mavericks and newer). To install it, download the ``.dmg``-file from our `download page <https://www.jamovi.org/download.html>`__, and double-click the downloaded file. This will present you with a “file view”, and you can install jamovi by “dragging-and-dropping” the jamovi application to the Applications folder (in the usual way). After this, jamovi will appear in your applications, and can be started like any other installed application.
de: jamovi ist für macOS 10.9+ (Mavericks und neuer) verfügbar. Laden Sie zur Installation die ``.dmg``-Datei von unserer `Download-Seite <https://www.jamovi.org/download.html>`__ herunter und doppelklicken Sie auf die heruntergeladene Datei. Dadurch wird eine „Dateiansicht“ angezeigt, und Sie können jamovi installieren, indem Sie die jamovi-Anwendung (wie üblich) in den Anwendungsordner ziehen und dort ablegen. Danach wird jamovi in Ihren Anwendungen angezeigt und kann wie jede andere installierte Anwendung gestartet werden.
ja: jamoviはmacOS 10.9以降（Mavericks以降）で利用できます。インストールするには、 `ダウンロードページ <https://www.jamovi.org/download.html>`__ から ``.dmg`` ファイルをダウンロードし、ダウンロードしたファイルをダブルクリックしてください。するとFinder上にアプリケーションのアイコンが表示されるので、jamoviアプリケーションを（いつもどおり）「アプリケーション」フォルダにドラッグ＆ドロップすればインストールできます。その後は、jamoviはアプリケーション一覧に表示され、他のアプリケーションと同様の方法で起動できます。
nb: jamovi er tilgjengelig for macOS 10.9+ (Mavericks og nyere). For å installere programmen, last ned ``.dmg``-filen fra vår `nedlastingsside <https://www.jamovi.org/download.html>`__, og dobbeltklikk på den nedlastede filen. Dette vil presentere deg med en «filvisning|, hvor du kan installere jamovi ved å «dra og slippe» jamovi-applikasjonen til Programmer-mappen (slik som du gjør ved installasjon av andre programmer). Etter dette vil jamovi vises blant applikasjonene dine, og kan startes som alle andre installerte applikasjoner.
ta: மேகோச் 10.9+ (மேவரிக்ச் மற்றும் புதியது) க்கு சாமோவி கிடைக்கிறது. இதை நிறுவ, எங்கள் `பதிவிறக்கப் பக்கத்திலிருந்து` .dmg``-கோப்பைப் பதிவிறக்கி <https://www.jamovi.org/download.html>__ மற்றும் பதிவிறக்கம் செய்யப்பட்ட கோப்பை இருமுறை சொடுக்கு செய்யவும். இது உங்களுக்கு “கோப்புக் காட்சி” வழங்கும், மேலும் சாமோவி பயன்பாட்டை பயன்பாடுகள் கோப்புறையில் (வழக்கமான வழியில்) “இழுத்துச் செல்வதன் மூலம்” சாமோவியை நிறுவலாம். இதற்குப் பிறகு, உங்கள் பயன்பாடுகளில் சாமோவி தோன்றும், மேலும் நிறுவப்பட்ட வேறு எந்த பயன்பாட்டையும் போல தொடங்கலாம்.

source: jamovi for macOS has an auto-update mechanism, and can alert you to when new versions are available. You can update your version of jamovi from the app menu (☰; at the top right of the window).
de: jamovi für macOS verfügt über einen automatischen Aktualisierungsmechanismus. Dieser benachrichtigt Sie, wenn neue Version verfügbar ist. Sie können Ihre jamovi-Version dann über das App-Menü (☰; oben rechts im Fenster) aktualisieren.
ja: macOS版のjamoviには自動アップデート機能があり、新しいバージョンが利用可能になると通知されます。jamoviのバージョンは、アプリのメニュー（ウィンドウ左上の☰）から更新できます。
nb: jamovi for macOS har en mekanisme for automatisk oppdatering, og kan varsle deg om når nye versjoner er tilgjengelige. Du kan oppdatere din versjon av jamovi fra appmenyen (☰; øverst til høyre i vinduet).
ta: MACOS க்கான சாமோவி ஒரு ஆட்டோ-புதுப்பிப்பு பொறிமுறையைக் கொண்டுள்ளது, மேலும் புதிய பதிப்புகள் கிடைக்கும்போது உங்களை எச்சரிக்கலாம். பயன்பாட்டு மெனுவிலிருந்து சாமோவியின் பதிப்பை நீங்கள் புதுப்பிக்கலாம் (☰; சாளரத்தின் மேல் வலதுபுறத்தில்).

source: Linux and Chromebooks
de: Linux und Chromebooks
ja: LinuxおよびChromebook
nb: Linux og Chromebooker
ta: லினக்ச் மற்றும் Chromebooks

source: jamovi is currently available for Linux, (for all ‘flatpak participating linux distributions’ – which is most of them), and Chromebooks, from flathub.
de: jamovi ist für alle Linux-Distributionen, die Flatpak-Installationen erlauben – das ist die überwiegende Mehrzahl – und Chromebooks via flathub.org erhältlich.
ja: Linux（「flatpak」対応のLinuxディストリビューション）およびChromebookでは、jamoviはflathubから利用できます。
nb: jamovi er tilgjengelig for Linux (for alle distribusjoner som støtter «flatpak» - dvs. nesten alle), og Chromebooks, via flathub.
ta: சாமோவி தற்போது லினக்சுக்கு கிடைக்கிறது, (அனைத்து ‘பிளாட்பாக் பங்கேற்கும் லினக்ச் விநியோகங்களுக்கும்’ - அவற்றில் பெரும்பாலானவை) மற்றும் பிளாத்தப்பில் இருந்து Chromebooks.

source: **Note**: Some Chromebooks experience a blank screen issue when starting up jamovi. If you encounter this, there are instructions on how to fix this a little :ref:`further down<blank-screen-on-chromebooks>`.
de: **Hinweis**: Bei einigen Chromebooks startet jamovi mit einem leeren Bildschirm. Wenn Sie auf dieses Problem stoßen, finden Sie Anweisungen, wie Sie dies beheben können :ref:`weiter unten<blank-screen-on-chromebooks>`.
ja: **注意**: 一部のChromebookでは、jamoviの起動時に画面が真っ白になる問題が発生することがあります。この問題が発生した場合は、少し下にある :ref:`こちら<blank-screen-on-chromebooks>` の手順を参照してください。
nb: **Merk**: Noen Chromebook-enheter viser et blank skjerm når du starter jamovi. Hvis du opplever dette problemet, finner du instruksjoner om hvordan du fikser dette litt :ref:`lenger ned<blank-screen-on-chromebooks>`.
ta: ** குறிப்பு **: சமோவியைத் தொடங்கும்போது சில Chromebooks ஒரு வெற்று திரை சிக்கலை அனுபவிக்கின்றன. இதை நீங்கள் சந்தித்தால், இதை எவ்வாறு கொஞ்சம் சரிசெய்வது என்பதற்கான வழிமுறைகள் உள்ளன :ref:`மேலும் கீழே <blank-screen-on-chromebooks>`.

source: If you’re new to flatpak/flathub, you’ll need to follow the setup guide on `our flathub page <https://flathub.org/apps/details/org.jamovi.jamovi>`__.
de: Wenn Sie wenig vertraut mit Flatpaks sind, folgen Sie bitte der Installationsanleitung auf `unserer Flathub-Seite <https://flathub.org/apps/details/org.jamovi.jamovi>`__.
ja: flatpakやflathubを初めて利用する場合は、`flathubのページ <https://flathub.org/apps/details/org.jamovi.jamovi>`__ にあるセットアップガイドに従ってください。
nb: Hvis du ikke har brukt flatpak/flathub før, bør du følge installasjonsveiledningen på `flathub-siden vår <https://flathub.org/apps/details/org.jamovi.jamovi>`__.
ta: நீங்கள் பிளாட்பாக்/பிளாட்டப்பிற்கு புதியவர் என்றால், `எங்கள் பிளாட்டப் பக்கத்தில் உள்ள அமைவு வழிகாட்டியைப் பின்பற்ற வேண்டும் <https://flathub.org/apps/details/org.jamovi.jamovi>__.

source: If you’re an old hand at flatpak, you can install jamovi with the command:
de: Wenn Sie Erfahrung mit flatpak haben, können Sie jamovi einfach mit dem folgenden Befehl installieren:
ja: flatpakの利用に慣れている方は、次のコマンドでもjamoviをインストールできます。
nb: Hvis du har erfaring med flatpak, kan du installere jamovi med kommandoen:
ta: நீங்கள் பிளாட்பேக்கில் பழைய கை என்றால், கட்டளையுடன் சாமோவியை நிறுவலாம்:

source: and later, you can update your version of jamovi with:
de: und mit dem folgenden Befehl können Sie Ihre jamovi-Version später aktualisieren:
ja: jamoviのバージョンをアップデートするには次のコマンドを使用します。
nb: og senere kan du oppdatere din versjon av jamovi med:
ta: பின்னர், சாமோவியின் உங்கள் பதிப்பை நீங்கள் புதுப்பிக்கலாம்:

source: Text not appearing in plots under linux
de: Merkwürdige Sonderzeichen in den Abbildungen unter Linux
ja: Linuxでプロットに文字が表示されない場合
nb: Tekst i diagrammer på linux ser merkelig ut
ta: லினக்சின் கீழ் அடுக்குகளில் உரை தோன்றவில்லை

source: On some linux machines, the flatpak font cache is not up-to-date, resulting in plots in jamovi not displaying text correctly. To remedy this, you can run the following command at the terminal:
de: Auf einigen Linux-Computern wird der Schriftarten-Cache unter Flatpak nicht wie vorgesehen aktualisiert, was dazu führt, dass in Abbildungen in jamovi der Text der Beschriftungen nicht korrekt angezeigt wird. Um dies zu beheben, können Sie den folgenden Befehl im Terminal ausführen:
ja: 一部のLinuxマシンでは、flatpakのフォントキャッシュが最新でないため、jamoviのプロットで文字が正しく表示されないことがあります。この問題を解決するには、ターミナルで以下のコマンドを実行してください。
nb: På noen linux-maskiner er flatpak-fontbufferen ikke oppdatert. Det kan resultere i at diagrammer i jamovi ikke viser teksten riktig. For å avhjelpe dette kan du bruke følgende kommando i terminalen:
ta: சில லினக்ச் இயந்திரங்களில், பிளாட்பாக் எழுத்துரு தற்காலிக சேமிப்பு புதுப்பித்த நிலையில் இல்லை, இதன் விளைவாக சாமோவியில் அடுக்குகள் உரையை சரியாகக் காட்டாது. இதை சரிசெய்ய, நீங்கள் முனையத்தில் பின்வரும் கட்டளையை இயக்கலாம்:

source: This appears to be an issue with flatpaks, and we’re working with the flatpak community to get to the bottom of it.
de: Dies scheint ein Problem mit Flatpaks zu sein, und wir arbeiten mit der Flatpak-Community zusammen, um eine dauerhafte Lösung für das Problem zu finden.
ja: これはflatpakに関連した問題と思われます。私たちは、flatpakコミュニティと協力して原因の解明に取り組んでいます。
nb: Dette ser ut til å være et generelt problem med flatpaks, og vi jobber med flatpak-samfunnet for å finne en løsning for dette problemet.
ta: இது பிளாட்பாக்சுடன் ஒரு சிக்கலாகத் தோன்றுகிறது, மேலும் அதன் அடிப்பகுதிக்குச் செல்ல நாங்கள் பிளாட்பாக் சமூகத்துடன் இணைந்து பணியாற்றி வருகிறோம்.

source: Blank screen at startup on Chromebooks
de: Leerer Bildschirm beim Start von jamovi auf Chromebooks
ja: Chromebookで起動時に画面が真っ白になる場合
nb: Tom skjerm ved oppstart på Chromebook
ta: Chromebooks இல் தொடக்கத்தில் வெற்று திரை

source: Some Chromebooks experience a blank screen when starting up jamovi. The cause of this issue is not completely clear at this time, however it can be fixed by disabling “Crostini GPU support”.
de: Auf einigen Chromebooks wird beim Starten von jamovi ein leerer Bildschirm angezeigt. Die Ursache dieses Problems ist derzeit noch nicht vollständig geklärt. Sie lässt sich jedoch durch Deaktivieren der „Crostini-GPU-Unterstützung“ beheben.
ja: 一部のChromebookでは、jamoviの起動時に画面が真っ白になることがあります。この問題の原因は現時点では完全には分かっていませんが、「Crostini GPUサポート」を無効にすることで解決できます。
nb: Noen Chromebook-enheter opplever en tom skjerm når du starter jamovi. Årsaken til dette problemet er ikke helt klart på dette tidspunktet, men det kan løses ved å deaktivere «Crostini GPU-støtte».
ta: சாமோவியைத் தொடங்கும்போது சில Chromebooks ஒரு வெற்று திரையை அனுபவிக்கின்றன. இந்த நேரத்தில் இந்த சிக்கலுக்கான காரணம் முற்றிலும் தெளிவாக இல்லை, இருப்பினும் “குரோச்டினி சி.பீ. ஆதரவை” முடக்குவதன் மூலம் இதை சரிசெய்ய முடியும்.

source: Enter ``chrome://flags/`` into the ChromeOS address bar. This will bring up “Experiments”. Search for ``Crostini GPU Support`` and set it to disabled. After restarting your Chromebook the issue will be fixed (special thanks to `@mulderc <https://github.com/mulderc>`__).
de: Geben Sie ``chrome://flags/`` in der ChromeOS-Adressleiste ein. Dies öffnet \"Experimentelle Einstellungen\". Suchen Sie nach ``Crostini GPU Support`` und deaktivieren Sie die Einstellung. Nach dem Neustart Ihres Chromebooks ist das Problem behoben (Danke an `@mulderc <https://github.com/mulderc>`__" für den Hinweis).
ja: ChromeOSのアドレスバーに ``chrome://flags/`` と入力してください。これで「Experiments（試験運用機能）」の画面が表示されます。 ``Crostini GPU Support`` で検索し、「停止中（disabled）」に設定してください。Chromebookを再起動すると問題が解決します（`@mulderc <https://github.com/mulderc>`__ に感謝！）。
nb: Skriv inn ``chrome://flags/`` i ChromeOS-adresselinjen. Dette vil få opp «Eksperimenter». Søk etter ``Crostini GPU Support`` og sett den til deaktivert. Etter å ha startet Chromebooken på nytt vil problemet løses (spesiell takk til `@mulderc <https://github.com/mulderc>`__).
ta: Chromeos முகவரி பட்டியில் `` Chrome: // கொடிகள்/`` உள்ளிடவும். இது “சோதனைகளை” கொண்டு வரும். `` க்ரோச்டினி சி.பீ.யு ஆதரவைத் தேடி அதை முடக்குவதற்கு அமைக்கவும். உங்கள் Chromebook ஐ மறுதொடக்கம் செய்த பிறகு, சிக்கல் சரி செய்யப்படும் (`mullderc <https://github.com/mulderc> ____) க்கு சிறப்பு நன்றி.

source: First steps in jamovi
de: Die ersten Schritte in jamovi
ja: 最初の一歩
nb: De første trinnene i jamovi
ta: சாமோவியில் முதல் படிகள்

source: When first starting jamovi, you will be presented with a user interface which looks something like this.
de: Wenn Sie jamovi zum ersten Mal starten, wird Ihnen eine Benutzeroberfläche präsentiert, die in etwa so aussieht:
ja: 初めてjamoviを起動すると、次のようなユーザーインターフェースが表示されます。
nb: Når du først starter jamovi, vil du bli presentert med et brukergrensesnitt som ser omtrent slik ut.
ta: முதலில் சாமோவியைத் தொடங்கும்போது, உங்களுக்கு ஒரு பயனர் இடைமுகம் வழங்கப்படும், இது இதுபோன்றதாகத் தெரிகிறது.

source: To the left is the spreadsheet view, and to the right is where the results of statistical tests appear. Down the middle is a bar separating these two regions, and this can be dragged to the left or the right to change their sizes.
de: Auf der linken Seite befindet sich die Datentabelle und auf der rechten Seite werden die Ergebnisse der statistischen Analysen angezeigt. In der Mitte befindet sich ein Balken, der diese beiden Bereiche trennt und der mit der Maus nach links oder rechts verschoben werden kann, um die Größe der beiden Teile zu ändern.
ja: 左側にはスプレッドシートビューがあり、右側には統計結果が表示されます。中央にはこれら2つの領域を分けるバーがあり、このバーを左右にドラッグすれば、それぞれの領域の大きさを変更できます。
nb: Til venstre er regnearkvisningen, og til høyre vises resultatene av statistiske tester. Nedover midten er en stolpe som skiller disse to områdene, og dette kan dras til venstre eller høyre for å endre størrelsen.
ta: இடதுபுறத்தில் விரிதாள் பார்வை உள்ளது, வலதுபுறம் புள்ளிவிவர சோதனைகளின் முடிவுகள் தோன்றும். இந்த இரண்டு பிராந்தியங்களையும் பிரிக்கும் ஒரு பட்டியில் நடுத்தரத்திற்கு கீழே உள்ளது, மேலும் இது அவற்றின் அளவுகளை மாற்ற இடது அல்லது வலதுபுறத்தில் இழுக்கப்படலாம்.

source: It is possible to simply begin typing values into the jamovi spreadsheet as you would any other spreadsheet software.
de: Sie können einfach beginnen, Werte in die jamovi-Datentabelle einzutippen, genauso wie Sie es in jeder anderen Tabellenkalkulationssoftware tun würden.
ja: jamoviのスプレッドシートは、他の表計算ソフトと同じように、直接値を入力できます。
nb: Det er mulig å bare begynne å skrive inn verdier i jamovi-regnearket som du ville gjort med annen regnearkprogramvare.
ta: நீங்கள் வேறு எந்த விரிதாள் மென்பொருளையும் போலவே சாமோவி விரிதாளில் மதிப்புகளைத் தட்டச்சு செய்யத் தொடங்கலாம்.

source: Alternatively, existing data sets in a range of formats (CSV, Excel, LibreOffice, R, SPSS, Stata, SAS, etc.) can be opened in jamovi. Additionally, there are a number of example data sets available in jamovi. To open a file, select the file menu (☰, at the top left hand corner of jamovi), select ``Open`` and then ``Data library`` or ``This PC``, depending on whether you want to open an example, or a file stored on your computer.
de: Alternativ können existierende Datendateien in verschiedenen Formaten (CSV, Excel, LibreOffice, R, SPSS, Stata, SAS, JASP) in jamovi geöffnet werden. Außerdem ist eine Reihe von Beispieldaten in jamovi verfügbar. Um eine Datei zu öffnen, wählen Sie das Dateimenü (☰, oben links in jamovi), wählen Sie ``Öffnen`` und dann ``Dieser PC`` oder ``Datenbibliothek``, je nachdem, ob Sie eine auf Ihrem Computer gespeicherte Datei oder einen Beispieldatensatz öffnen wollen.
ja: あるいは、既存のデータセット（CSV、Excel、LibreOffice、R、SPSS、Stata、SASなど）をjamoviで開くこともできます。また、jamoviにはいくつかのサンプルデータセットも用意されています。ファイルを開くには、jamovi画面左上のファイルメニュー（☰）を選択し、 ``開く`` （Open）を選んでから、サンプルデータを開きたい場合は ``データライブラリ`` （Data library）を、パソコンに保存されているファイルを開きたい場合は ``このPC`` （This PC）を選択します。
nb: Alternativt kan eksisterende datasett i en rekke formater (CSV, Excel, LibreOffice, R, SPSS, Stata, SAS, etc.) åpnes i jamovi. I tillegg finnes det en rekke eksempeldatasett. Hvis du vil åpne en fil, velger du filmenyen (☰ øverst til venstre i jamovi), deretter Åpne og Denne PCen eller Databibliotek, avhengig av om du vil åpne en fil som er lagret på datamaskinen eller et eksempel.
ta: மாற்றாக, தற்போதுள்ள தரவுத் தொகுப்புகள் பலவிதமான வடிவங்களில் (சி.எச்.வி, எக்செல், லிப்ரேஃபிச், ஆர், எச்.பி.எச்.எச், ச்டேட்டா, எச்.ஏ.எச் போன்றவை) சமோவியில் திறக்கப்படலாம். கூடுதலாக, சாமோவியில் பல எடுத்துக்காட்டு தரவுத் தொகுப்புகள் உள்ளன. ஒரு கோப்பைத் திறக்க, கோப்பு மெனுவைத் தேர்ந்தெடுக்கவும் (☰, சமோவியின் மேல் இடது மூலையில்), `` திறந்திருக்கும்`` என்பதைத் தேர்ந்தெடுத்து, பின்னர் `` தரவு நூலகம்`` அல்லது `` இந்த பிசி`` என்பதைத் தேர்ந்தெடுத்து, நீங்கள் விரும்புகிறீர்களா என்பதைப் பொறுத்து ஒரு எடுத்துக்காட்டு அல்லது உங்கள் கணினியில் சேமிக்கப்பட்ட கோப்பைத் திறக்கவும்.

source: A very common format for exchanging data is using files with “comma- separated values” (.csv or .txt). Given that these data are stored as simple text file using commas (or ";", "|", etc.) to separate values nearly any software package can read and write them (and you to can take a look using any text editor). An example is shown in the figure. The first line contains the variable names and any other line afterwards a measurement point (typically a person where data were acquired from). If you have your data in a spreadsheet program (e.g., Excel), you can create a CSV-file from your data by selecting ``File`` → ``Save as...`` and choose ``Comma delimited`` in the drop-down menu close to the ``Save as``-button. Thereafter, you may open the CSV-file in jamovi.
de: Ein sehr gebräuchliches Format für Datendateien sind Dateien mit "Komma-getrennten Werten" (.csv oder .txt). Da diese Daten als einfache Textdateien mit Kommas (oder ";", "|" usw.) zur Trennung von Variablen gespeichert werden, kann (fast) jedes Softwarepaket sie lesen und schreiben (und Sie können sie mit jedm beliebigen Texteditor ansehen). Ein Beispiel ist in der Abbildung dargestellt. Die erste Zeile enthält die Variablennamen und jede weitere Zeile danach einen Messpunkt (typischerweise eine Person, von der Daten erfasst wurden). Wenn Sie Ihre Daten in einem Tabellenkalkulationsprogramm (z.B. Excel) eingegeben haben, können Sie eine CSV-Datei aus Ihren Daten erstellen, indem Sie ``Datei`` → ``Speichern unter...`` wählen und in dem Drop-Down-Menü neben dem ``Speichern unter`` die Option ``Comma delimited`` auswählen. Danach können Sie die CSV-Datei in jamovi öffnen.
ja: データ交換で非常によく使われる形式が「カンマ区切り値」（.csvや.txt）ファイルです。これらのデータは、値をカンマ（または「;」、「|」など）で区切った単純なテキストファイルとして保存されているため、ほとんどすべてのソフトウェアで読み書きが可能です（また、任意のテキストエディタで中身を確認することもできます）。図にはその例が示してあります。最初の行には変数名が記載されており、それ以降の各行には測定データ（通常はデータを取得した各個人の情報）が記載されています。もしデータが表計算ソフト（例：Excel）にある場合は、 ``ファイル`` → ``名前を付けて保存`` を選択し、 ``保存`` ボタン付近のドロップダウンメニューから ``カンマ区切り（CSV）`` を選ぶことでCSVファイルを作成できます。その後、そのCSVファイルをjamoviで開くことができます。
nb: Et svært vanlig format for utveksling av data er å bruke filer med "kommadelte verdier" (.csv eller .txt). Gitt at disse dataene lagres som enkel tekstfil ved hjelp av kommaer (eller ";", "|", etc.) for å skille verdier nesten alle programvarepakker kan lese og skrive dem (og du kan ta en titt ved hjelp av tekstredigeringsprogrammer). Et eksempel vises i figuren. Den første linjen inneholder variabelnavnene og en hvilken som helst annen linje etterpå et målepunkt (vanligvis en person der data ble hentet fra). Hvis du har dataene dine i et regnearkprogram (for eksempel Excel), kan du opprette en CSV-fil fra dataene dine ved å velge ''Fil'' → ''Lagre som...'' og velg ''Kommadelt'' i rullegardinmenyen nær ''Lagre som'-knappen. Deretter kan du åpne CSV-filen i jamovi.
ta: தரவைப் பரிமாறிக் கொள்வதற்கான மிகவும் பொதுவான வடிவம் “கமா-பிரிக்கப்பட்ட மதிப்புகள்” (.csv அல்லது .txt) உடன் கோப்புகளைப் பயன்படுத்துகிறது. இந்தத் தரவுகள் கம்மாக்களைப் பயன்படுத்தி எளிய உரை கோப்பாக சேமிக்கப்படுகின்றன (அல்லது ";", "|" . ஒரு எடுத்துக்காட்டு படத்தில் காட்டப்பட்டுள்ளது. முதல் வரியில் மாறி பெயர்கள் மற்றும் வேறு எந்த வரியும் ஒரு அளவீட்டு புள்ளியைக் கொண்டுள்ளது (பொதுவாக தரவு பெறப்பட்ட ஒரு நபர்). ஒரு விரிதாள் நிரலில் (எ.கா., எக்செல்) உங்கள் தரவு இருந்தால், `` கோப்பு` `` `சேமிக்கவும் ...` `மற்றும்` `கமா பிரிக்கப்பட்ட`` கீழ்தோன்றும் பட்டியலில் `` சேமிக்கவும். அதன்பிறகு, நீங்கள் சாமோவியில் CSV-FILE ஐ திறக்கலாம்.
