Repository: sjentsch/jamoviDocs-i18n
Catalog: */LC_MESSAGES/usermanual.po
Languages: de, ja, nb, ta

source: In fact we can specify this formula in addition to the ``ROW() != 9`` formula if we like. We can add it as another expression to ``Filter 1`` (by clicking the small ``+`` beside the first formula), or we can add it as an additional filter (by selecting the large ``+`` to the left of the filters dialog box). As we’ll see, adding an expression to an existing filter does not provide exactly the same behaviour as creating a separate filter. In this case however, it doesn’t make a difference, so we’ll just add it to the existing filter. This additional expression comes to be represented with its own column as well, and by looking at the ticks and crosses, we can see which filter or expression is responsible for excluding each row.
de: Wir können diese Formel sogar zusätzlich zur Formel ``ROW() != 9`` verwenden, wenn wir wollen. Wir können sie als weiteren Ausdruck zu ``Filter 1`` hinzufügen (indem wir auf das kleine ``+`` neben der ersten Formel klicken), oder wir können sie als zusätzlichen Filter hinzufügen (indem wir das große ``+`` auf der linken Seite des Filter-Dialogfelds auswählen). Wie wir sehen werden, bietet das Hinzufügen eines Ausdrucks zu einem bestehenden Filter nicht genau dasselbe Verhalten wie das Erstellen eines separaten Filters. In diesem Fall macht es jedoch keinen Unterschied, also fügen wir ihn einfach dem vorhandenen Filter hinzu. Dieser zusätzliche Ausdruck wird ebenfalls in einer eigenen Spalte dargestellt, und anhand der Häkchen und Kreuze können wir sehen, welcher Filter oder Ausdruck für den Ausschluss jeder Zeile verantwortlich ist.
ja: 必要であれば、この数式を ``ROW() != 9`` の数式と一緒に指定することもできます。最初の数式の横にある小さな``+``をクリックして ``フィルタ1`` に別の式として追加することもできますし、フィルタのダイアログボックスの左側にある大きな ``+`` を選択して追加のフィルタとして追加することもできます。後ほど説明しますが、既存のフィルターに式を追加する場合と、別のフィルターを作成する場合とでは、動作が異なる場合があります。しかし、この場合は違いがないので、既存のフィルターに追加します。この追加した式にも独自の列が表示され、チェックマークや×印を見ることで、どのフィルターや式が各行を除外しているのかを確認できます。
nb: Vi kan faktisk spesifisere denne formelen i tillegg til ``ROW() != 9``-formelen hvis vi ønsker det. Vi kan legge den til som et nytt uttrykk til ``Filter 1`` (ved å klikke på det lille ``+`` ved siden av den første formelen), eller vi kan legge den til som et ekstra filter (ved å velge det store ``+`` til venstre i filterdialogboksen). Som vi skal se, fungerer det å legge til et uttrykk i et eksisterende filter ikke på nøyaktig samme måte som å opprette et eget filter. I dette tilfellet spiller det imidlertid ingen rolle, så vi legger det bare til i det eksisterende filteret. Dette ekstra uttrykket blir også representert med sin egen kolonne, og ved å se på flått og kryss kan vi se hvilket filter eller uttrykk som er ansvarlig for å ekskludere hver rad.
ta: உண்மையில் நாம் விரும்பினால் `` வரிசை ()! = 9`` சூத்திரத்துடன் கூடுதலாக இந்த சூத்திரத்தை நாம் குறிப்பிடலாம். `` வடிகட்டி 1`` க்கு (முதல் சூத்திரத்தின் அருகே சிறிய `+` `என்பதைக் சொடுக்கு செய்வதன் மூலம்) மற்றொரு வெளிப்பாடாக இதைச் சேர்க்கலாம், அல்லது அதை கூடுதல் வடிப்பானாக சேர்க்கலாம் (பெரிய` `+` `ஐத் தேர்ந்தெடுப்பதன் மூலம் இதைச் சேர்க்கலாம் வடிப்பான்கள் உரையாடல் பெட்டியின் இடது). நாம் பார்ப்பது போல், ஏற்கனவே உள்ள வடிப்பானில் ஒரு வெளிப்பாட்டைச் சேர்ப்பது ஒரு தனி வடிப்பானை உருவாக்கும் அதே நடத்தையை வழங்காது. இருப்பினும், இந்த விசயத்தில், இது ஒரு வித்தியாசத்தை ஏற்படுத்தாது, எனவே நாங்கள் அதை ஏற்கனவே உள்ள வடிப்பானில் சேர்ப்போம். இந்த கூடுதல் வெளிப்பாடு அதன் சொந்த நெடுவரிசையுடன் குறிப்பிடப்படுகிறது, மேலும் உண்ணி மற்றும் சிலுவைகளைப் பார்ப்பதன் மூலம், ஒவ்வொரு வரிசையையும் விலக்குவதற்கு எந்த வடிகட்டி அல்லது வெளிப்பாடு பொறுப்பு என்பதை நாம் காணலாம்.

source: But let’s say we want to exclude from the analysis all the tooth lengths that were more than 1.5 standard deviations from the mean. To do this, we’d take a z-score, and check that it falls between -1.5 and 1.5. we could use one of the following formulas (this second formula is a great way to demonstrate to students what a z-score is):
de: Aber nehmen wir an, wir wollen alle Zahnlängen, die mehr als 1,5 Standardabweichungen vom Mittelwert abweichen, aus der Analyse ausschließen. Dazu nehmen wir eine z-Standardisierung vor und prüfen, ob der z-Wert zwischen -1,5 und 1,5 liegt. Wir könnten eine der folgenden Formeln verwenden (diese zweite Formel eignet sich hervorragend, um den Studenten zu zeigen, was ein z-Wert ist):
ja: 今度は、平均から1.5標準偏差を超えるすべての歯の長さを分析から除外したいとしましょう。そのためには、zスコアを計算し、それが−1.5から1.5の間にあるかを確認します。次のいずれかの数式を使えばよいでしょう（2つ目の数式は、zスコアが何かを学生に説明するのにとてもよい方法です）。
nb: Men la oss si at vi ønsker å ekskludere alle tannlengder som var mer enn 1,5 standardavvik fra gjennomsnittet, fra analysen. For å gjøre dette tar vi en z-score og sjekker at den ligger mellom -1,5 og 1,5. Vi kan bruke en av følgende formler (den andre formelen er en fin måte å demonstrere for elevene hva en z-score er):
ta: ஆனால் சராசரியிலிருந்து 1.5 நிலையான விலகல்களுக்கு மேல் இருந்த அனைத்து பல் நீளங்களையும் பகுப்பாய்விலிருந்து விலக்க விரும்புகிறோம் என்று சொல்லலாம். இதைச் செய்ய, நாங்கள் ஒரு சட் மதிப்பெண் எடுப்போம், அது -1.5 முதல் 1.5 வரை விழுகிறதா என்பதை சரிபார்க்கவும். பின்வரும் சூத்திரங்களில் ஒன்றை நாங்கள் பயன்படுத்தலாம் (இந்த இரண்டாவது தேற்றம் ஒரு இசட்-ச்கோர் என்றால் என்ன என்பதை மாணவர்களுக்கு நிரூபிக்க ஒரு சிறந்த வழியாகும்):

source: There are a lot of functions available in jamovi, and you can see them by clicking the small *f*\ :sub:`x` beside the formula box.
de: In jamovi stehen viele Funktionen zur Verfügung. Sie können sie sehen, wenn Sie auf das kleine *f*\ :sub:`x` neben dem Formel-Eingabefeld klicken.
ja: jamovi には多くの関数が用意されており、数式ボックスの横にある小さな *f*\ :sub:`x` をクリックすると、それらを確認できます。
nb: Det finnes mange funksjoner i jamovi, og du kan se dem ved å klikke på den lille *f*\ :sub:`x` ved siden av formelboksen.
ta: சாமோவியில் நிறைய செயல்பாடுகள் உள்ளன, மேலும் சிறிய *f *\: `x` ஃபார்முலா பெட்டியின் அருகே சொடுக்கு செய்வதன் மூலம் அவற்றைக் காணலாம்.

source: Now let’s add this z-score formula to a separate filter by clicking the large ``+`` to the left of the filters, and adding it to ``Filter 2``.
de: Fügen wir nun diese Formel zur z-Standardisierung als einen separaten Filter hinzu. Dazu klicken wir auf das große ``+`` links neben den Filtern und fügren die Formel zu ``Filter 2`` hinzu.
ja: 次に、フィルターの左側にある大きな ``+`` をクリックして、このzスコアの数式を別のフィルターとして追加し、 ``フィルタ2`` に追加しましょう。
nb: La oss nå legge til denne formelen for z-transformering i et eget filter ved å klikke på det store ``+`` til venstre for filtrene, og legge den til ``Filter 2``.
ta: இப்போது இந்த இசட்-ச்கோர் சூத்திரத்தை ஒரு தனி வடிப்பானில் சேர்ப்போம், வடிப்பான்களின் இடதுபுறத்தில் பெரிய ``+`` என்பதைக் சொடுக்கு செய்து, அதை `` வடிகட்டி 2`` இல் சேர்ப்போம்.

source: With multiple filters, the filtered rows cascade from one filter into the next. So only the rows allowed through by ``Filter 1`` are used in the calculations for ``Filter 2``. In this case, the mean and standard deviation for the z-score will be based only on the vitamin C rows (and also not on row 9). In contrast, if we’d specified our ``Z()`` filter as an additional expression in ``Filter 1``, then the mean and standard deviation for the z-score would be based on the entire dataset. In this way you can specify arbitrarily complex rules for when a row should be included in analyses or not (but you should pre-register your rules).\ [#]_
de: Bei mehreren Filtern werden die gefilterten Zeilen kaskadenartig von einem Filter in den nächsten übertragen. So werden nur die Zeilen, die von ``Filter 1`` durchgelassen wurden, in den Berechnungen für ``Filter 2`` verwendet. In diesem Fall basieren der Mittelwert und die Standardabweichung für den z-Score nur auf den Vitamin-C-Zeilen (und auch nicht auf Zeile 9). Hätten wir dagegen unseren Filter ``Z()`` als zusätzlichen Ausdruck in ``Filter 1`` angegeben, dann würden der Mittelwert und die Standardabweichung für den z-Score auf dem gesamten Datensatz basieren. Auf diese Weise können Sie beliebig komplexe Regeln dafür festlegen, wann eine Zeile in die Analysen einbezogen werden soll oder nicht (Sie sollten Ihre Regeln jedoch im prå-registrieren).\ [#]_
ja: 複数のフィルタがある場合、フィルタされた行は1つのフィルタから次のフィルタへと連鎖していきます。つまり、``フィルタ 1`` を通過した行だけが ``フィルタ2`` の計算に使用されます。この場合、zスコアの平均と標準偏差はビタミンCの行（および9行目を除く）だけに基づいて計算されます。対照的に、 ``Z()`` フィルターを ``フィルタ1`` の追加の式として指定した場合、zスコアの平均と標準偏差はデータセット全体に基づいて計算されます。このようにして、どの行を分析に含めるかについて任意に複雑なルールを指定することができます（ただし、ルールは事前登録しておくべきです）。\ [#]_
nb: Med flere filtre behandles de filtrerte radene i kaskader fra det første filteret til de neste. Det er altså bare de radene som slippes gjennom av ``Filter 1`` som brukes i beregningene for ``Filter 2``. I dette tilfellet vil gjennomsnittet og standardavviket for de z-transformerte verdiene kun være basert på radene med vitamin C (og heller ikke på rad 9). Hvis vi derimot hadde spesifisert ``Z()``-filteret vårt som et ekstra uttrykk i ``Filter 1``, ville gjennomsnittet og standardavviket for de z-transformerte verdiene være basert på hele datasettet. På denne måten kan du spesifisere vilkårlig komplekse regler for når en rad skal inkluderes i analyser eller ikke (men du bør forhåndsregistrere reglene dine).\ [#]_
ta: பல வடிப்பான்களுடன், வடிகட்டப்பட்ட வரிசைகள் ஒரு வடிகட்டியிலிருந்து அடுத்ததாக இருக்கும். எனவே `` வடிகட்டி 1`` மூலம் அனுமதிக்கப்பட்ட வரிசைகள் மட்டுமே `` வடிகட்டி 2`` க்கான கணக்கீடுகளில் பயன்படுத்தப்படுகின்றன. இந்த வழக்கில், இசட்-ச்கோருக்கான சராசரி மற்றும் நிலையான விலகல் வைட்டமின் சி வரிசைகளை மட்டுமே அடிப்படையாகக் கொண்டது (மேலும் 9 வது வரிசையிலும் இல்லை). இதற்கு நேர்மாறாக, `` சட் () `` வடிகட்டி 1` `வடிகட்டி 1`` இல் எங்கள்` `z ()` வடிகட்டியை நாங்கள் குறிப்பிட்டால், z- மதிப்பெண்ணுக்கான சராசரி மற்றும் நிலையான விலகல் முழு தரவுத்தொகுப்பின் அடிப்படையில் இருக்கும். இந்த வழியில் நீங்கள் எப்போது ஒரு வரிசை பகுப்பாய்வுகளில் சேர்க்கப்பட வேண்டுமா இல்லையா என்பதற்கான தன்னிச்சையாக சிக்கலான விதிகளை நீங்கள் குறிப்பிடலாம் (ஆனால் நீங்கள் உங்கள் விதிகளை முன்கூட்டியே பதிவு செய்ய வேண்டும்). \ [#] _ _

source: **Column filters**
de: **Variablenfilter**
ja: **列フィルタ**
nb: **Kolonnefiltre**
ta: ** நெடுவரிசை வடிப்பான்கள் **

source: Whereas row filters are applied to the data set as a whole, sometimes you want to just filter individual columns. Column filters come in handy when you want to filter some rows for some analyses, but not for all. This is achieved with the computed variable system. With the computed variables we create a copy of an existing column, but with the unwanted values excluded.
de: Während Zeilenfilter auf den Datensatz als Ganzes angewendet werden, möchten Sie manchmal nur einzelne Spalten filtern. Spaltenfilter sind nützlich, wenn Sie einige Zeilen für bestimmte Analysen auswählen wollen, aber nicht für alle. Dies wird durch berechnete Variablen erreicht. Mit einer solchen berechneten Variablen erstellen wir eine Kopie einer vorhandenen Spalte, wo nur die erwünschten (zu analysierenden) Werte eingeschlossen werden.
ja: 行フィルターがデータセット全体に適用されるのに対し、個々の列だけをフィルタリングしたい場合もあります。列フィルターは、一部の分析で特定の行をフィルタリングしたい場合に便利です。これは計算変数システムによって実現されます。計算変数を使うことで、不要な値が除外された、既存の列のコピーを作成できます。
nb: Mens radfiltre brukes på datasettet som helhet, vil du noen ganger bare filtrere enkelte kolonner. Kolonnefiltre er nyttige når du ønsker å filtrere noen rader for noen analyser, men ikke for alle. Dette gjøres ved hjelp av systemet med beregnede variabler. Med de beregnede variablene lager vi en kopi av en eksisterende kolonne, hvor de uønskede verdiene blir ekskludert.
ta: ஒட்டுமொத்தமாக தரவு தொகுப்பில் வரிசை வடிப்பான்கள் பயன்படுத்தப்படுகின்றன, சில நேரங்களில் நீங்கள் தனிப்பட்ட நெடுவரிசைகளை வடிகட்ட விரும்புகிறீர்கள். சில பகுப்பாய்வுகளுக்கு சில வரிசைகளை வடிகட்ட விரும்பும் போது நெடுவரிசை வடிப்பான்கள் கைக்குள் வரும், ஆனால் அனைவருக்கும் அல்ல. கணக்கிடப்பட்ட மாறி அமைப்புடன் இது அடையப்படுகிறது. கணக்கிடப்பட்ட மாறிகள் மூலம் ஏற்கனவே இருக்கும் நெடுவரிசையின் நகலை உருவாக்குகிறோம், ஆனால் தேவையற்ற மதிப்புகள் விலக்கப்பட்டுள்ளன.

source: In the Tooth Growth example, we might want to analyse the doses of 500 and 1000, and 1000 and 2000 separately. To do this we create a new column for each subset. So in our example, we can select the dose column in the jamovi spreadsheet, and then select the Compute button from the data tab. This creates a new column to the right called dose (2), and same as the filters, we can enter a formula. in this case we’ll enter one of the formulas below (the do the same, the second is perhaps easier to understand):
de: Im Beispiel des ``Tooth Growth``-Datensatzes möchten wir vielleicht die verschiedenen Dosierungen 500 und 1000 sowie 1000 und 2000 getrennt analysieren. Zu diesem Zweck erstellen wir eine neue Spalte für jede dieser Untergruppen. In unserem Beispiel können wir also die Spalte ``dose`` im der jamovi-Datentabelle auswählen und dann in der Registerkarte ``Daten`` die Schaltfläche ``Berechnen`` wählen. Dadurch wird rechts eine neue Spalte mit dem Namen ``dose (2)`` erstellt, und wie bei den Filtern können wir eine Formel eingeben. In diesem Fall geben wir eine der folgenden Formeln ein (die beiden sind gleich, die zweite ist vielleicht einfacher zu verstehen):
ja: Tooth Growthの例で、500と1000、または1000と2000の用量を別々に分析したいとします。そのためには、それぞれのサブセットごとに新しい列を作成します。例えば、jamoviのスプレッドシートでdose列を選択し、データタブから「計算」ボタンを選択します。これにより、右側にdose (2)という新しい列が作成され、フィルターと同様に数式を入力できます。今回は、以下のいずれかの数式を入力します（どちらも同じ処理ですが、2つ目の方が分かりやすいかもしれません）。
nb: I eksemplet med tannvekst ønsker vi kanskje å analysere dosene 500 og 1000, og 1000 og 2000 hver for seg. For å gjøre dette oppretter vi en ny kolonne for hvert delsett. I vårt eksempel kan vi velge kolonnen ``dose`` i jamovi-regnearket, og deretter velge knappen ``Beregn`` i ``Data``-båndet. Dette oppretter en ny kolonne til høyre som heter ``dose (2)``, og på samme måte som for filtrene kan vi legge inn en formel. i dette tilfellet legger vi inn en av formlene nedenfor (de gjør det samme, den andre er kanskje lettere å forstå):
ta: பல் வளர்ச்சி எடுத்துக்காட்டில், 500 மற்றும் 1000, மற்றும் 1000 மற்றும் 2000 அளவுகளை தனித்தனியாக பகுப்பாய்வு செய்ய விரும்பலாம். இதைச் செய்ய ஒவ்வொரு துணைக்குழுவிற்கும் ஒரு புதிய நெடுவரிசையை உருவாக்குகிறோம். எனவே எங்கள் எடுத்துக்காட்டில், சாமோவி விரிதாளில் உள்ள டோச் நெடுவரிசையைத் தேர்ந்தெடுத்து, தரவு தாவலில் இருந்து கம்ப்யூட் பொத்தானைத் தேர்ந்தெடுக்கலாம். இது டோச் (2) எனப்படும் வலதுபுறத்தில் ஒரு புதிய நெடுவரிசையை உருவாக்குகிறது, மேலும் வடிப்பான்களைப் போலவே, நாம் ஒரு சூத்திரத்தை உள்ளிடலாம். இந்த விசயத்தில் நாங்கள் கீழே உள்ள சூத்திரங்களில் ஒன்றை உள்ளிடுவோம் (அதையே செய்யுங்கள், இரண்டாவது புரிந்துகொள்ள எளிதானது):

source: The first argument to the ``FILTER()`` function (in this example dose) is what values to use in the computed column. The second argument is the condition; when this condition isn’t satisfied, the value comes across blank (or as a “missing value” if you prefer). So with this formula, the ``dose (2)`` column contains all the ``500`` and ``1000`` values, but the ``2000`` values are not there.
de: Das erste Argument der Funktion ``FILTER()`` (in diesem Beispiel Dosis) gibt an, welche Werte in der berechneten Spalte verwendet werden sollen. Das zweite Argument ist die Bedingung; wenn diese Bedingung nicht erfüllt ist, wird der Wert leer angezeigt (oder als „fehlender Wert“, wenn Sie das vorziehen). Mit dieser Formel enthält die Spalte ``dose (2)`` alle Werte von ``500`` und ``1000``, während die Werte für ``2000`` ausgeschlossen wurden.
ja: ``FILTER()`` 関数の最初の引数（この例ではdose）は、計算列で使用する値を指定します。2番目の引数は条件であり、この条件が満たされない場合、その値は空白（または「欠損値」）として扱われます。この数式を使うと、 ``dose (2)`` 列には ``500`` と ``1000`` の値だけが入り、 ``2000`` の値は含まれません。
nb: Det første argumentet til funksjonen ``FILTER()`` (i dette eksempelet dose) er hvilke verdier som skal brukes i den beregnede kolonnen. Det andre argumentet er betingelsen; når denne betingelsen ikke er oppfylt, blir verdien blank (eller som en «manglende verdi», hvis du foretrekker det). Med denne formelen inneholder kolonnen ``dose (2)`` alle verdiene i ``500`` og ``1000``, mens verdiene i ``2000`` ikke er der.
ta: `` வடிகட்டி () `` செயல்பாட்டின் (இந்த எடுத்துக்காட்டு டோசில்) முதல் உரையாடல் கணக்கிடப்பட்ட நெடுவரிசையில் என்ன மதிப்புகளைப் பயன்படுத்த வேண்டும் என்பதுதான். இரண்டாவது உரையாடல் நிலை; இந்த நிலை நிறைவு அடையாதபோது, மதிப்பு காலியாக வருகிறது (அல்லது நீங்கள் விரும்பினால் “காணாமல் போன மதிப்பாக”). எனவே இந்த சூத்திரத்துடன், `` டோச் (2) `` நெடுவரிசையில் அனைத்து `` 500`` மற்றும் `1000`` மதிப்புகள் உள்ளன, ஆனால்` `2000`` மதிப்புகள் இல்லை.

source: We might also change the name of the column to something more descriptive, like ``dose 5,10``. Similarly we can create a column ``dose 10,20`` with the formula ``FILTER(dose, dose != 500)``. Now we can run two separate ANOVAs (or t-tests) using ``len`` as the dependent variable, and ``dose 5,10`` as one grouping variable in the first analysis, and ``dose 10,20`` in the other. In this way we can use different filters for different analyses. Contrast this with row filters which are applied to *all* the analyses.
de: Wir könnten auch den Namen der Spalte in etwas Beschreibenderes ändern, wie ``dose 5,10``. Auf ähnliche Weise können wir eine Spalte ``dose 10,20`` mit der Formel ``FILTER(dose, dose != 500)`` erstellen. Jetzt können wir zwei getrennte ANOVAs (oder t-Tests) durchführen, wobei ``len`` als abhängige Variable und ``dose 5,10`` als eine gruppierende Variable in der ersten Analyse und ``dose 10,20`` in der anderen verwendet werden. Auf diese Weise können wir verschiedene Filter für verschiedene Analysen verwenden. Dies ist ein Unterschied zu Zeilenfiltern, die auf *alle* Analysen angewendet werden.
ja: 列の名前は、より分かりやすいもの、たとえば ``dose 5,10`` などに変更することもできます。同様に、 ``FILTER(dose, dose != 500)`` という数式を使って ``dose 10,20`` という列も作成できます。これで、 ``len`` を従属変数、 ``dose 5,10`` をグループ変数として最初の分析を行い、もう一方では ``dose 10,20`` をグループ変数として、2つの別々のANOVA（またはt検定）を実行できます。このようにして、異なる分析ごとに異なるフィルターを使うことができます。これに対して、行フィルタは *すべて* の分析に適用される点が異なります。
nb: Vi kan også endre navnet på kolonnen til noe mer beskrivende, for eksempel ``dose 5,10``. På samme måte kan vi opprette en kolonne ``dose 10,20`` med formelen ``FILTER(dose, dose != 500)``. Nå kan vi kjøre to separate ANOVAer (eller t-tester) med ``len`` som avhengig variabel, og ``dose 5,10`` som den ene grupperingsvariabelen i den første analysen, og ``dose 10,20`` i den andre. På denne måten kan vi bruke forskjellige filtre til forskjellige analyser. I motsetning til radfiltre som brukes på *alle* analysene.
ta: `` டோச் 5,10`` போன்ற விசயங்களாக நெடுவரிசையின் பெயரை மாற்றலாம். இதேபோல் `` வடிகட்டி (டோச், டோச்! = 500) `` சூத்திரத்துடன் `` டோச் 10,20`` ஒரு நெடுவரிசையை உருவாக்கலாம். இப்போது நாம் இரண்டு தனித்தனி அனோவாக்களை (அல்லது டி-சோதனைகள்) `` லென்`` சார்பு மாறியாகவும், முதல் பகுப்பாய்வில் ஒரு குழு மாறியாகவும் `` டோச் 5,10`` ஐப் பயன்படுத்தி இயக்கலாம், மற்றும் `` டோச் 10,20` `மற்றொன்றில். இந்த வழியில் வெவ்வேறு பகுப்பாய்வுகளுக்கு வெவ்வேறு வடிப்பான்களைப் பயன்படுத்தலாம். * அனைத்து * பகுப்பாய்வுகளுக்கும் பயன்படுத்தப்படும் வரிசை வடிப்பான்களுடன் இதை வேறுபடுத்துங்கள்.

source: It may also have occurred to you, that with ``FILTER()`` we can do what might be called a “poor man’s split variables”: You can create splits using ``FILTER()``. For example, we could split ``len`` into two new columns ``len_VC`` and ``len_OJ`` with the functions ``FILTER(len, supp == 'VC')`` and ``FILTER(len, supp == 'OJ')`` respectively. This results in two separate columns which can be analysed side-by-side.
de: Mit ``FILTER()`` lassen sich daher Analysen aufteilen: Sie können mit ``FILTER()`` die dafür notwendigen Variablen erstellen. Zum Beispiel könnten wir ``len`` mit den Funktionen ``FILTER(len, supp == 'VC')`` bzw. ``FILTER(len, supp == 'OJ')`` in zwei neue Spalten ``len_VC`` und ``len_OJ`` aufteilen. Dadurch entstehen zwei getrennte Spalten, die wir getrennt voneinander analysieren können.
ja: ``FILTER()`` を使えば、いわゆる「簡易的な分割変数」のようなこともできるのでは、と思った人もいるでしょう。 実際、``FILTER()`` を使った変数分割は可能です。例えば、 ``len`` を2つの新しい列 ``len_VC`` と ``len_OJ`` に分割するには、それぞれ ``FILTER(len, supp == 'VC')`` と ``FILTER(len, supp == 'OJ')`` という関数を使います。こうすることで、2つの別々の列ができ、並べて分析できます。
nb: Du har kanskje også tenkt på at vi med ``FILTER()`` kan dele opp analysene: Du kan lage for eksempel to grupper ved å bruke ``FILTER()``, og vi kan splitte ``len`` i to nye kolonner ``len_VC`` og ``len_OJ`` med henholdsvis funksjonene ``FILTER(len, supp == 'VC')`` og ``FILTER(len, supp == 'OJ')``. Dette resulterer i to separate kolonner som kan analyseres side om side.
ta: `` வடிகட்டி () `` மூலம் “ஏழை மனிதனின் பிளவு மாறிகள்” என்று அழைக்கப்படுவதை நாங்கள் செய்ய முடியும் என்பதும் உங்களுக்கு ஏற்பட்டிருக்கலாம்: `` வடிகட்டி () `` ஐப் பயன்படுத்தி பிளவுகளை உருவாக்கலாம். எடுத்துக்காட்டாக, `` len`` `` len_vc`` மற்றும் `` len_oj`` ஆகிய இரண்டு புதிய நெடுவரிசைகளாகப் பிரிக்கலாம் `` வடிகட்டி (லென், சப் == 'வி.சி') `` மற்றும் `` வடிகட்டி , supp == 'oj') `` முறையே. இது இரண்டு தனித்தனி நெடுவரிசைகளில் விளைகிறது, அவை பக்கவாட்டாக பகுப்பாய்வு செய்யப்படலாம்.

source: Pre-registration is a solution to `p-hacking <https://en.wikipedia.org/wiki/Data_dredging>`_, not deliberately making software difficult to use! Don’t p-hacking. Your p-hacking harms more people than you may assume.
de: Das Präregistrieren ist eine Lösung für `p-hacking <https://en.wikipedia.org/wiki/Data_dredging>`_, und nicht um die Nutzung von Software schwieriger zu machen! p-hacking ist gefährlicher, als Sie vielleicht annehmen, und sollte daher unterbleiben.
ja: 事前登録（プレレジ）は `pハッキング <https://en.wikipedia.org/wiki/Data_dredging>`_ への解決策であり、ソフトウェアをわざと使いにくくするためのものはありません！ pハッキングはやめましょう。pハッキングは、あなたが思っている以上に多くの人に害を及ぼします。
nb: Forhåndsregistrering er en løsning på `p-hacking <https://en.wikipedia.org/wiki/Data_dredging>`_. Hensyn er ikke å bevisst gjøre programvare vanskelig å bruke! Ikke p-hacking. Din p-hacking skader flere mennesker enn du kanskje antar.
ta: முன் பதிவு என்பது `பி-ஏக்கிங் <https://en.wikipedia.org/wiki/data_dredging>`__, வேண்டுமென்றே மென்பொருளைப் பயன்படுத்த கடினமாக்காததற்கு ஒரு தீர்வாகும்! பி-ஏக்கிங் செய்ய வேண்டாம். உங்கள் பி-ஏக்கிங் உங்களை விட அதிகமானவர்களுக்கு தீங்கு விளைவிக்கும்.

source: Updating data
de: Daten aktualisieren
ja: データの更新
nb: Aktualiser dataene
ta: தரவைப் புதுப்பித்தல்
