Repository: sjentsch/jamoviDocs-i18n
Catalog: */LC_MESSAGES/usermanual.po
Languages: de, ja, nb, ta

source: There are many reasons you might want to do this; there are a lot of analyses available in R packages that haven’t (yet) been made available as jamovi modules, and ``Rj`` allows you to make use of these analyses from within jamovi. Additionally, you can make use of loops and if-statements, allowing (among other things) conditional analyses and simulation studies.
de: Es gibt eine Reihe von Situationen, in denen Sie dies tun möchten. Zum Beispiel gibt es gibt einige Analysen in R-Paketen, die (noch) nicht als jamovi-Module verfügbar sind. Der ``Rj``-Editor ermöglicht es Ihnen, diese Analysen innerhalb von jamovi zu nutzen. Außerdem können Sie Schleifen und if-Anweisungen verwenden, was (unter anderem) bedingte Analysen und Simulationsstudien ermöglicht.
ja: これを行いたい理由はさまざまです。Rパッケージには、まだjamoviのモジュールとして提供されていない多くの分析手法があり、 ``Rj`` を使うことで、そうした分析をjamovi内から利用できるようになるというのはその1つです。さらに、ループやif文なども利用できるため、条件付きの分析やシミュレーション研究など、より柔軟な処理が可能になります。
nb: Det er mange grunner for å bruke ``R``-kode: Det finnes mange analyser tilgjengelig i R-pakker som (ennå) ikke er gjort tilgjengelige som jamovi-moduler, og ``Rj`` lar deg bruke disse analysene fra jamovi. I tillegg kan du bruke sløyfer og if-setninger, noe som blant annet muliggjør gjentatte analyser, betingede analyser og simuleringsstudier.
ta: இதை நீங்கள் செய்ய விரும்புவதற்கான பல காரணங்கள் உள்ளன; ஆர் தொகுப்புகளில் (இன்னும்) சாமோவி தொகுதிகளாக கிடைக்காத (இன்னும்) நிறைய பகுப்பாய்வுகள் கிடைக்கின்றன, மேலும் இந்த பகுப்பாய்வுகளை சாமோவிக்குள்ளேயே பயன்படுத்த `` rj`` உங்களை அனுமதிக்கிறது. கூடுதலாக, நீங்கள் சுழல்கள் மற்றும் IF- புள்ளிவிவரங்களைப் பயன்படுத்தலாம், (மற்றவற்றுடன்) நிபந்தனை பகுப்பாய்வு மற்றும் உருவகப்படுத்துதல் ஆய்வுகளை அனுமதிக்கிறது.

source: For some, using R in a spreadsheet will be an ideal place to begin learning ``R``. For others, it can be an easy way to share R analyses with less technically savvy colleagues (and some people just prefer to code).
de: Für einige ist die Verwendung von R in jamovi ein idealer Einstieg in das Lernen von ``R``. Für andere kann es eine einfache Möglichkeit sein, R-Analysen mit weniger technisch versierten Kollegen zu teilen (und einige Menschen bevorzugen es, die Kommandozeile zu verwenden).
ja: 人によっては、スプレッドシート上でRを使うことが、 ``R`` の学習を始める最適な方法となるでしょう。また、技術的なことにあまり詳しくない同僚（中には単純にコーディングが好きな人もいるでしょうが）と簡単に共有する手段にもなります。
nb: For noen vil bruk av ``R`` i et regneark være et ideelt sted å begynne å lære ``R``. For andre kan det være en enkel måte å dele ``R``-analyser med kolleger som ikke har avansert teknisk kunnskap (og noen foretrekker rett og slett å bruke kode).
ta: சிலருக்கு, ஒரு விரிதாளில் R ஐப் பயன்படுத்துவது `` r`` கற்கத் தொடங்க சிறந்த இடமாக இருக்கும். மற்றவர்களுக்கு, குறைந்த தொழில்நுட்ப ஆர்வமுள்ள சகாக்களுடன் ஆர் பகுப்பாய்வுகளைப் பகிர்ந்து கொள்வது எளிதான வழியாகும் (மேலும் சிலர் குறியீட்டை விரும்புகிறார்கள்).

source: To run an R analysis, select ``Rj Editor`` from the ``R``-icon in the ``Analyses`` ribbon. This will bring up the editor for entering your ``R`` code. The data set you have opened in jamovi is available to you as a data frame, simply as ``data``. To get started, you might like to run ``descriptives`` on it.
de: Um eine R-Analyse durchzuführen, wählen Sie ``Rj Editor`` aus dem ``R``-Symbol in der Registerkarte ``Analyses``. Dadurch wird der Editor aufgerufen, in dem Sie ``R``-Code verwenden können. Der Datensatz, den Sie in jamovi geöffnet haben, ist unter dem Namen ``data`` als *data frame* zugänglich. Um loszulegen, könnten Sie z.B. die R-Funktion ``descriptives`` ausführen.
ja: Rによる分析を実行するには、 ``分析`` （Analyses）リボンの ``R`` アイコンから ``Rj Editor`` を選択します。これにより、Rコードを入力するためのエディタが表示されます。jamoviで開いているデータセットは、単に ``data`` という名前のデータフレームとして利用できます。まずは、 ``記述統計`` （descriptives）を実行してみるとよいでしょう。
nb: For å kjøre en R-analyse velger du ``Rj Editor`` fra ``R``-ikonet i båndet ``Analyser``. Da får du opp redigeringsprogrammet der du kan skrive inn ``R``-koden. Datasettet du har åpnet i jamovi, er tilgjengelig for deg som en ``data.frame`` som ``data``. For å komme i gang kan du kjøre ``descriptives`` på det.
ta: ஆர் பகுப்பாய்வை இயக்க, `` அனலீச்ச்` `ரிப்பனில்` `ஆர்``-ஐகானிலிருந்து` `ஆர்.சே. எடிட்டர்` என்பதைத் தேர்ந்தெடுக்கவும். இது உங்கள் `` r`` குறியீட்டை உள்ளிடுவதற்கு எடிட்டரை கொண்டு வரும். சாமோவியில் நீங்கள் திறந்த தரவு தொகுப்பு ஒரு தரவு சட்டமாக உங்களுக்கு கிடைக்கிறது, வெறுமனே `` தரவு``. தொடங்குவதற்கு, நீங்கள் `` விளக்கங்கள்`` ஐ இயக்க விரும்பலாம்.

source: Or if you prefer the ``dplyr`` approach, you could go:
de: Oder wenn Sie den ``tidyverse``-Ansatz bevorzugen, könnten Sie eingeben:
ja: もし、 ``dplyr`` 流のやり方が好きなら、次のように書くこともできます。
nb: Eller hvis du foretrekker ``dplyr``-tilnærming, kan du skrive:
ta: அல்லது நீங்கள் `` dplyr`` அணுகுமுறையை விரும்பினால், நீங்கள் செல்லலாம்:

source: You’ll notice as you’re entering this code, ``Rj`` auto-suggests function names. To run the code, click on the green triangle or press Control + Shift + Enter (or ⌘ + Shift + Enter if you’re on a Mac). jamovi will run the ``R`` code and the results will appear in the results panel like other analyses. You can continue to make changes to the code, and then run it again.
de: Während Sie ``R``-Code eingeben, werden Sie feststellen, dass ``Rj`` automatisch Funktionsnamen zum Vervollständigen vorschlägt. Um den Code auszuführen, klicken Sie auf das grüne Dreieck oder drücken Sie Strg + Umschalt + Enter (oder ⌘ + Umschalt + Enter, wenn Sie einen Mac benutzen). jamovi führt den ``R``-Code aus und die Ergebnisse erscheinen in der Ergebnisausgabe wie andere Analysen. Sie können weiterhin Änderungen am Code vornehmen und ihn dann erneut ausführen.
ja: コードを入力しているとき、 `Rj` が自動的に関数名を提案してくれることに気づくでしょう。コードを実行するには、緑色の三角ボタンをクリックするか、Control + Shift + Enter（Macの場合は ⌘ + Shift + Enter）を押します。すると、jamoviは ``R`` のコードを実行し、その結果が他の分析と同じように結果パネルに表示されます。コードに変更を加えて、再度実行することも可能です。
nb: Du vil legge merke til at ``Rj`` automatisk foreslår funksjonsnavn når du skriver inn denne koden. For å kjøre koden klikker du på den grønne trekanten eller trykker Control + Shift + Enter (eller ⌘ + Shift + Enter hvis du bruker Mac). jamovi kjører da ``R``-koden, og resultatene vises i resultatpanelet på samme måte som andre analyser. Du kan fortsette å gjøre endringer i koden, og deretter kjøre den på nytt.
ta: இந்த குறியீட்டை உள்ளிடும்போது நீங்கள் கவனிப்பீர்கள், `` rj`` ஆட்டோ-ச்கக்ச்டுகள் செயல்பாட்டு பெயர்கள். குறியீட்டை இயக்க, பச்சை முக்கோணத்தில் சொடுக்கு செய்க அல்லது கட்டுப்பாடு + சிப்ட் + ENTER ஐ அழுத்தவும் (அல்லது ⌘ + உயர்த்து + நீங்கள் MAC இல் இருந்தால் ENTER). சாமோவி `` ஆர்`` குறியீட்டை இயக்கும், மேலும் முடிவுகள் மற்ற பகுப்பாய்வுகளைப் போல முடிவுகள் குழுவில் தோன்றும். நீங்கள் தொடர்ந்து குறியீட்டில் மாற்றங்களைச் செய்யலாம், பின்னர் அதை மீண்டும் இயக்கவும்.

source: By default, ``Rj`` makes use of the version of ``R`` bundled with jamovi. This includes many packages (|jmv|_ and all it’s dependencies), and will be sufficient for many people, but if you need to make use of additional R packages then you’ll need to make use of the ``System R`` version. If you select ⚙ (at the top right of the code box), you’ll see an option to change the ``R version`` used. The ``System R`` version uses the version of ``R`` you have installed on your system. This has the advantage that your ``R`` code now has access to all of the packages you have installed for that version of ``R``. The last thing you will need is to have the |jmvconnect|_ R package installed in the R library on your system.
ja: 初期設定では、 ``Rj`` はjamoviに同梱されている ``R`` のバージョンを利用します。このバージョンには多くのパッケージ（|jmv|_およびその依存パッケージ）が含まれており、多くのユーザーにとってはこれで十分でしょう。追加のRパッケージを使いたい場合は ``System R`` バージョンを利用してください。コードボックス右上の歯車アイコン（⚙）を選択すると、使用する ``R`` のバージョンを変更するオプションが表示されます。 ``System R`` では、システムにインストールされている ``R`` のバージョンを利用します。これにより、その ``R`` バージョンにインストールされているすべてのパッケージにアクセスできるという利点があります。必要なのは 、 |jmvconnect|_ RパッケージをシステムのRライブラリにインストールしておくことだけです。
ta: இயல்பாக, ``Rj`` சாமோவியுடன் தொகுக்கப்பட்ட ``R`` பதிப்பைப் பயன்படுத்துகிறது. இதில் பல தொகுப்புகள் உள்ளன (|jmv| மற்றும் அனைத்தும் சார்புநிலைகள்), மற்றும் நீங்கள் தேவைப்பட்டால் தேவைப்பட்டால் கூடுதல் ``ஆர்`` தொகுப்புகளைப் பயன்படுத்துங்கள், பின்னர் நீங்கள் `` சிச்டம் ஆர்`` பதிப்பைப் பயன்படுத்த வேண்டும். நீங்கள் ⚙ (குறியீடு பெட்டியின் மேல் வலதுபுறத்தில்) தேர்ந்தெடுத்தால், பயன்படுத்தப்பட்ட `` r பதிப்பு`` மாற்றுவதற்கான விருப்பத்தைக் காண்பீர்கள். `` சிச்டம் ஆர்`` பதிப்பு உங்கள் கணினியில் நிறுவிய `` ஆர்`` பதிப்பைப் பயன்படுத்துகிறது. ``R`` குறியீட்டில் `` r`` இன் பதிப்பிற்கு நீங்கள் நிறுவிய அனைத்து தொகுப்புகளுக்கும் அணுகல் உள்ளது என்ற நன்மை இது. உங்களுக்கு கடைசியாக தேவைப்படுவது | JMVConnect | உங்கள் கணினியில் ஆர் நூலகத்தில் ஆர் தொகுப்பு நிறுவப்பட்டுள்ளது. இந்த தொகுப்பு உங்கள் கணினியில் ``R`` பதிப்பை சாமோவி தரவு தொகுப்புகளை அணுக அனுமதிக்கிறது. நீங்கள் அதை ``R`` உடன் நிறுவலாம்:

source: ``jmvconnect`` R package
ja: ``jmvconnect`` Rパッケージ

source: The |jmvconnect|_ R package allows the ``R`` version on your system to access the data sets that you opened in jamovi. You can install it in ``R`` with:
ja: |jmvconnect|_ Rパッケージは、システム上の ``R`` からjamoviで開いているデータセットにアクセスできるようにします。 ``R`` で次のようにしてインストールしてください。

source: Once this is done, moving from the ``jamovi R`` to the ``System R`` should be seamless.
de: Sobald dies geschehen ist, sollte ein Wechsel von ``jamovi R`` zu ``System R`` problemlos möglich sein.
ja: これが完了すれば、 ``jamovi R`` から ``System R`` にスムーズに移行できるはずです。
nb: Når dette er gjort, skal det være problemfritt å gå fra ``jamovi R`` til ``System R``.
ta: இது முடிந்ததும், `` சமோவி ஆர்`` இலிருந்து `` சிச்டம் ஆர்`` க்கு நகர்த்துவது தடையற்றதாக இருக்க வேண்டும்.

source: It’s worth remembering that sharing jamovi files with colleagues becomes a bit more complicated when you make use of the ``System R`` version. If they want to make changes and re-run your analyses, they will need to have the same R packages installed – that’s the price of flexibility!
de: Etwas, an das Sie denken müssen, ist, dass eine gemeinsame Nutzung von jamovi-Dateien mit Kollegen komplizierter wird, wenn Sie ``System R`` verwenden. Wenn diese Kollegen Änderungen vornehmen und Ihre Analysen aktualisieren wollen, müssen sie dieselben R-Pakete installiert haben - das ist der Preis der Flexibilität!
ja: ``System R`` を利用する場合、jamoviファイルを同僚と共有する際には少し複雑になることに留意してください。同僚があなたの分析を修正したり再実行したりしたい場合、同じRパッケージがインストールされている必要があります。これは柔軟性の代償です！
nb: Det er verdt å huske at det blir litt mer komplisert å dele jamovi-filer med kolleger når du bruker ``System R``-versjonen. Hvis de ønsker å gjøre endringer og kjøre analysene dine på nytt, må de ha de samme ``R``-pakkene installert som ble brukt i disse analysene - det er prisen for fleksibilitet!
ta: நீங்கள் `` சிச்டம் ஆர்`` பதிப்பைப் பயன்படுத்தும்போது சாமோவி கோப்புகளை தம ஊழியர்களுடன் பகிர்வது சற்று சிக்கலானதாகிவிடும் என்பதை நினைவில் கொள்வது மதிப்பு. அவர்கள் மாற்றங்களைச் செய்ய விரும்பினால், உங்கள் பகுப்பாய்வுகளை மீண்டும் இயக்க விரும்பினால், அவர்கள் அதே ஆர் தொகுப்புகளை நிறுவ வேண்டும்-இது நெகிழ்வுத்தன்மையின் விலை!

source: When ``Rj`` runs ``R`` code, by default it makes the whole data set available as a data frame called ``data``. However, it’s likely that your analysis only makes use of a few columns, and doesn’t need the whole data set. You can limit the columns made available to the analysis by including a special comment at the top of your script, of the form:
de: Wenn ``R``-Code im ``Rj``-Editor ausführt wird, steht standardmäßig der gesamten Datensatz als *data frame* mit dem Namen ``data`` zur Verfügung. Es ist jedoch wahrscheinlich, dass Ihre Analyse nur einige wenige Spalten verwendet und nicht den gesamten Datensatz benötigt. Sie können die Spalten, die der Analyse zur Verfügung gestellt werden, einschränken, indem Sie einen speziellen Kommentar am Anfang Ihres Skripts einfügen. Dieser hat die Form:
ja: 初期設定では、 ``Rj`` が ``R`` コードを実行する際、データセット全体を ``data`` という名前のデータフレームとして利用します。しかし、実際の分析では、必要な列はごく一部であり、全データセットを使う必要がない場合も多いでしょう。スクリプトの先頭に特別なコメントを追加することで、分析で利用可能な列を制限することもできます。そのコメントの形式は次の通りです。
nb: Når ``Rj`` kjører ``R`` kode, gjør den som standard hele datasettet tilgjengelig som en dataramme kalt ``data``. Det er imidlertid sannsynlig at analysen din bare bruker noen få kolonner, og ikke trenger hele datasettet. Du kan begrense kolonnene som gjøres tilgjengelige for analysen, ved å inkludere en spesiell kommentar øverst i skriptet på følgende måte:
ta: `` Rj`` `` r`` குறியீட்டை இயக்கும்போது, இயல்பாகவே இது முழு தரவு தொகுப்பையும் `` தரவு`` எனப்படும் தரவு சட்டகமாக கிடைக்கச் செய்கிறது. இருப்பினும், உங்கள் பகுப்பாய்வு சில நெடுவரிசைகளைப் பயன்படுத்துகிறது, மேலும் முழு தரவு தொகுப்பு தேவையில்லை. உங்கள் ச்கிரிப்ட்டின் மேற்புறத்தில், படிவத்தின் சிறப்பு கருத்தை சேர்ப்பதன் மூலம் பகுப்பாய்விற்கு கிடைக்கக்கூடிய நெடுவரிசைகளை நீங்கள் கட்டுப்படுத்தலாம்:

source: In this instance, only the named columns will appear in the data data frame. This can speed the analysis up, particularly if you are working with large data sets. Additionally, this lets jamovi know that the analysis is only using these columns, and the analysis will not need to be re-run if changes are made to other columns.
de: In diesem Fall werden nur die benannten Spalten des Datensatzes angezeigt. Dies kann die Analyse beschleunigen, insbesondere wenn Sie mit großen Datensätzen arbeiten. Außerdem weiß jamovi dadurch, dass die Analyse nur diese Spalten verwendet, und die Analyse muss nicht erneut durchgeführt werden, wenn Änderungen an anderen Spalten vorgenommen werden.
ja: この場合、指定した列だけが data データフレームに表示されます。とくに大規模なデータセットを扱う場合、これによって分析の処理速度が向上します。さらに、jamoviは分析でこれらの列だけが使われていると認識するため、他の列に変更が加えられても分析を再実行する必要がなくなります。
nb: I dette tilfellet vil bare de navngitte kolonnene vises i datarammen. Dette kan gjøre analysen raskere, særlig hvis du jobber med store datasett. I tillegg får jamovi beskjed om at analysen bare bruker disse kolonnene, og analysen trenger ikke å kjøres på nytt hvis det gjøres endringer i andre kolonner.
ta: இந்த நிகழ்வில், பெயரிடப்பட்ட நெடுவரிசைகள் மட்டுமே தரவு தரவு சட்டத்தில் தோன்றும். இது பகுப்பாய்வை விரைவுபடுத்தும், குறிப்பாக நீங்கள் பெரிய தரவுத் தொகுப்புகளுடன் பணிபுரிகிறீர்கள் என்றால். கூடுதலாக, இது பகுப்பாய்வு இந்த நெடுவரிசைகளை மட்டுமே பயன்படுத்துகிறது என்பதை சாமோவிக்கு தெரியப்படுத்துகிறது, மேலும் பிற நெடுவரிசைகளில் மாற்றங்கள் செய்யப்பட்டால் பகுப்பாய்வு மீண்டும் இயக்க தேவையில்லை.

source: There may be times where you’ll want to transition to an R session for analysing a data set. This is where the |jmvconnect|_ R package comes in handy. |jmvconnect|_ lets you read the data sets from a running jamovi instance into an R session. It has two functions: ``what()`` lists the available data sets, and ``read()`` reads them. For example, you might use:
ja: データセットの分析をRセッションに移行したいと思うことがあるかもしれません。こうした場合に便利なのが |jmvconnect|_ Rパッケージです。|jmvconnect|_ を使うと、実行中のjamoviからRセッションにデータセットを読み込むことができます。このパッケージには2つの関数があり、 ``what()`` は利用可能なデータセットを一覧表示し、 ``read()`` はそれらを読み込みます。たとえば、次のように使うことができます。
ta: தரவு தொகுப்பை பகுப்பாய்வு செய்வதற்கான ஆர் அமர்வுக்கு நீங்கள் மாற்ற விரும்பும் நேரங்கள் இருக்கலாம். இங்குதான் | jmvconnect | ஆர் தொகுப்பு கைக்கு வருகிறது. | jmvconnect | இயங்கும் சாமோவி நிகழ்விலிருந்து தரவுத் தொகுப்புகளை ஆர் அமர்வில் படிப்போம். இது இரண்டு செயல்பாடுகளைக் கொண்டுள்ளது: `` என்ன () `` கிடைக்கக்கூடிய தரவுத் தொகுப்புகளை பட்டியலிடுகிறது, மேலும் `` படிக்க () `` அவற்றைப் படிக்கிறது. எடுத்துக்காட்டாக, நீங்கள் பயன்படுத்தலாம்:

source: and then read the data set with either of these two commands:
de: verwenden und danach mit einem der folgenden beiden Befehle den Datensatz einlesen:
ja: そして、次のいずれかのコマンドでデータセットを読み込むことができます。
nb: og deretter lese datasettet med en av disse to kommandoene:
ta: இந்த இரண்டு கட்டளைகளில் ஒன்றைக் கொண்டு தரவுத் தொகுப்பைப் படியுங்கள்:

source: ``jmvReadWrite`` R package
ja: ``jmvReadWrite`` Rパッケージ

source: The |jmvReadWrite|_ R package reads and writes jamovi-data-files (.omv) in ``R``. It can be installed with:
ja: |jmvReadWrite|_ Rパッケージは、 ``R`` でjamoviデータファイル（.omv）の読み書きを行います。これは、次のようにしてインストールします。

source: A typical use case would be if you wanted to process a large number of result files (e.g., CSV-files from several participants in an experiment or with responses from different questionnaires). Wrangling data is often easiest achieved in R. Once you have assembled your dataset from these files, you can write it using the ``write_omv()``-function.
ja: 典型的な使い方としては、たとえば実験の複数の参加者から得られたCSVファイルや、異なる質問票からの回答データなど、多数の結果ファイルを処理したい場合が挙げられます。データの整形やクリーニングといったラングリング（wrangling）は、Rで行ったほうが簡単な場合もよくあります。それらのファイルからデータセットをまとめたら、 ``write_omv()`` 関数を使って書き出すことができます。

source: Likewise does the ``read_omv``-function permit you to read jamovi-data-files into ``R``. Another typical use case would be reading a data file, doing manipulations that currently are not possible in jamovi, and then writing back the resulting modified file (in the jamovi file format).
ja: 同様に、 ``read_omv`` 関数を使うことで、jamoviデータファイルをRに読み込むことができます。もう一つの典型的な使い方としては、データファイルを読み込み、現在jamoviではできない操作をRで行い、その結果を修正したファイルとして（jamoviファイル形式で）書き戻す、というものがあります。

source: There is a couple of helper functions implemented in |jmvReadWrite|_. They enable operations such as re-arranging the columns / variables of a data set (``arrange_cols_omv``), mass-converting a data files into the jamovi file format (``convert_to_omv``; e.g. from a statistics software that you used earlier), converting data files from long to wide format (``long2wide_omv``) and from wide to long format (``wide2long_omv``), adding variables from several data sets (``merge_cols_omv``), adding cases from several data sets (``merge_rows_omv``), or sort a data set after one or more variables (``sort_omv``).
ja: |jmvReadWrite|_ にはいくつかの補助関数が実装されています。これらを使うことで、データセットの列や変数の並び替え（ ``arrange_cols_omv`` ）、複数のデータファイル（たとえば以前使っていた統計ソフトのデータ）を一括してjamoviファイル形式に変換する（ ``convert_to_omv`` ）、データファイルのロング形式からワイド形式への変換（ ``long2wide_omv`` ）、ワイド形式からロング形式への変換（ ``wide2long_omv`` ）、複数のデータセットの変数を結合する（ ``merge_cols_omv`` ）、複数のデータセットでケースを結合する（ ``merge_rows_omv`` ）、1つまたは複数の変数でデータセットを並べ替える（ ``sort_omv`` ）といった操作が可能です。

source: Another possible use case for ``read_omv`` is the creation of R markdown files using the results of your jamovi analyses. The ``getSyn``-parameter determines whether the syntax of the analyses contained in the file is extracted. For running the syntax, the |jmv|_ R package needs to be installed. If you would like to work with the results afterwards, it is recommended that you assign them to a variable (see the second ``eval`` below). Tables from the results can be converted into a data frame with the function ``asDF`` (e.g., ``result$main$asDF``).
ja: ``read_omv`` のもう一つの利用例として、jamoviでの分析結果を使ってR Markdownファイルを作成することが挙げられます。``getSyn`` パラメータは、ファイル内に含まれる分析のシンタックス（構文）を抽出するかどうかを指定します。シンタックスを実行するには、|jmv|_ Rパッケージがインストールされている必要があります。あとで結果を扱いたい場合は、それらを変数に代入しておくことをおすすめします（下記の2つ目の ``eval`` を参照）。結果の表は、``asDF`` 関数を使って（たとえば ``result$main$asDF`` のように使うことで）データフレームに変換できます。

source: Windows
ta: சாளரங்கள்

source: macOS
ta: மேகோச்

source: ``log`` → ``Q1 - log`` ``..._log`` → ``Q1_log`` ``log(...)`` → ``log(Q1)``
ta: `` log`` `` Q1 - உள்நுழைவு` `` `..._ உள்நுழைவு`` `` Q1_log`` `` பதிவு (...) `` `` பதிவு (Q1) `` `

source: In syntax mode, analyses continue to operate as before, but now they produce R syntax. Like all results objects in jamovi, you can right click on these items (including the R syntax) and copy and paste them, for example, into an R session. All the analyses that are included with jamovi are available within an R session through the :doc:`jmv R package <../jmv/jmv_overview>`.
de: Die Analysen funktionieren im Syntaxmodus weiter wie gewohnt, aber sie erzeugen jetzt R-Syntax (als oberste Ausgabe innerhalb jeder Analyse). Wie gewohnt können Sie mit der rechten Maustaste auf alle Ergebnisobjekte in jamovi (einschließlich der R-Syntax) klicken, Sie mit dem entsprechenden Menü-Eintrag kopieren und sie danach z. B. in eine R-Sitzung (oder einen Text-Editor) einfügen. Alle Analysen, die in jamovi enthalten sind, sind in einer R-Sitzung innerhalb des R-Pakets :doc:`jmv <../jmv/jmv_overview>` verfügbar.
nb: I syntaksmodus fortsetter analyser å fungere som før, men nå produserer de R-syntaks. Som alle resultatobjekter i jamovi, kan du høyreklikke på disse elementene (inkludert R-syntaksen) og kopiere og lime dem inn, for eksempel i en R-sesjon. Alle analysene som er inkludert i jamovi er tilgjengelige i en R-sesjon gjennom R-pakken :doc:`jmv <../jmv/jmv_overview>`.
ta: தொடரியல் பயன்முறையில், பகுப்பாய்வுகள் முன்பு போலவே தொடர்ந்து இயங்குகின்றன, ஆனால் இப்போது அவை R தொடரியல் உருவாக்குகின்றன. சமோவியில் உள்ள அனைத்து முடிவுப் பொருள்களையும் போலவே, நீங்கள் இந்த உருப்படிகளை (ஆர் தொடரியல் உட்பட) வலது சொடுக்கு செய்து அவற்றை ஒரு ஆர் அமர்வில் நகலெடுத்து ஒட்டலாம். சாமோவியுடன் சேர்க்கப்பட்டுள்ள அனைத்து பகுப்பாய்வுகளும் ஒரு ஆர் அமர்வுக்குள் கிடைக்கின்றன :doc:`jmv R தொகுப்பு <../ jmv/jmv_overview>`.

source: You can head to the entries under “Analyses” in the menu on the right-hand side for a series of short, non-technical tutorials on how to conduct common statistical procedures in jamovi. The :doc:`introduction <../analyses/jg_00_overview>` gives an overview over the available analyses, or you can otherwise directly access specific analyses by selecting them from the menu on the right-hand side.
nb: Under "Analyser" i menyen til høyre finner du en rekke korte, enkle og ikke-tekniske veiledninger i hvordan du utfører vanlige statistiske prosedyrer i jamovi. På :doc:`introduction <../analyses/jg_00_overview>` får du en oversikt over tilgjengelige analyser, eller du kan gå direkte til spesifikke analyser ved å velge dem i menyen til høyre.

source: jamovi also provides an “R Syntax Mode”, in this mode, jamovi produces equivalent R code for each analysis. To change to syntax mode, select the application menu (⋮) at the top right of jamovi, and check the ``Syntax mode`` checkbox there. It is possible to leave syntax mode by clicking this a second time.
nb: jamovi tilbyr også en «R Syntax Mode». I denne modusen produserer jamovi R-kode for hver analyse. For å bytte til syntaksmodus, velg programmenyen (⋮) øverst til høyre i jamovi, og merk av for ``Syntax mode`` der. Det er mulig å gå ut av syntaksmodus ved å klikke av markeringen.

source: At present, the provided R syntax does not include the data import step, and this must be performed manually. The easiest way of reading and writing jamovi data files in R is the |jmvReadWrite| R package. Alternatively, the |jmvconnect| R-package permits you to access data sets that you have opened in your jamovi session from R.
nb: For øyeblikket inkluderer ikke den medfølgende R-syntaksen dataimporttrinnet, og dette må utføres manuelt. Den enkleste måten å lese og skrive jamovi-datafiler i R på, er med R-pakken |jmvReadWrite|. Alternativt kan du bruke R-pakken |jmvconnect| for å få tilgang til datasett som du har åpnet i din jamovi-sesjon din fra R.
