Repository: sjentsch/jamoviDocs-i18n
Catalog: */LC_MESSAGES/usermanual.po
Languages: de, ja, nb, ta

source: Once a data set is set up with filters, computed variables, transforms and analyses, sometimes you may want to update the data. This may be for a number of reasons – It might be that you have a new data set, that you want to apply the analyses you performed earlier to it, or you may be conducting an experiment where you’re tesing a number of participants, and you now have an additional participant’s data to analyse. By importing into an existing data set you can re-run your analyses without having to re-perform all of your data cleaning and analysis steps (making your jamovi files behave a bit like scripts).
de: Sobald ein Datensatz mit Filtern, berechneten Variablen, Transformationen und Analysen eingerichtet ist, möchten Sie die Daten manchmal aktualisieren. Dies kann verschiedene Gründe haben; z.B. dass Sie eine weitere Datendatei haben, mit der Sie die zuvor durchgeführten Analysen wiederholen möchten, oder weil Sie ein Experiment durchgeführt haben, bei dem Sie nun die Daten eines zusätzlichen Teilnehmers analysieren wollen. Durch den Import in eine bestehende Datendatei können Sie Ihre Analysen erneut durchführen, ohne alle Schritte der Datenbereinigung und -analyse erneut durchführen zu müssen (wodurch sich Ihre jamovi-Dateien ein wenig wie Skripte verhalten).
ja: データセットにフィルター、計算変数、変換を設定し、分析した後で、データを更新したい場合があります。これにはいくつか理由が考えられます。たとえば、新しいデータセットがあり、以前に行った分析をそれに適用したい場合、複数の参加者を対象とした実験を行っていて、新たに追加された参加者のデータを分析したい場合などです。既存のデータセットにインポートすることで、すべてのデータクリーニングや分析手順をやり直すことなく、再度分析を実行できます（これにより、jamoviファイルはスクリプトのように動作します）。
nb: Når et datasett er satt opp med filtre, beregnede variabler, transformeringer og analyser, kan det av og til være nødvendig å oppdatere dataene. Dette kan har flere grunner: Det kan være at du har et nytt datasett hvor du vil bruke analysene du utførte tidligere, eller du kan utføre et eksperiment hvor du få data fra en eller flere ekstra deltakere som du ønsker å analysere. Ved å importere til et eksisterende datasett kan du kjøre analysene på nytt uten å måtte utføre alle trinnene for datarensing og -analyse på nytt (jamovi-filene dine dermed oppfører seg litt som en skript).
ta: வடிப்பான்கள், கணக்கிடப்பட்ட மாறிகள், உருமாற்றங்கள் மற்றும் பகுப்பாய்வுகளுடன் தரவு தொகுப்பு அமைக்கப்பட்டதும், சில நேரங்களில் நீங்கள் தரவைப் புதுப்பிக்க விரும்பலாம். இது பல காரணங்களுக்காக இருக்கலாம் - உங்களிடம் ஒரு புதிய தரவுத் தொகுப்பு இருக்கலாம், நீங்கள் முன்பு செய்த பகுப்பாய்வுகளைப் பயன்படுத்த விரும்புகிறீர்கள், அல்லது நீங்கள் ஒரு பரிசோதனையை நடத்தலாம், அங்கு நீங்கள் பல பங்கேற்பாளர்களைக் கவரும், பகுப்பாய்வு செய்ய கூடுதல் பங்கேற்பாளரின் தரவு இப்போது உங்களிடம் உள்ளது. ஏற்கனவே உள்ள தரவுத் தொகுப்பில் இறக்குமதி செய்வதன் மூலம், உங்கள் தரவு தூய்மை மற்றும் பகுப்பாய்வு படிகள் அனைத்தையும் மீண்டும் செயல்படாமல் உங்கள் பகுப்பாய்வுகளை மீண்டும் இயக்கலாம் (உங்கள் சாமோவி கோப்புகள் ச்கிரிப்ட்களைப் போலவே செயல்படுகின்றன).

source: A summary of how to import multiple file and how to use templates in jamovi is provided in this `video introduction <https://youtu.be/u1K47yLEMbc>`__ (in English).
de: Eine Zusammenfassung, wie man mehrere Dateien importiert und wie man jamovi-Vorlagen verwendet, finden Sie in dieser `Videoeinführung <https://youtu.be/u1K47yLEMbc>`__ (auf Englisch).
ja: jamoviへの複数ファイルのインポート方法や、テンプレートの使い方についての概要は、この `説明ビデオ <https://youtu.be/u1K47yLEMbc>`__ （英語）で説明されています。
nb: En oppsummering av hvordan du importerer flere filer og hvordan du bruker maler i jamovi, finner du i denne `introduksjonsvideoen <https://youtu.be/u1K47yLEMbc>`__ (på engelsk).
ta: பல கோப்பை எவ்வாறு இறக்குமதி செய்வது மற்றும் சாமோவியில் வார்ப்புருக்கள் எவ்வாறு பயன்படுத்துவது என்பதற்கான சுருக்கம் இந்த `வீடியோ அறிமுகத்தில் <https://youtu.be/u1k47ylembc>` __ (ஆங்கிலத்தில்) வழங்கப்பட்டுள்ளது.

source: Single-file Import
de: Import einer einzelnen Datei
ja: 単一ファイルのインポート
nb: Import av én fil
ta: ஒற்றை கோப்பு இறக்குமதி

source: Import is available from the file menu (☰) at the top left of jamovi. When you import a file into an existing data set, the following operations are performed:
de: Der Import ist über das Dateimenü (☰; oben links in jamovi) verfügbar. Wenn Sie eine Datei in einen bestehenden Datensatz importieren, werden die folgenden Schritte durchgeführt:
ja: インポートは、jamoviの左上にあるファイルメニュー（☰）から利用できます。既存のデータセットにファイルをインポートすると、次の操作が実行されます。
nb: Import er tilgjengelig fra filmenyen (☰) øverst til venstre i jamovi. Når du importerer en fil til et eksisterende datasett, utføres følgende operasjoner:
ta: சாமோவியின் மேல் இடதுபுறத்தில் உள்ள கோப்பு மெனுவிலிருந்து (☰) இறக்குமதி கிடைக்கிறது. ஏற்கனவே உள்ள தரவு தொகுப்பில் ஒரு கோப்பை இறக்குமதி செய்யும் போது, பின்வரும் செயல்பாடுகள் செய்யப்படுகின்றன:

source: All the rows of the existing data set are deleted.
de: Alle Zeilen der vorhandenen Datendatei werden gelöscht.
ja: 既存のデータセットのすべての行が削除されます。
nb: Alle radene i det eksisterende datasettet slettes.
ta: தற்போதுள்ள தரவு தொகுப்பின் அனைத்து வரிசைகளும் நீக்கப்படுகின்றன.

source: All the (original) names of the existing columns are matched to the names of the columns from the new data set.
de: Die (ursprünglichen) Namen der vorhandenen Spalten werden mit den Namen der Spalten aus dem neuen Datensatz abgeglichen.
ja: 既存の（元の）列のすべての名前が、新しいデータセットの列名と照合されます。
nb: Alle (opprinnelige) navn på de eksisterende kolonnene er sammenliknet og forbundet med navnene på kolonnene fra det nye datasettet.
ta: தற்போதுள்ள நெடுவரிசைகளின் அனைத்து (அசல்) பெயர்களும் புதிய தரவு தொகுப்பிலிருந்து நெடுவரிசைகளின் பெயர்களுடன் பொருந்துகின்றன.

source: The new values are imported to the existing columns, *keeping* the data and measure types from the existing data set.
de: Die neuen Werte werden in die vorhandenen Spalten importiert, wobei der Datentyp und das Skalenniveau des vorhandenen Datensatzes *beibehalten* werden.
ja: 新しい値は既存の列にインポートされ、既存データセットのデータ型や測定値型は *そのまま保持* されます。
nb: De nye verdiene importeres til de eksisterende kolonnene, *og beholder* data- og måltypene fra det eksisterende datasettet.
ta: புதிய மதிப்புகள் தற்போதுள்ள நெடுவரிசைகளுக்கு இறக்குமதி செய்யப்படுகின்றன, * தரவுகளை வைத்திருத்தல் * தற்போதுள்ள தரவு தொகுப்பிலிருந்து வகைகளை அளவிடுகின்றன.

source: The new columns which did not match names in the original data set are appended to the right of the data set.
de: Variablen, die im ursprünglichen Datensatz nicht existierten (oder einen anderen Namen hatten), werden in der Datentabelle rechts angehängt (d.h. nach den existierenden Variablen).
ja: 元のデータセットと名前が一致しなかった新しい列は、データセットの右側に追加されます。
nb: De nye kolonnene som ikke samsvarte med navnene i det opprinnelige datasettet er lagt til til høyre for det opprinnelige datasettet.
ta: அசல் தரவு தொகுப்பில் பெயர்களுடன் பொருந்தாத புதிய நெடுவரிசைகள் தரவு தொகுப்பின் வலதுபுறத்தில் சேர்க்கப்படுகின்றன.

source: If no new column matches the column names in the existing data set, then those columns are left blank.
de: Wenn keine neue Spalte mit einem Spaltennamen im vorhandenen Datensatz übereinstimmt, wird diese Spalte leer gelassen.
ja: 新しいデータセットに既存のデータセットの列名と一致する列がない場合、それらの列は空白のままになります。
nb: Hvis ingen ny kolonne samsvarer med kolonnenavnene i det eksisterende datasettet, blir disse kolonnene stående tomme.
ta: தற்போதுள்ள தரவு தொகுப்பில் உள்ள நெடுவரிசை பெயர்களுடன் புதிய நெடுவரிசை பொருந்தவில்லை என்றால், அந்த நெடுவரிசைகள் காலியாக விடப்படும்.

source: Following a file import, all the filters, computed variables, transforms and analyses update.
de: Nach einem solchen Datei-Import werden alle Filter, berechneten Variablen, Transformationen und Analysen aktualisiert.
ja: ファイルのインポート後、すべてのフィルター、計算変数、変換処理、分析が更新されます。
nb: Etter en filimport oppdateres alle filtre, beregnede variabler, transformasjoner og analyser.
ta: கோப்பு இறக்குமதியைத் தொடர்ந்து, அனைத்து வடிப்பான்கள், கணக்கிடப்பட்ட மாறிகள், மாற்றங்கள் மற்றும் பகுப்பாய்வு புதுப்பிப்புகளை பகுப்பாய்வு செய்கிறது.

source: Multi-file Import
de: Import mehrerer Dateien
ja: 複数ファイルのインポート
nb: Import av flere filer
ta: பல கோப்பு இறக்குமதி

source: It is also possible to import multiple files at once. This can be useful when you are combining multiple data sets, for example, where each file represents a participant. The process is the same as the single-file import detailed above, except that you select multiple files when performing the import. You can do this by holding down control or shift when selecting data files, or with the “multi-select” button (three lines preceded by tick marks) at the top of the import dialog.
de: Es ist auch möglich, mehrere Dateien auf einmal zu importieren. Dies kann nützlich sein, wenn Sie mehrere Datensätze kombinieren, z. B. wenn jede Datei einen Teilnehmer darstellt. Der Vorgang ist derselbe wie der oben beschriebene Einzeldatei-Import, mit dem Unterschied, dass Sie mehrere Dateien auswählen, wenn Sie den Import durchführen. Sie können dies tun, indem Sie beim Auswählen von Datendateien die Strg- oder Umschalttaste gedrückt halten, oder mit der „Mehrfachauswahl“-Schaltfläche (drei Linien mit vorangestellten Häkchen) oben im Importdialog.
ja: 複数のファイルを一度にインポートすることも可能です。これは、たとえば各ファイルが参加者を表すような、複数のデータセットを結合する場合に便利です。手順は上記の単一ファイルのインポートと同じですが、インポート時に複数のファイルを選択する点が異なります。データファイルを選択する際にCtrlキーやShiftキーを押しながらクリックするか、インポートダイアログ上部の「複数選択」ボタン（チェックマーク付きの三本線）を使って複数選択ができます。
nb: Det er også mulig å importere flere filer samtidig. Dette kan være nyttig når du skal kombinere flere datasett, for eksempel der hver fil representerer en deltaker. Prosessen er den samme som for import av én fil som beskrevet ovenfor, bortsett fra at du velger flere filer når du utfører importen. Dette kan du gjøre ved å holde nede Ctrl eller Shift når du velger datafiler, eller ved hjelp av "flervalgsknappen" (tre linjer med haker foran) øverst i importdialogboksen.
ta: ஒரே நேரத்தில் பல கோப்புகளை இறக்குமதி செய்ய முடியும். நீங்கள் பல தரவுத் தொகுப்புகளை இணைக்கும்போது இது பயனுள்ளதாக இருக்கும், எடுத்துக்காட்டாக, ஒவ்வொரு கோப்பும் பங்கேற்பாளரைக் குறிக்கும். இந்த செயல்முறை மேலே விவரிக்கப்பட்டுள்ள ஒற்றை கோப்பு இறக்குமதியைப் போன்றது, இறக்குமதியைச் செய்யும்போது பல கோப்புகளைத் தேர்ந்தெடுப்பதைத் தவிர. தரவுக் கோப்புகளைத் தேர்ந்தெடுக்கும்போது கட்டுப்பாடு அல்லது மாற்றத்தை வைத்திருப்பதன் மூலம் அல்லது இறக்குமதி உரையாடலின் மேலே உள்ள “மல்டி-தேர்ந்தெடுக்கப்பட்ட” பொத்தானை (டிக் மதிப்பெண்களுக்கு முந்தைய மூன்று கோடுகள்) மூலம் இதைச் செய்யலாம்.

source: When importing multiple files like this, they are combined vertically with the rows of the second file appearing below the first, the rows of the third file appearing below the second, and so on. An additional column called ``source`` is created detailing which file each row has come from. This can be useful when you need to “split-by” or “group-by” each participant. This column can be particularly useful to use with the ``group_by`` argument to ``V``-functions described above.
de: Werden mehrere Dateien auf diese Weise importiert, werden diese vertikal kombiniert. Dabei erscheinen die Zeilen der zweiten Datei unter der ersten, die Zeilen der dritten Datei unter der zweiten und so weiter. Es wird eine zusätzliche Spalte namens ``source`` erstellt, die angibt, aus welcher Datei die einzelnen Zeilen stammen. Dies kann nützlich sein, wenn Sie die einzelnen Teilnehmer „aufteilen“ oder „gruppieren“ wollen. Diese Spalte kann lässt sich gut mit dem Argument ``group_by`` der zuvor beschriebenen ``V``-Funktionen verwenden.
ja: このように複数のファイルをインポートする場合、ファイルは縦方向に結合されます。つまり、2つ目のファイルの行は1つ目の下に、3つ目のファイルの行は2つ目の下に、というように追加されていきます。また、 ``source`` という追加の列が作成され、各行がどのファイルから来たのかが記録されます。これは、各参加者ごとに ``分割`` や ``グループ化`` を行いたい場合に便利です。とくに、この列は上記で説明した ``V`` 関数の ``group_by`` 引数と組み合わせて使う際に役立ちます。
nb: Når du importerer flere filer på denne måten, kombineres de vertikalt slik at radene i den andre filen vises under den første, radene i den tredje filen som vises under den andre, og så videre. Det opprettes en ekstra kolonne kalt ``source`` som viser hvilken fil hver rad kommer fra. Dette kan være nyttig når du trenger å ``split by`` eller ``group by`` hver deltaker. Denne kolonnen kan derfor være spesielt nyttig å bruke med argumentet ``group_by`` til ``V``-funksjonene beskrevet før.
ta: இது போன்ற பல கோப்புகளை இறக்குமதி செய்யும் போது, அவை முதல் கோப்பின் வரிசைகள் முதல் கீழே தோன்றும், மூன்றாவது கோப்பின் வரிசைகள் இரண்டாவது கீழே தோன்றும், மற்றும் பலவற்றைக் கொண்டு செங்குத்தாக இணைக்கப்படுகின்றன. ஒவ்வொரு வரிசையிலும் எந்த கோப்பில் இருந்து வந்தது என்பதை விவரித்து `` மூல`` எனப்படும் கூடுதல் நெடுவரிசை உருவாக்கப்பட்டது. ஒவ்வொரு பங்கேற்பாளரும் “பிளவு” அல்லது “குழு-மூலம்” தேவைப்படும்போது இது பயனுள்ளதாக இருக்கும். மேலே விவரிக்கப்பட்ட `` v`` செயல்பாடுகளுக்கு `` குழு_பிபி`` வாதத்துடன் பயன்படுத்த இந்த நெடுவரிசை மிகவும் பயனுள்ளதாக இருக்கும்.

source: At present, there is no way to combine files horizontally in jamovi.
de: Zur Zeit gibt es in jamovi keine Möglichkeit, Dateien horizontal zu kombinieren (d.h. Datensätze der gleichen Versuchsteilnehmer mit zusätzlichen Variablen zu erweitern).
ja: 現在、jamoviではファイルを横方向に連結することはできません。
nb: For tiden er det ingen måte å kombinere filer horisontalt i jamovi.
ta: தற்போது, சமோவியில் கிடைமட்டமாக கோப்புகளை இணைக்க வழி இல்லை.

source: Templates
de: Vorlagen (*templates*)
ja: テンプレート
nb: Maler (*templates*)
ta: வார்ப்புருக்கள்

source: Templates in jamovi are special data sets that are analagous to script files in more traditional statistical environments. They are a way to specify data types, computations, filters, transforms, and analyses in advance. Once the data becomes available, it can be imported into the template, and the template will update accordingly. The nice thing about jamovi templates is that they are entirely specified with the familiar user interface, and do not require working with a “syntax” or code.
de: Vorlagen in jamovi sind spezielle Datendateien, die mit Skriptdateien in anderen Statistikprogrammen vergleichbar sind. Sie bieten eine Möglichkeit, Datentypen, Berechnungen, Filter, Transformationen und Analysen im Voraus zu spezifizieren. Sobald die Daten verfügbar sind, können sie in die Vorlage importiert werden, und die Vorlage wird entsprechend aktualisiert. Das Elegante an jamovi-Vorlagen ist, dass sie vollständig über die vertraute Benutzeroberfläche spezifiziert werden und keine Arbeit mit einer „Syntax“ oder Code erfordern.
ja: jamoviのテンプレートは、従来の統計ソフトウェアにおけるスクリプトファイルに相当する特別なデータセットです。テンプレートを使うことで、データ型や計算、フィルター、変換、分析内容などを事前に指定しておくことができます。データが利用可能になった際には、そのデータをテンプレートにインポートするだけで、テンプレートの内容が自動的に更新されます。jamoviのテンプレートの利点は、すべて馴染みのあるユーザーインターフェース上で完結し、「シンタックス」やコードを扱う必要がない点にあります。
nb: Maler i jamovi er spesielle datasett som er analog for skript-filer i andre statistiske programpakker. De er en måte å spesifisere datatyper, beregninger, filtre, transformeringer og analyser på forhånd. Når dataene blir tilgjengelige, kan de importeres til malen, og beregninger og analysene oppdateres automatisk. Det fine med jamovi-maler er at de er helt spesifisert med det kjente brukergrensesnittet, og krever ikke å jobbe med en «syntaks» eller kode.
ta: சமோவியில் உள்ள வார்ப்புருக்கள் சிறப்பு தரவுத் தொகுப்புகள் ஆகும், அவை மிகவும் பாரம்பரிய புள்ளிவிவர சூழல்களில் ச்கிரிப்ட் கோப்புகளுக்கு பகுப்பாய்வு செய்கின்றன. அவை தரவு வகைகள், கணக்கீடுகள், வடிப்பான்கள், உருமாற்றங்கள் மற்றும் பகுப்பாய்வுகளை முன்கூட்டியே குறிப்பிடுவதற்கான ஒரு வழியாகும். தரவு கிடைத்ததும், அதை வார்ப்புருவில் இறக்குமதி செய்யலாம், மேலும் வார்ப்புரு அதற்கேற்ப புதுப்பிக்கப்படும். சாமோவி வார்ப்புருக்கள் பற்றிய நல்ல சேதி என்னவென்றால், அவை பழக்கமான பயனர் இடைமுகத்துடன் முழுமையாக குறிப்பிடப்பட்டுள்ளன, மேலும் “தொடரியல்” அல்லது குறியீட்டில் வேலை செய்ய தேவையில்லை.

source: To save a data set as a template, select ``Export`` from the file menu, and select ``jamovi template (.omt)`` from the file type box. When opening a template, you’ll see it contains columns but no rows, and that all the analysis results are blank. To use the template, import a new data set (or data sets) using the file import described above. The data will update, followed by the filters, computed variables, and finally the analysis results.
de: Um einen Datensatz als Vorlage zu speichern, wählen Sie ``Export`` aus dem Dateimenü und wählen Sie ``jamovi template (.omt)`` aus dem Dateityp-Auswahlmenü. Wenn Sie eine Vorlage öffnen, werden Sie sehen, dass sie Spalten, aber keine Zeilen enthält, und dass alle Analyseergebnisse leer sind. Um die Vorlage zu verwenden, importieren Sie einen (oder mehrere) neue Datensätze mit dem zuvor beschriebenen Datei-Import. Die Daten werden eingelesen, mit den in den berechneten Variablen hinterlegten Formeln neu berechnet, danach gefiltert und schließlich werden die Analyseergebnisse aktualisiert.
ja: データセットをテンプレートとして保存するには、ファイルメニューから ``書き出し`` を選択し、ファイルタイプのボックスから ``jamoviテンプレート（.omt）`` を選びます。テンプレートを開くと、列は含まれていますが行はなく、すべての分析結果が空白になっているのが分かります。テンプレートを利用するには、上記で説明したファイルインポート機能を使って新しいデータセット（または複数のデータセット）をインポートします。すると、データが更新され、それに続いてフィルター、計算変数、最終的に分析結果も更新されます。
nb: Hvis du vil lagre et datasett som en mal, velger du ``Export`` fra filmenyen, og velger ``jamovi template (.omt)`` fra filtype-boksen. Når du åpner en mal, vil du se at den inneholder kolonner, men ingen rader, og at alle analyseresultatene er tomme. For å bruke malen importerer du et nytt datasett (eller flere datasett) ved hjelp av filimporten beskrevet ovenfor. Dataene oppdateres, etterfulgt av filtrene, de beregnede variablene og til slutt analyseresultatene.
ta: தரவு தொகுப்பை ஒரு வார்ப்புருவாக சேமிக்க, கோப்பு மெனுவிலிருந்து `` ஏற்றுமதி` என்பதைத் தேர்ந்தெடுத்து, கோப்பு வகை பெட்டியிலிருந்து `` சாமோவி வார்ப்புரு (.omt) `` என்பதைத் தேர்ந்தெடுக்கவும். ஒரு வார்ப்புருவைத் திறக்கும்போது, அதில் நெடுவரிசைகள் இருப்பதை நீங்கள் காண்பீர்கள், ஆனால் வரிசைகள் இல்லை, மேலும் அனைத்து பகுப்பாய்வு முடிவுகளும் காலியாக உள்ளன. வார்ப்புருவைப் பயன்படுத்த, மேலே விவரிக்கப்பட்ட கோப்பு இறக்குமதியைப் பயன்படுத்தி புதிய தரவு தொகுப்பை (அல்லது தரவு தொகுப்புகள்) இறக்குமதி செய்க. தரவு புதுப்பிக்கப்படும், அதைத் தொடர்ந்து வடிப்பான்கள், கணக்கிடப்பட்ட மாறிகள் மற்றும் இறுதியாக பகுப்பாய்வு முடிவுகள்.

source: jamovi templates are also a great way to provide analyses to less capable students or colleagues.
de: jamovi-Vorlagen eignen sich auch hervorragend, um Analysen für Schüler oder Kollegen zu erstellen die weniger umfangreiche Kenntnisse über statistische Analysen haben.
ja: jamoviのテンプレートは、経験の浅い学生や同僚に分析を提供する方法としても非常に便利です。
nb: jamovi-maler er også idealt for å forberede analyser for studenter eller kolleger som har mindre omfattende kunnskap om statistiske analyser.
ta: குறைந்த திறமையான மாணவர்கள் அல்லது தம ஊழியர்களுக்கு பகுப்பாய்வுகளை வழங்க சாமோவி வார்ப்புருக்கள் ஒரு சிறந்த வழியாகும்.

source: Combining jamovi and R
de: jamovi und R kombinieren
ja: jamoviとRの連携
nb: Kombinere jamovi og R
ta: சமோவி மற்றும் ஆர் ஆகியவற்றை இணைத்தல்

source: A huge advantage of jamovi is that it is not only built on top of the R statistical language, it also makes it also very easy to access R from jamovi, and jamovi from R. The syntax mode, ``Rj``, |jmvconnect| and |jmvReadWrite| help you to achieve that.
ja: jamoviの大きな利点は、R統計言語の上に構築されているだけでなく、jamoviからRへ、またRからjamoviへ非常に簡単にアクセスできる点です。シンタックスモード、 ``Rj`` 、 |jmvconnect| 、 |jmvReadWrite| がその実現を助けてくれます。

source: Syntax Mode
de: Syntax-Modus
ja: シンタックスモード
nb: Syntaksmodus
ta: தொடரியல் பயன்முறை

source: jamovi provides an “R Syntax Mode”, in this mode, jamovi produces equivalent R code for each analysis. To change to syntax mode, select the application menu (⋮) at the top right of jamovi, and check the ``Syntax mode`` checkbox there. It is possible to leave syntax mode by clicking this a second time.
ja: jamovi には「R シンタックスモード」が用意されており、このモードでは各分析に対応する R コードが自動的に生成されます。シンタックスモードに切り替えるには、jamovi 画面右上のアプリケーションメニュー（縦に三つ並んだ点「⋮」）をクリックし、表示される ``シンタックスモード`` チェックボックスにチェックを入れてください。もう一度クリックするとシンタックスモードを解除できます。
ta: சாமோவி ஒரு “ஆர் தொடரியல் பயன்முறையையும்” வழங்குகிறது, இந்த பயன்முறையில், சாமோவி ஒவ்வொரு பகுப்பாய்விற்கும் சமமான ஆர் குறியீட்டை உருவாக்குகிறார். தொடரியல் பயன்முறையில் மாற்ற, சாமோவியின் மேல் வலதுபுறத்தில் உள்ள பயன்பாட்டு பட்டியல் (⋮) ஐத் தேர்ந்தெடுத்து, அங்குள்ள ``தொடரியல் பயன்முறை`` தேர்வுப்பெட்டியை சரிபார்க்கவும். இதை இரண்டாவது முறையாக சொடுக்கு செய்வதன் மூலம் தொடரியல் பயன்முறையை விட்டு வெளியேற முடியும்.

source: In syntax mode, analyses continue to operate as before, but now they produce R syntax. Like all results objects in jamovi, you can right click on these items (including the R syntax) and copy and paste them, for example, into an R session. All the analyses that are included with jamovi are available within an R session through the R package :doc:`jmv <../jmv/jmv_overview>`.
ja: シンタックスモードでは、分析はこれまで通り実行されますが、Rの構文（Rシンタックス）が生成されます。jamoviのすべての結果オブジェクトと同様に、これらの項目（Rシンタックスも含めて）は右クリックしてコピーし、たとえばRのセッションに貼り付けることもできます。jamoviに含まれているすべての分析は、Rパッケージ :doc:`jmv <../jmv/jmv_overview>` を使うことでRセッション内でも利用できます。

source: The provided R syntax does not include the data import step, but this can be easily achieved by using the R packages |jmvconnect|_ and |jmvReadWrite|_ (explained in more detail below). |jmvReadWrite|_ enables you to read and write jamovi data files (.omv) in R, |jmvconnect|_ permits you to access data sets that you have opened in your jamovi session from R.
ja: 生成されるRの構文（Rシンタックス）にはデータのインポート手順は含まれていませんが、これはRパッケージ |jmvconnect|_ と |jmvReadWrite|_ を使うことで簡単に実現できます（詳細は後述）。 |jmvReadWrite|_ はRでjamoviのデータファイル（.omv）の読み書きを可能にし、 |jmvconnect|_ はjamoviセッションで開いているデータセットにRからアクセスできるようにします。

source: ``Rj`` Editor
ja: ``Rj`` エディタ
ta: `` Rj`` ஆசிரியர்

source: The ``Rj Editor`` allows you to use ``R`` code to analyse data directly in jamovi, and make use of your favourite R packages from within jamovi. ``Rj`` is a module for jamovi (see :doc:`../howto/howto_Install_modules`) that allows you to use the R programming language to analyse data from within jamovi.
de: ``Rj`` ist ein Modul für jamovi (siehe :doc:`../howto/howto_Install_modules`) das den ``Rj``- Editor enthält. Sie können den ``Rj``- Editor verwenden, um ihre Daten in jamovi unter Verwendung von ``R``-Code und Ihren bevorzugten R-Paketen zu analysieren.
ja: ``Rjエディタ`` を使うと、jamovi内で直接 ``R`` のコードを用いてデータを分析したり、お気に入りのRパッケージをjamoviから利用したりできます。 ``Rj`` はjamoviのモジュールの一つで（インストール方法については :doc:`../howto/howto_Install_modules` 参照）jamovi内でRプログラミング言語を使ってデータ分析を行えるようにします。
nb: ``Rj Editor`` kan brukes til å analysere data ved bruk av ``R`` direkte i jamovi. På denne måten kan du også bruke de R-pakkene du liker best fra jamovi. `Rj` ` er en av de mange tillegsmodulene for jamovi (se :doc:`../howto/howto_Install_modules`).
ta: ``ஆர்.சே. எடிட்டர்`` சாமோவியில் தரவை நேரடியாக பகுப்பாய்வு செய்ய ``ஆர்`` குறியீட்டைப் பயன்படுத்தவும், சமோவிக்குள் இருந்து உங்களுக்கு பிடித்த ஆர் தொகுப்புகளைப் பயன்படுத்தவும் உங்களை அனுமதிக்கிறது. `` Rj`` என்பது சாமோவிக்கான ஒரு தொகுதி (பார்க்க :doc:`../howto/howto_Install_modules`) இது சமோவிக்குள் இருந்து தரவை பகுப்பாய்வு செய்ய ஆர் நிரலாக்க மொழியைப் பயன்படுத்த அனுமதிக்கிறது.
