Repository: sjentsch/jamoviDocs-i18n
Catalog: */LC_MESSAGES/usermanual.po
Languages: de, ja, nb, ta

source: Survey data often contains one or more items whose values need to be reversed before analyzing them. For example, we might be measuring extraversion with the questions “I like to go to parties”, “I love being around people”, and “I prefer to keep to myself”. Clearly a person responding 6 (strongly agree) to this last question shouldn’t be considered an extravert, and so 6 should be treated as 1, 5 as 2, 1 as 6, etc. To reverse score these items, we can just use the following simple transform:
de: Umfragedaten enthalten oft ein oder mehrere Items, deren Werte vor der Analyse invertiert werden müssen. Zum Beispiel könnten wir die Extravertiertheit mit den Fragen „Ich gehe gerne auf Partys“, „Ich bin gerne unter Menschen“ und „Ich bleibe lieber für mich“ messen. Eine Person, die auf die letzte Frage mit 6 (stimme voll und ganz zu) antwortet, sollte nicht als extravertiert angesehen werden, und daher sollte 6 als 1, 5 als 2, 1 als 6 usw. behandelt werden. Um solche Items zu invertieren, können wir die folgende einfache Transformation verwenden:
ja: アンケートデータには、分析前に値を逆転させる必要のある項目が1つ以上含まれていることがよくあります。たとえば、「私はパーティーに行くのが好きだ」、「人と一緒にいるのが大好きだ」、「一人でいるほうが好きだ」といった質問で外向性を測定している場合を考えます。明らかに、最後の質問に「6（とてもそう思う）」と回答した人は外向的とはみなされるべきではありません。したがって、6は1、5は2、1は6などとして逆転させる必要があります。これらの項目の得点を逆転させるには、次のようなシンプルな変換を使えばよいでしょう。
nb: Data fra spørreundersøkelser inneholder ofte ett eller flere spørsmål der verdiene må inverteres før de kan analyseres. Vi kan for eksempel måle ekstraversjon med spørsmålene «Jeg liker å gå på fest», «Jeg liker å være sammen med folk» og «Jeg foretrekker å holde meg for meg selv». En person som svarer 6 (helt enig) på det siste spørsmålet, bør åpenbart ikke regnes som ekstravertert, og 6 bør derfor behandles som 1, 5 som 2, 1 som 6 osv. For å invertere skåringen av disse spørsmålene kan vi bruke den følgende enkle transformasjonen:
ta: கணக்கெடுப்பு தரவுகளில் பெரும்பாலும் ஒன்று அல்லது அதற்கு மேற்பட்ட உருப்படிகள் உள்ளன, அவற்றின் மதிப்புகளை பகுப்பாய்வு செய்வதற்கு முன் மாற்றியமைக்க வேண்டும். எடுத்துக்காட்டாக, “நான் விருந்துகளுக்குச் செல்ல விரும்புகிறேன்”, “நான் மக்களைச் சுற்றி இருப்பதை விரும்புகிறேன்”, மற்றும் “நானே வைத்திருக்க விரும்புகிறேன்” என்ற கேள்விகளுடன் நாங்கள் புறம்போக்கு அளவிடலாம். இந்த கடைசி கேள்விக்கு 6 (கடுமையாக ஒப்புக்கொள்கிறேன்) பதிலளிக்கும் ஒரு நபர் ஒரு புறம்போக்கு என்று கருதப்படக்கூடாது என்பது தெளிவாகத் தெரிகிறது, எனவே 6 ஐ 1, 5 ஆக 2, 1 ஆக 6 எனக் கருத வேண்டும். இந்த உருப்படிகளை மாற்றியமைக்க, நாம் பயன்படுத்தலாம் பின்வரும் எளிய உருமாற்றம்:

source: You can explore this transform by `downloading <../_static/output/um_transform_ex1.omv>` and opening the file ``transform_ex1`` in jamovi.
de: Sie können diese Transformation selbst ausprobieren, indem Sie `<../_static/output/um_transform_ex1.omv> herunterladen` und die Datei ``transform_ex1`` in jamovi öffnen.
ja: この変換は、 `サンプルデータ <../_static/output/um_transform_ex1.omv>` をダウンロードし、jamoviで ``transform_ex1`` ファイルを開くことで確認できます。
nb: Du kan utforske denne transformasjonen ved å laste ned <../_static/output/um_transform_ex1.omv>` og åpne filen ``transform_ex1`` i jamovi.
ta: இந்த மாற்றத்தை `பதிவிறக்கம் <../_ நிலையான/வெளியீடு/UM_TRANSFORM_EX1.OMV>` மற்றும் சாமோவியில் `` டிரான்ச்ஃபார்ம்_எக்ச் 1` கோப்பைத் திறப்பதன் மூலம் ஆராயலாம்.

source: **Example 2: Recoding continuous variables into categories**
de: **Beispiel 2: Umkodieren kontinuierlicher Variablen in Kategorien**
ja: **例2：連続変数をカテゴリとして再コード化する**
nb: **Eksempel 2: Omkoding av kontinuerlige variabler til kategorier**
ta: ** எடுத்துக்காட்டு 2: தொடர்ச்சியான மாறிகளை வகைகளாக மாற்றியமைத்தல் **

source: In a lot of data sets people want to recode their continuous scores into categories. For example, we may want to classify people, based on their 0-100% test scores into one of three groups, ``Pass``, ``Resit`` and ``Fail``.
de: In vielen Datensätzen möchte man kontinuierliche Daten in Kategorien umkodieren. Zum Beispiel können wir Personen auf der Grundlage ihrer Testergebnisse (0 bis 100%) in eine von drei Gruppen ``Pass``, ``Resit`` und ``Fail`` einteilen.
ja: 多くのデータセットでは、連続的な得点をカテゴリに再コード化したい場合があります。たとえば、0～100点の試験の点数に基づいて、人々を ``合格`` 、 ``再試験`` 、 ``不合格`` の3つのグループのいずれかに分類したい場合などです。
nb: I mange datasett ønsker folk å omkode de kontinuerlige resultatene sine til kategorier. For eksempel kan det være lurt å klassifisere personer, basert på testresultatene deres fra 0-100 %, i én av tre grupper: ``Pass``, ``Resit`` og ``Fail``.
ta: நிறைய தரவுத் தொகுப்புகளில், மக்கள் தங்கள் தொடர்ச்சியான மதிப்பெண்களை வகைகளாக மறுபரிசீலனை செய்ய விரும்புகிறார்கள். எடுத்துக்காட்டாக, மக்களை அவர்களின் 0-100% சோதனை மதிப்பெண்களின் அடிப்படையில் மூன்று குழுக்களில் ஒன்றான `` பாச்``, `` ரெக்ட்`` மற்றும் `` தோல்வி`` என வகைப்படுத்த விரும்பலாம்.

source: Note that the conditions are executed in order, and that only the first rule that matches the case is applied to that case. So this transformation basically says that if the source variable has a value below 50, the value will be ``Fail``, if the source variable has a value between 50 and 60, the value will be ``Resit``, and if the source variable has a value above 60, the value will be ``Pass``. If you’d like an example data set to play around with, you can `download <../_static/output/um_transform_ex2.omv>` and use ``transform_ex2.omv``.
de: Beachten Sie, dass die Bedingungen der Reihe nach ausgeführt werden und dass nur die erste Regel, die auf einen Fall zutrifft, angewendet wird. Diese Transformation besagt also im Wesentlichen, dass, wenn die Originalvariable einen Wert unter 50 hat, der Wert ``Fail`` sein wird, wenn die Quellvariable einen Wert zwischen 50 und 60 hat, der Wert ``Resit`` sein wird, und wenn die Quellvariable einen Wert über 60 hat, der Wert ``Pass`` sein wird. Wenn Sie einen Beispieldatensatz zum Ausprobieren haben möchten, können Sie `<../_static/output/um_transform_ex2.omv> herunterladen` und den Datensatz ``transform_ex2.omv`` verwenden.
ja: 条件は上から順に実行され、最初に該当したルールだけがそのケースに適用されることに注意してください。つまり、この変換は「変換元の変数が50点未満なら値は ``不合格`` 、50点以上60点以下なら値は ``再試験`` 、60点より大きければ値は ``合格`` という意味になります。試してみたい場合は、 ``transform_ex2.omv`` を `ダウンロード <../_static/output/um_transform_ex2.omv>` して使うことができます。
nb: Legg merke til at betingelsene utføres i rekkefølge, og at bare den første regelen som samsvarer med caset, blir brukt på det aktuelle caset. Så denne transformasjonen sier i utgangspunktet at hvis kildevariabelen har en verdi under 50, vil verdien være ``Fail``, hvis kildevariabelen har en verdi mellom 50 og 60, vil verdien være ``Resit``, og hvis kildevariabelen har en verdi over 60, vil verdien være ``Pass``. Hvis du vil ha et eksempel på et datasett å leke deg med, kan du `laste ned <../_static/output/um_transform_ex2.omv>` og bruke ``transform_ex2.omv``.
ta: நிபந்தனைகள் வரிசையில் செயல்படுத்தப்படுகின்றன என்பதையும், வழக்குடன் பொருந்தக்கூடிய முதல் விதி மட்டுமே அந்த வழக்கில் பயன்படுத்தப்படுகிறது என்பதையும் நினைவில் கொள்க. எனவே இந்த உருமாற்றம் அடிப்படையில் மூல மாறிக்கு 50 க்கும் குறைவான மதிப்பு இருந்தால், மதிப்பு `` தோல்வி``, மூல மாறிக்கு 50 முதல் 60 வரை மதிப்பு இருந்தால், மதிப்பு `` ரெக்ட்`` ஆக இருக்கும் மூல மாறி 60 க்கு மேல் ஒரு மதிப்பைக் கொண்டுள்ளது, மதிப்பு `` பாச்`` ஆக இருக்கும். நீங்கள் ஒரு எடுத்துக்காட்டு தரவு அமைக்க விரும்பினால், நீங்கள் `பதிவிறக்கம் <../_ நிலையான/வெளியீடு/UM_TRANSFORM_EX2.OMV>` மற்றும் `` Transtry_ex2.omv`` ஐப் பயன்படுத்தலாம்.

source: **Example 3: Replacing missing values**
de: **Beispiel 3: Ersetzen fehlender Werte**
ja: **例3：欠損値の置換**
nb: **Eksempel 3: Erstatning av manglende verdier**
ta: ** எடுத்துக்காட்டு 3: காணாமல் போன மதிப்புகளை மாற்றுதல் **

source: Now, let’s say your data set has a lot of missing values and removing the participants with missing values will end up in a severe loss of participants. There are a number of ways to deal with missing data, of which imputation is quite common. One pretty straightforward imputation method replaces the missing values with the variable mean (i.e., mean substitution). Although there are a bunch of problems associated with mean substitution and you should probably never do it, it does make for a neat demonstration...
de: Angenommen, Ihr Datensatz enthält viele fehlende Werte, und das Entfernen der Teilnehmer mit fehlenden Werten würde zu einem erheblichen Verlust an Teilnehmern führen. Es gibt eine Reihe von Möglichkeiten, mit fehlenden Werten umzugehen, wobei oft Imputation verwendet wird. Eine unkomplizierte Imputationsmethode ersetzt die fehlenden Werte durch den Mittelwert der Variablen (d. h. Mittelwertsubstitution). Obwohl es eine Reihe von Problemen im Zusammenhang mit der Mittelwertsubstitution gibt und man sie deswegen eher nicht benutzen sollte, eignet sie sich gut zur Demonstration...
ja: データセットに多くの欠損値があり、欠損値のある参加者を除外すると、多数の参加者が除外されることになるとします。欠損データに対処する方法はいくつかありますが、その中でも比較的一般的なのが代入法（imputation）です。非常にシンプルな代入法の1つに、欠損値を変数の平均値で置き換える「平均値代入法」があります。平均値代入法には多くの問題が伴うため、実際に使用すべきではありませんが、ここでは説明用のわかりやすい例として取り上げます...
nb: La oss antar at datasettet ditt har mange manglende verdier, og at det å fjerne deltakere med manglende verdier vil føre til et stort tap av deltakere. Det finnes en rekke måter å håndtere manglende data på, og imputering er en ganske vanlig metode. En ganske enkel imputeringsmetode erstatter de manglende verdiene med variabelens gjennomsnitt (dvs. gjennomsnittssubstitusjon). Selv om det er en rekke problemer forbundet med gjennomsnittssubstitusjon, og du sannsynligvis aldri bør gjøre det, er det en fin demonstrasjon...
ta: இப்போது, உங்கள் தரவுத் தொகுப்பில் காணாமல் போன மதிப்புகள் நிறைய உள்ளன என்று சொல்லலாம், மேலும் பங்கேற்பாளர்களை காணாமல் போன மதிப்புகளுடன் அகற்றுவது பங்கேற்பாளர்களின் கடுமையான இழப்பில் முடிவடையும். காணாமல் போன தரவைக் கையாள்வதற்கு பல வழிகள் உள்ளன, அவற்றில் குற்றச்சாட்டு மிகவும் பொதுவானது. ஒரு அழகான நேரடியான கணக்கீட்டு முறை காணாமல் போன மதிப்புகளை மாறி சராசரியுடன் மாற்றுகிறது (அதாவது, சராசரி மாற்றீடு). சராசரி மாற்றோடு தொடர்புடைய ஒரு சில சிக்கல்கள் இருந்தாலும், நீங்கள் அதை ஒருபோதும் செய்யக்கூடாது என்றாலும், அது ஒரு தூய்மையான ஆர்ப்பாட்டத்தை உருவாக்குகிறது ...

source: Note that jamovi has borrowed NA from R to denote missing values. Don’t have a good data set handy? You can try it out yourself by `downloading <../_static/output/um_transform_ex3.omv>` and opening the ``transform_ex3.omv`` data set.
de: Beachten Sie, dass jamovi ``NA`` von R übernommen hat, um fehlende Werte zu kennzeichnen. Sie haben keinen guten Datensatz zur Hand? Sie können es selbst ausprobieren, indem Sie `<../_static/output/um_transform_ex3.omv> herunterladen` und den Datensatz ``transform_ex3.omv`` öffnen.
ja: jamoviでは、Rと同様に欠損値に NA を使用していることに注意してください。適当なデータセットが手元にない場合は、 ``transform_ex3.omv`` データセットを `ダウンロード <../_static/output/um_transform_ex3.omv>` して、自分で試すことができます。
nb: Merk at jamovi har lånt ``NA`` fra R for å markere manglende verdier. Har du ikke et godt datasett for hånden? Du kan prøve det selv ved å `laste ned <../_static/output/um_transform_ex3.omv>` og åpne datasettet ``transform_ex3.omv``.
ta: காணாமல் போன மதிப்புகளைக் குறிக்க சாமோவி ஆர் இலிருந்து நா ஐ கடன் வாங்கியுள்ளார் என்பதை நினைவில் கொள்க. நல்ல தரவு தொகுப்பு எளிதில் இல்லையா? `பதிவிறக்கம் <../_ நிலையான/வெளியீடு/UM_TRANSFORM_EX3.OMV>` `` `` `` `` `` `` `` TRANSION_EX3.OMV`` தரவு தொகுப்பை திறப்பதன் மூலம் அதை நீங்களே முயற்சி செய்யலாம்.

source: Filters
de: Filter
ja: フィルタ
nb: Filtre
ta: வடிப்பான்கள்

source: Filters in jamovi allow you to filter out rows that you don’t want included in your analysis. For example, you might want to only include people’s survey responses if they explicitly consented to having their data used, or you might want to exclude all left-handed people, or perhaps people who score “below chance” in an experimental task. In some cases you just want to exclude extreme scores, for example those that score more than 3 standard deviations from the mean.
de: Mit Filtern können Sie in jamovi Zeilen herausfiltern, die Sie aus Ihrer Analyse ausschließen wollen. Zum Beispiel können Sie die Umfrageantworten von Personen nur dann einbeziehen, wenn diese ausdrücklich der Verwendung ihrer Daten zugestimmt haben, Sie könnten alle Linkshänder ausschließen, oder Personen, die bei einer experimentellen Aufgabe „unter Zufallsniveau“ abschneiden. Filter eignen sich auch, um extreme Werte auszuschließen, zum Beispiel solche, die mehr als 3 Standardabweichungen vom Mittelwert abweichen oder die Extremwerte in Bezug auf ihren Interquartilbereich sind (IQR; d.h. Extremwerte außerhalb der Whisker im Box-Whisker-Diagramm).
ja: jamoviのフィルタ機能を使うと、分析に含めたくない行を除外できます。たとえば、データの利用に明示的に同意した人の回答だけを含めたい場合や、左利きの人をすべて除外したい場合、あるいは実験課題で「チャンスレベル以下」の成績を取った人を除外したい場合などです。場合によっては、平均から3標準偏差以上離れた極端な得点を除外したいこともあるでしょう。
nb: Med filtre i jamovi kan du filtrere bort rader som du ikke ønsker å inkludere i analysen. Det kan for eksempel være at du bare vil ta med svarene til personer som har gitt sitt eksplisitte samtykke til at dataene deres kan brukes, eller at du vil ekskludere alle venstrehendte personer, eller kanskje personer som skårer «under sjansenivå» i en eksperimentell oppgave. I noen tilfeller ønsker du bare å ekskludere ekstreme skårer, for eksempel de som skårer mer enn tre standardavvik fra gjennomsnittet.
ta: உங்கள் பகுப்பாய்வில் சேர்க்க விரும்பாத வரிசைகளை வடிகட்ட சமோவியில் உள்ள வடிப்பான்கள் உங்களை அனுமதிக்கின்றன. எடுத்துக்காட்டாக, மக்கள் தங்கள் தரவைப் பயன்படுத்துவதற்கு வெளிப்படையாக சம்மதித்தால் மட்டுமே நீங்கள் சேர்க்க விரும்பலாம், அல்லது நீங்கள் அனைத்து இடது கை நபர்களையும் விலக்க விரும்பலாம், அல்லது ஒரு சோதனை பணியில் “வாய்ப்புக்குக் கீழே” மதிப்பெண் பெறும் நபர்கள். சில சந்தர்ப்பங்களில் நீங்கள் தீவிர மதிப்பெண்களை விலக்க விரும்புகிறீர்கள், எடுத்துக்காட்டாக, சராசரியிலிருந்து 3 நிலையான விலகல்களுக்கு மேல் மதிப்பெண் பெறுபவர்கள்.

source: The filters in jamovi are build on top of jamovi’s *computed variable* formula system, which allows the building of arbitrarily complex formulas.
de: Die Filter in jamovi bauen auf dem jamovis' Formelsystem für *Berechnete Variablen* auf. Dies ermöglicht das Erstellen (und Filtern) beliebig komplexer Formeln.
ja: jamoviのフィルタは、jamoviの計算変数の数式システムを用いて構築されているため、任意の複雑な数式を作成できます。
nb: Filtrene i jamovi er bygget på jamovis *beregnede variabel*-formelsystem. Det gjør det mulig å bygge svært komplekse formler.
ta: சாமோவியில் உள்ள வடிப்பான்கள் சாமோவி * கம்ப்யூட் மாறி * ஃபார்முலா அமைப்பின் மேல் கட்டப்பட்டுள்ளன, இது தன்னிச்சையாக சிக்கலான சூத்திரங்களை உருவாக்க அனுமதிக்கிறது.

source: **Row filters**
de: **Zeilenfilter**
ja: **行フィルタ**
nb: **Radfiltre**
ta: ** வரிசை வடிப்பான்கள் **

source: jamovi filters are demonstrated using the ``Tooth Growth`` data set which is included with jamovi (``☰`` → ``Open`` → ``Data Library``). Select the ``Filters button`` from the ``Data`` ribbon. This opens the filter view and creates a new filter called ``Filter 1``.
de: jamovi-Filter lassen sich anhand des ``Tooth Growth``-Datensatzes demonstrieren, der in jamovi enthalten ist (``☰`` → ``Open`` → ``Data Library``). Wählen Sie das ``Filter``-Icon aus der Registerkarte ``Daten``. Dies öffnet die Filteransicht und erstellt einen neuen Filter namens ``Filter 1``.
ja: jamoviのフィルター機能を、jamovi付属の ``Tooth Growth`` データセット（ ``☰`` → ``開く`` → ``データライブラリ`` ）を使って説明します。 ``データ`` リボンの ``フィルタ`` ボタンを選択すると、フィルタ表示が開き、 ``フィルタ1`` という新しいフィルタが作成されます。
nb: jamovi-filtrene demonstreres ved hjelp av datasettet ``Tooth Growth`` som følger med jamovi (``☰`` → ``Open`` → ``Data Library``). Velg ``Filters button`` fra båndet ``Data``. Dette åpner filtervisningen og oppretter et nytt filter som heter ``Filter 1``.
ta: சாமோவியுடன் சேர்க்கப்பட்டுள்ள `` பல் வளர்ச்சி`` தரவு தொகுப்பைப் பயன்படுத்தி சாமோவி வடிப்பான்கள் நிரூபிக்கப்படுகின்றன (`☰``` `திறந்த` →` `தரவு நூலகம்`). `` தரவு`` நாடாவிலிருந்து `` வடிப்பான்கள் பொத்தானை` என்பதைத் தேர்ந்தெடுக்கவும். இது வடிகட்டி பார்வையைத் திறந்து `` வடிகட்டி 1`` எனப்படும் புதிய வடிப்பானை உருவாக்குகிறது.

source: In the short video, we specify a filter to exclude the 9th row. Perhaps we know that the 9th participant was someone just testing the survey system, and not a proper participant (``Tooth Growth`` is actually about the length of guinea pig teeth, so perhaps we know that the 9th participant was a rabbit). We can simply exclude them with the formula:
de: In dem kurzen Video verwenden wir einen Filter, um die 9. Zeile auszuschließen. Vielleicht wissen wir, dass der 9. Teilnehmer jemand war, der nur das Umfragesystem getestet hat, und kein richtiger Teilnehmer (``Tooth Growth`` ist ein Datensatz der die Länge von Meerschweinchenzähnen untersucht, also wissen wir vielleicht, dass der 9. Teilnehmer ein Kaninchen war). Wir können sie einfach mit der folgenden Formel ausschließen:
ja: このショートビデオでは、9行目を除外するフィルタを指定しています。たとえば、9番目の参加者が単にアンケートシステムをテストしていただけで、本当の参加者ではなかったことが分かっている場合（ ``Tooth Growth`` は実際にはモルモットの歯の長さに関するデータですが、もしかすると9番目の参加者がウサギだったかもしれません）、次の数式を使って簡単にその行を除外できます。
nb: I den korte videoen spesifiserer vi et filter for å ekskludere den niende raden. Kanskje vi vet at den niende deltakeren var en som bare testet undersøkelsessystemet, og ikke en ekte deltaker (``Tooth Growth`` handler faktisk om lengden på marsvintenner, så kanskje vi vet at den niende deltakeren var en kanin). Vi kan ganske enkelt ekskludere dem med formelen:
ta: குறுகிய வீடியோவில், 9 வது வரிசையை விலக்க ஒரு வடிப்பானைக் குறிப்பிடுகிறோம். 9 வது பங்கேற்பாளர் கணக்கெடுப்பு முறையை சோதித்துப் பார்க்கும் ஒருவர் என்பதை நாம் அறிந்திருக்கலாம், சரியான பங்கேற்பாளர் அல்ல (`` பல் வளர்ச்சி`` உண்மையில் கினிப் பன்றி பற்களின் நீளத்தைப் பற்றியது, எனவே 9 வது பங்கேற்பாளர் ஒரு முயல் என்பதை நாம் அறிந்திருக்கலாம்). சூத்திரத்துடன் அவற்றை நாம் வெறுமனே விலக்க முடியும்:

source: In this expression the ``!=`` means ‘does not equal’. If you’ve ever used a programming language like R this should be very familiar. Filters in jamovi exclude the rows for which the formula is not true. in this case, the expression ``ROW() != 9`` is true for all rows except the 9th row. When we apply this filter, the tick in the ``Filter 1`` column of the 9th row changes to a cross, and the whole row greys out. If we were to run an analysis now, it would run as though the 9th row wasn’t there. Similarly, if we already had run some analyses, they would re-run and the results would update to values not using the 9th row.
de: In diesem Ausdruck bedeutet das ``!=`` „nicht gleich“. Wenn Sie jemals eine Programmiersprache wie R verwendet haben, sollte Ihnen das vertraut sein. Filter in jamovi schließen die Zeilen aus, für welche die Formel nicht wahr ist. In diesem Fall ist der Ausdruck ``ROW() != 9`` für alle Zeilen wahr, außer für die 9. Wenn wir diesen Filter anwenden, wird das Häkchen in der Spalte ``Filter 1`` der 9. Zeile zu einem Kreuz und die gesamte Zeile wird grau. Wenn wir jetzt eine Analyse durchführen würden, würde sie so ablaufen, als ob die 9. Zeile nicht vorhanden wäre. Ähnlich verhält es sich, wenn wir bereits einige Analysen durchgeführt haben: Sie werden erneut ausgeführt und die Ergebnisse werden auf Werte aktualisiert, die sich ergäben würden, wenn die 9. Zeile nicht verwendet würde.
ja: この式における ``!=`` は「等しくない」という意味です。Rのようなプログラミング言語を使ったことがあれば、とても馴染みがあるはずです。jamoviのフィルターは、数式が真でない行を除外します。今回の場合、``ROW() != 9`` という式は9行目以外のすべての行で真となります。このフィルターを適用すると、「フィルタ1」列の9行目のチェックマークが×印に変わり、その行全体がグレー表示になります。今分析を実行すると、9行目が存在しないかのように処理されます。同様に、すでに何らかの分析を実行していた場合も、フィルター適用後は9行目を除いた値で再計算され、結果が更新されます。
nb: I dette uttrykket betyr ``!=`` «does not equal». Hvis du noen gang har brukt et programmeringsspråk som R, bør dette være kjent. Filtre i jamovi ekskluderer radene som formelen ikke er sann for. I dette tilfellet er uttrykket ``ROW() != 9`` sant for alle rader unntatt den niende raden. Når vi bruker dette filteret, endres krysset i kolonnen ``Filter 1`` i den niende raden til et kryss, og hele raden blir grå. Hvis vi skulle kjøre en analyse nå, ville den kjøres som om den niende raden ikke var der. På samme måte, hvis vi allerede hadde kjørt noen analyser, ville de kjøres på nytt, og resultatene ville oppdateres til verdier som ikke bruker den niende raden.
ta: இந்த வெளிப்பாட்டில் ``! = `` என்றால் ‘சமமில்லை’. நீங்கள் எப்போதாவது ஒரு நிரலாக்க மொழியைப் பயன்படுத்தினால், இது மிகவும் பழக்கமாக இருக்க வேண்டும். சாமோவியில் உள்ள வடிப்பான்கள் தேற்றம் உண்மையில்லாத வரிசைகளை விலக்குகின்றன. இந்த வழக்கில், 9 வது வரிசையைத் தவிர அனைத்து வரிசைகளுக்கும் `` வரிசை ()! = 9`` வெளிப்பாடு உண்மை. இந்த வடிப்பானை நாங்கள் பயன்படுத்தும்போது, 9 வது வரிசையின் `` வடிகட்டி 1`` நெடுவரிசையில் உள்ள டிக் ஒரு சிலுவையாக மாறுகிறது, மேலும் முழு வரிசையும் வெளியேறுகிறது. நாங்கள் இப்போது ஒரு பகுப்பாய்வை இயக்கினால், அது 9 வது வரிசை இல்லாதது போல் இயங்கும். இதேபோல், நாங்கள் ஏற்கனவே சில பகுப்பாய்வுகளை இயக்கியிருந்தால், அவை மீண்டும் இயங்கும், முடிவுகள் 9 வது வரிசையைப் பயன்படுத்தாத மதிப்புகளுக்கு புதுப்பிக்கப்படும்.

source: Typically, we would like to have more complex filters than this! The ``Tooth Growth`` example contains the length of teeth from guinea pigs (the ``len`` column) fed different dosages (the ``dose`` column) of supplements: vitamin C or orange juice (recorded in the ``supp`` column as ``VC`` and ``OJ``). Let’s assume that we’re interested in the effect of dosage on tooth length. We might run an ANOVA with ``len`` as the dependent variable, and ``dose`` as the grouping variable. But let’s say that we’re only interested in the effects of vitamin C, and not of orange juice. Then, we can use the formula:
de: Normalerweise hätten wir gerne komplexere Filter als diese! Das Beispiel ``Tooth Growth`` enthält die Länge der Zähne von Meerschweinchen (in der Spalte ``len``), die mit verschiedenen Dosierungen (Spalte ``dose``) von Nahrungsergänzungsmitteln gefüttert wurden: Vitamin C oder Orangensaft (aufgezeichnet in der Spalte ``supp`` als ``VC`` und ``OJ``). Nehmen wir an, dass wir an der Wirkung der Dosierung auf die Zahnlänge interessiert sind. Wir könnten eine ANOVA mit ``len`` als abhängige Variable und ``dose`` als gruppierende Variable durchführen. Aber nehmen wir an, dass wir nur an den Auswirkungen von Vitamin C interessiert sind und nicht an denen von Orangensaft. Dann können wir die folgende Formel verwenden:
ja: 通常は、これよりも複雑なフィルタを使いたい場合が多いでしょう。 ``Tooth Growth`` の例には、モルモットにビタミンCまたはオレンジジュース（ ``supp`` 列で ``VC`` または ``OJ`` として記録）というサプリメントを、異なる用量（ ``dose`` 列）で与えたときの歯の長さ（ ``len`` 列）のデータが含まれています。ここで、用量が歯の長さに与える影響に興味があると仮定します。その場合、従属変数を ``len`` 、グループ変数を ``dose`` としてANOVAを行うことになるでしょう。しかし、ビタミンCの効果だけに関心があり、オレンジジュースの効果には関心がない場合、次の数式を使うことができます。
nb: Vanligvis vil vi gjerne ha mer komplekse filtre enn dette! Eksempelet ``Tooth Growth`` inneholder lengden på tenner fra marsvin (kolonnen ``len``) som har fått ulike doser (kolonnen ``dose``) av kosttilskudd (registrert i kolonnen ``supp`` som C-vitamin: ``VC`` eller appelsinjuice: ``OJ``). La oss anta at vi er interessert i effekten av dosering på tannlengden. Vi kan kjøre en ANOVA med ``len`` som avhengig variabel, og ``dose`` som grupperingsvariabel. Men la oss si at vi bare er interessert i effekten av vitamin C, og ikke av appelsinjuice. Da kan vi bruke formelen:
ta: பொதுவாக, இதை விட சிக்கலான வடிப்பான்களை நாங்கள் விரும்புகிறோம்! `` பல் வளர்ச்சி`` எடுத்துக்காட்டில் கினிப் பன்றிகளிடமிருந்து பற்களின் நீளத்தை (`` லென்` நெடுவரிசை) கொண்டுள்ளது `supp`` நெடுவரிசை` `vc`` மற்றும்` `oj``). பல் நீளத்தில் அளவின் தாக்கத்தில் நாங்கள் ஆர்வமாக உள்ளோம் என்று வைத்துக் கொள்வோம். நாம் ஒரு ANOVA ஐ `` len`` உடன் சார்பு மாறியாக இயக்கலாம், மேலும் `` டோச்`` `` டோச்``. ஆனால் வைட்டமின் சி இன் விளைவுகளில் மட்டுமே நாங்கள் ஆர்வமாக உள்ளோம், ஆரஞ்சு சாற்றில் அல்ல என்று சொல்லலாம். பின்னர், நாம் சூத்திரத்தைப் பயன்படுத்தலாம்:
