Repository: sjentsch/jamoviDocs-i18n
Catalog: */LC_MESSAGES/usermanual.po
Languages: de, ja, nb, ta

source: In order, these are the sum of A and B, a log (base 10) transform of ``len``, the mean of ``A`` and ``B``, and the z-score of ``dose`` (twice).
de: In dieser Reihenfolge sind das die Summe von A und B, eine logarithmische Transformation (zur Basis 10) von ``len``, der Mittelwert von ``A`` und ``B``, und der z-Score von ``dose`` (mit zwei unterschiedlichen Berechnungsmethoden).
ja: これらは順に、AとBの合計、 ``len`` の常用対数変換、 ``A`` と ``B`` の平均、そして ``dose`` のzスコア（2とおりの計算方法）です。
nb: I rekkefølge er disse summen av A og B, en logaritmisk transformasjon (med basis 10) av ``len``, gjennomsnittet av ``A`` og ``B``, og z-transformasjon for ``dose`` (med to forskjellige beregningsmåter).
ta: வரிசையில், இவை A மற்றும் B இன் தொகை, `` len``, `` a` மற்றும் `` b`` ஆகியவற்றின் சராசரி (அடிப்படை 10) உருமாற்றம், மற்றும் `` டோசின் z- மதிப்பெண் `` (இரண்டு முறை).

source: There are many more functions available.
de: Darüber hinaus sind viele weitere Funktionen verfügbar.
ja: これ以外にもたくさんの関数が利用可能です。
nb: Det er mange flere funksjoner tilgjengelig.
ta: இன்னும் பல செயல்பாடுகள் உள்ளன.

source: ``V``-functions
de: ``V``-Funktionen
ja: ``V`` 関数
nb: ``V``-funksjoner
ta: `` V`` செயல்பாடுகள்

source: A number of functions appear in pairs, one prefixed with a ``V`` and the other not. ``V`` functions perform their calculation on a variable *as a whole*, where as non-``V`` functions perform their calculation row by row. For example, ``MEAN(A, B)`` will produce the mean of ``A`` and ``B`` for each row. Whereas ``VMEAN(A)`` gives the mean of *all* the values in ``A``.
de: Von einer Reihe von Funktionen gibt es Paare, wobei dem einen Teil des Paares ein ``V`` vorangestellt ist und dem anderen nicht. ``V``-Funktionen führen ihre Berechnung auf einer Variablen *als Ganzes* durch (spaltenweise), während Funktionen ohne ``V`` ihre Berechnung zeilenweise durchführen. Zum Beispiel wird ``MEAN(A, B)`` den Mittelwert von ``A`` und ``B`` für jede Zeile erzeugen. Während ``VMEAN(A)`` den Mittelwert von *allen* Werten der Variable ``A`` liefert.
ja: いくつかの関数はペアになっており、一方には ``V`` が頭につき、もう一方にはつきません。 ``V`` 付きの関数は、変数全体に対して計算を行い、 ``V`` なしの関数は行ごとに計算を行います。たとえば、 ``MEAN(A, B)`` は各行ごとに ``A`` と ``B`` の平均を計算しますが、 ``VMEAN(A)`` は ``A`` 全体の値の平均を返します。
nb: En rekke funksjoner kommer i par, den ene prefikset med en ``V`` og den andre ikke. ``V``-funksjoner utfører sin beregning på en variabel *som en helhet*, mens ikke-``V``-funksjoner utfører sin beregning rad for rad. For eksempel vil ``MEAN(A, B)`` produsere gjennomsnittet av ``A`` og ``B`` for hver rad mens ``VMEAN(A)`` gir gjennomsnittet av *alle* verdiene i ``A``.
ta: பல செயல்பாடுகள் சோடிகளாகத் தோன்றும், ஒன்று `` v`` உடன் முன்னொட்டு, மற்றொன்று இல்லை. `` V`` செயல்பாடுகள் அவற்றின் கணக்கீட்டை ஒரு மாறியில் *ஒட்டுமொத்தமாக *செய்கின்றன, அங்கு ``v`` செயல்பாடுகள் அவற்றின் கணக்கீட்டு வரிசையை வரிசையில் செய்கின்றன. எடுத்துக்காட்டாக, `` சராசரி (அ, பி) `` ஒவ்வொரு வரிசையிலும் `` அ` மற்றும் `பி`` ஆகியவற்றின் சராசரியை உருவாக்கும். அதேசமயம் `` vmean (a) `` அனைத்து * மதிப்புகளின் சராசரியையும் `` a`` தருகிறது.

source: Additionally ``V`` functions support a ``group_by`` argument. When a ``group_by`` variable is specified, a separate value is calculated for each level of the ``group_by`` variable. In the following example:
de: Zusätzlich unterstützen ``V``-Funktionen ein ``group_by``-Argument. Wenn eine ``group_by``-Variable angegeben wird, dann wird für jede Ebene der ``group_by``-Variable ein separater Wert berechnet. Im folgenden Beispiel:
ja: さらに、 ``V`` 関数は ``group_by`` 引数をサポートしています。 ``group_by`` 変数を指定すると、その変数の各水準ごとに個別の値が計算されます。次の例を見てください。
nb: I tillegg støtter ``V``-funksjoner et ``group_by``-argument. Når en ``group_by``-variabel er spesifisert, beregnes det en separat verdi for hvert nivå av ``group_by``-variabelen. I følgende eksempel:
ta: கூடுதலாக `` வி`` செயல்பாடுகள் ஒரு `` குழு_பிபி`` வாதத்தை ஆதரிக்கின்றன. ஒரு `` குழு_பிபி`` மாறி குறிப்பிடப்படும்போது, `` குழு_பிபி`` மாறியின் ஒவ்வொரு நிலைக்கும் ஒரு தனி மதிப்பு கணக்கிடப்படுகிறது. பின்வரும் எடுத்துக்காட்டில்:

source: A separate mean is calculated for each level of ``dose``, and each value in the computed variable will be the mean corresponding to it’s row’s value of ``dose``.
de: Mit dieser Funktion wird ein separater Mittelwert für jede Stufe von ``dose`` berechnet, und jeder Wert in der berechneten Variable ist der Mittelwert, der dem Wert von ``dose`` in der jeweiligen Zeile entspricht.
ja: この例では、 ``dose`` の各水準ごとに個別の平均値が計算され、計算変数の各値は、その行の ``dose`` の値に対応する平均値となります。
nb: Et separat gjennomsnitt beregnes for hvert nivå av ``dose``, og hver verdi i den beregnede variabelen vil være gjennomsnittet som tilsvarer radens verdi av ``dose``.
ta: `` டோச்`` இன் ஒவ்வொரு மட்டத்திற்கும் ஒரு தனி சராசரி கணக்கிடப்படுகிறது, மேலும் கணக்கிடப்பட்ட மாறியில் உள்ள ஒவ்வொரு மதிப்பும் அதன் வரிசையின் மதிப்புக்கு ஒத்த சராசரி `` டோச்``.

source: Transformed (Recoded) Variables
de: Transformierte (umkodierte) Variablen
ja: 変換（再コード化）変数
nb: Transformerte (omkoderte) variabler
ta: மாற்றப்பட்ட (மறுவடிவமைப்பு) மாறிகள்

source: While computed variables are great for a lot of operations (e.g., calculating sum scores, generating data, etc.), they can be a bit tedious to use when you want to recode or transform multiple variables (e.g., when reverse-scoring multiple responses in a survey data set). “Transformed variables” allow you to easily recode existing variables and apply transforms across many variables at once.
de: Während sich berechnete Variablen für viele Operationen eignen (z. B. Berechnung von Summenwerten, Generierung von Daten usw.), kann es etwas mühsam sein, wenn Sie mehrere Variablen neu kodieren oder transformieren möchten (z. B. beim Invertieren von Items in einem Umfragedatensatz). Mit „transformierten Variablen“ können Sie vorhandene Variablen einfach umkodieren und Transformationen auf viele Variablen gleichzeitig anwenden.
ja: 計算変数は、合計スコアの計算やデータ生成など、多くの操作にとても便利です。しかし、複数の変数をコード化し直したり変換したりしたい場合（たとえば、アンケートのデータセットで複数の回答を逆点化する場合など）には、やや面倒になることがあります。「変換変数」を使うと、既存の変数を簡単にコード化し直したり、多くの変数に一度に変換を適用したりできます。
nb: Selv om beregnede variabler er gode for mange operasjoner (f.eks. beregning av sumskårer, generering av data osv.), kan de være litt tungvinte å bruke når du vil omkode eller transformere flere variabler (f.eks. ved omvendt skåring av flere svar i et undersøkelsesdatasett). Med "transformerte variabler" kan du enkelt omkode eksisterende variabler og bruke den samme transformasjonen på mange variabler samtidig.
ta: கணக்கிடப்பட்ட மாறிகள் நிறைய செயல்பாடுகளுக்கு சிறந்தவை என்றாலும் (எ.கா., தொகை மதிப்பெண்களைக் கணக்கிடுதல், தரவை உருவாக்குதல் போன்றவை), நீங்கள் பல மாறிகளை மறுசீரமைக்கவோ அல்லது மாற்றவோ விரும்பும்போது பயன்படுத்த சற்று சிரமமாக இருக்கும் (எ.கா., பல பதில்களை தலைகீழாக மாற்றும் போது ஒரு கணக்கெடுப்பு தரவு தொகுப்பில்). “மாற்றப்பட்ட மாறிகள்” ஏற்கனவே இருக்கும் மாறிகளை எளிதில் மீண்டும் வரையவும், ஒரே நேரத்தில் பல மாறிகள் முழுவதும் மாற்றங்களைப் பயன்படுத்தவும் உங்களை அனுமதிக்கிறது.

source: **Creating transformed variables**
de: **Erstellen von transformierten Variablen**
ja: **変換変数の作成**
nb: **Lage transformerte variabler**
ta: ** மாற்றப்பட்ட மாறிகளை உருவாக்குதல் **

source: When transforming or recoding variables in jamovi, a second “transformed variable” is created for the original “source variable”. This way, you will always have access to the original, untransformed data if need be. To transform a variable, first select the column(s) you would like to transform. You can select a block of columns by clicking on the first column header in the block and then clicking on the last column header in the block while holding the shift key. Alternatively, you can select / deselect individual columns by clicking on the column headers while holding down the Ctrl / Cmd key. Once selected, you can either select ``Transform`` from the data tab, or right click and choose ``Transform`` from the menu.
de: Beim Transformieren oder Umkodieren von Variablen in jamovi wird eine „transformierte Variable“ für die ursprüngliche „Quellvariable“ erstellt. Auf diese Weise haben Sie bei Bedarf immer Zugriff auf die ursprünglichen, untransformierten Daten. Um eine Variable zu transformieren, wählen Sie zunächst die Variable(n) aus, die Sie transformieren möchten. Sie können einen Block mit mehreren Variablen auswählen, indem Sie auf die Kopfzeile / Überschrift der ersten Variable des Blocks klicken und dann bei gedrückter ⇧-Taste auf die letzte Überschrift der letzten Variable im Block klicken. Alternativ können Sie einzelne Spalten auswählen bzw. die Auswahl aufheben, indem Sie bei gedrückter Strg- bzw. Befehlstaste auf die Spaltenüberschriften klicken. Nach der Auswahl können Sie entweder ``Transformieren`` in der Registerkarte ``Daten`` auswählen oder mit der rechten Maustaste klicken und ``Transformieren`` aus dem Menü wählen.
ja: jamoviで変数の変換や再コード化を行うと、元の「変換元の変数」に対して2つ目の「変換変数」が作成されます。このため、元の未変換データには必要に応じてつねにアクセスできます。変数を変換するには、まず変換したい列を選択します。列のブロックを選択する場合は、ブロック内の最初の列ヘッダーをクリックし、Shiftキーを押しながら最後の列ヘッダーをクリックします。あるいは、Ctrlキー（Macの場合はCmdキー）を押しながら列ヘッダーをクリックすることで、個別に列を選択・解除することもできます。選択ができたら、データタブから ``変換`` （Transform）を選択するか、右クリックしてメニューから ``変換`` （Transform）を選びます。
nb: Når du transformerer eller omkoder variabler i jamovi, opprettes det en ny «transformert variabel» for den opprinnelige «kildevariabelen». På denne måten vil du alltid ha tilgang til de opprinnelige, ikke-transformerte dataene ved behov. For å transformere en variabel velger du først kolonnen(e) du ønsker å transformere. Du kan velge en blokk med kolonner ved å klikke på den første kolonneoverskriften i blokken og deretter klikke på den siste kolonneoverskriften i blokken mens du holder ⇧-tasten nede. Alternativt kan du velge/oppheve valget av enkeltkolonner ved å klikke på kolonneoverskriftene mens du holder Ctrl-/Cmd-tasten nede. Når du har valgt, kan du enten velge ``Transform`` fra datafanen, eller høyreklikke og velge ``Transform`` fra menyen.
ta: சாமோவியில் மாறிகளை மாற்றும்போது அல்லது மறுசீரமைக்கும்போது, அசல் “மூல மாறி” க்கு இரண்டாவது “மாற்றப்பட்ட மாறி” உருவாக்கப்படுகிறது. இந்த வழியில், தேவைப்பட்டால் அசல், மாற்றப்படாத தரவை நீங்கள் எப்போதும் அணுகுவீர்கள். மாறியை மாற்ற, முதலில் நீங்கள் மாற்ற விரும்பும் நெடுவரிசையை (களை) தேர்ந்தெடுக்கவும். தொகுதியில் முதல் நெடுவரிசை தலைப்பைக் சொடுக்கு செய்து, சிப்ட் விசையை வைத்திருக்கும் போது தொகுதியில் கடைசி நெடுவரிசை தலைப்பைக் சொடுக்கு செய்வதன் மூலம் நெடுவரிசைகளின் தொகுதியைத் தேர்ந்தெடுக்கலாம். மாற்றாக, கட்டுப்பாடு / CMD விசையை கீழே வைத்திருக்கும் போது நெடுவரிசை தலைப்புகளைக் சொடுக்கு செய்வதன் மூலம் தனிப்பட்ட நெடுவரிசைகளைத் தேர்ந்தெடுக்கலாம் / தேர்வு செய்யலாம். தேர்ந்தெடுக்கப்பட்டதும், தரவு தாவலில் இருந்து `` உருமாற்றம்` என்பதைத் தேர்ந்தெடுத்து அல்லது வலது சொடுக்கு செய்து மெனுவிலிருந்து `` உருமாற்றம்` என்பதைத் தேர்வு செய்யலாம்.

source: Either right-click on one of the selected variables, and click ``Transform...``:
de: Klicken Sie entweder mit der rechten Maustaste auf eine der ausgewählten Variablen, und klicken Sie auf ``Transformieren...``:
ja: 選択した変数のいずれかを右クリックし、``変換`` （Transform）をクリックします。
nb: Høyreklikk enten på en av de valgte variablene, og klikk på ``Transform...``:
ta: தேர்ந்தெடுக்கப்பட்ட மாறிகளில் ஒன்றில் வலது சொடுக்கு செய்து, `` உருமாற்றம் ... ``:

source: or head to the ``Data``-ribbon, and click ``Transform:``
de: oder gehen Sie zur Registerkarte ``Daten`` und klicken Sie auf ``Transformieren``
ja: あるいは ``データ`` （Data ）リボンの ``変換`` （Transform）をクリックします。
nb: eller gå til ``Data``-båndet, og klikk på ``Transformer``
ta: அல்லது `` தரவு``-ரிப்பனுக்குச் சென்று, `` உருமாற்றம்: `` என்பதைக் சொடுக்கு செய்க

source: This constructs a second “transformed variable” for each column that was selected. In the following example, we only had a single variable selected, so we’re only setting up the transform for one variable (called score - log), but there’s no reason we can’t do more in one go.
de: Dadurch wird für jede ausgewählte Spalte eine zweite „transformierte Variable“ erstellt. Im folgenden Beispiel wurde nur eine einzige Variable ausgewählt, so dass wir die Transformation nur für eine Variable (mit dem Namen score - log) einrichten, aber es gibt keinen Grund, warum wir nicht mehrere Variablen in einem Durchgang transformieren können.
ja: これにより、選択した各列に対して2つ目の「変換変数」が作成されます。次の例では、変数を1つだけ選択したため、1つの変数（score - log）の変換だけ設定していますが、一度に複数の変数を変換することも可能です。
nb: Dette konstruerer en ny «transformert variabel» for hver kolonne som ble valgt. I det følgende eksempelet hadde vi bare valgt én variabel, så vi setter bare opp transformasjonen for én variabel (kalt score - log), men det er ingen grunn til at vi ikke kan gjøre mer på én gang.
ta: இது தேர்ந்தெடுக்கப்பட்ட ஒவ்வொரு நெடுவரிசைக்கும் இரண்டாவது “மாற்றப்பட்ட மாறி” ஐ உருவாக்குகிறது. பின்வரும் எடுத்துக்காட்டில், எங்களிடம் ஒற்றை மாறி மட்டுமே தேர்ந்தெடுக்கப்பட்டது, எனவே நாங்கள் ஒரு மாறிக்கு (மதிப்பெண் - பதிவு என அழைக்கப்படுபவை) மாற்றத்தை மட்டுமே அமைக்கிறோம், ஆனால் ஒரே நேரத்தில் எங்களால் அதிகம் செய்ய முடியாது என்பதற்கு எந்த காரணமும் இல்லை.

source: As can be seen in the figure above, each transformed variable has a “source variable”, representing the original untransformed variable, and a transform, representing rules to transform the source variable into the transformed variable. After a transform has been created, it’s available from the list and can be shared easily across multiple transformed variables.
de: Wie in der obigen Abbildung zu sehen ist, hat jede transformierte Variable eine „Quellvariable“, welche die ursprüngliche, nicht transformierte Variable repräsentiert, und eine Transformation, welche die Regeln zur Umwandlung der Quellvariable in die transformierte Variable enthält. Nachdem eine Transformation erstellt wurde, steht sie in der Liste zur Verfügung und kann problemlos wiederverwendet werden, um andere Variablen zu transformieren.
ja: 上の図に示されているように、各変換変数には「変換元の変数」があり、これは元の未変換の変数を表しています。また、「変換」は、変換元の変数を変換変数に変換するためのルールを表します。一度変換を作成すると、その変換はリストに保存され、複数の変換変数間で簡単に共有できます。
nb: Som det fremgår av figuren ovenfor, har hver transformerte variabel en «kildevariabel», som representerer den opprinnelige, ikke-transformerte variabelen, og en transformasjon, som representerer regler for å transformere kildevariabelen til den transformerte variabelen. Etter at en transformasjon er opprettet, er den tilgjengelig fra listen og kan enkelt gjenbrukes for andre transformerte variabler.
ta: மேலே உள்ள படத்தில் காணப்படுவது போல, ஒவ்வொரு மாற்றப்பட்ட மாறியும் ஒரு “மூல மாறி” உள்ளது, இது அசல் மாற்றப்படாத மாறியைக் குறிக்கிறது, மற்றும் ஒரு உருமாற்றம், மூல மாறியை மாற்றப்பட்ட மாறியாக மாற்றுவதற்கான விதிகளைக் குறிக்கிறது. ஒரு உருமாற்றம் உருவாக்கப்பட்ட பிறகு, இது பட்டியலிலிருந்து கிடைக்கிறது, மேலும் பல மாற்றப்பட்ட மாறிகள் முழுவதும் எளிதாகப் பகிரலாம்.

source: If you don’t yet have the appropriate transform defined, you can select ``Create new transform...`` from the list.
de: Wenn Sie die entsprechende Transformation noch nicht definiert haben, können Sie ``Neue Transformation erstellen...`` aus der Liste auswählen.
ja: まだ適切な変換が定義されていない場合は、リストから ``変換を新規作成...`` （Create new transform...）を選択できます。
nb: Hvis du ikke ennå har definert den aktuelle transformasjonen, kan du velge ``Lag en ny transformasjon...`` fra listen.
ta: உங்களிடம் இன்னும் பொருத்தமான உருமாற்றம் வரையறுக்கப்படவில்லை என்றால், நீங்கள் புதிய உருமாற்றத்தை உருவாக்குங்கள் ... `` பட்டியலிலிருந்து தேர்ந்தெடுக்கலாம்.

source: **Create a new transformation**
de: **Eine neue Transformation erstellen**
ja: **変換の新規作成**
nb: **Lag en ny transformasjon**
ta: ** ஒரு புதிய மாற்றத்தை உருவாக்கவும் **

source: After clicking ``Create new transform...`` the transform editor slides into view:
de: Durch einen Klick auf ``Neue Transformation erstellen...`` wird der Transformationseditor eingeblendet:
ja: ``変換を新規作成...`` をクリックすると、変換エディタが画面にスライド表示されます。
nb: Etter å ha klikket på ``Lag en ny transformasjon...`` åpner seg transformasjonseditoren i visningen:
ta: `` புதிய உருமாற்றத்தை உருவாக்குங்கள் ... `` டிரான்ச்ஃபார்ம் எடிட்டர் பார்வைக்கு சறுக்குகிறது:

source: The transform editor contains these elements.
de: Der Transformationseditor enthält diese Elemente.
ja: 変換エディタには、これらの要素が含まれています。
nb: Transformasjonseditoren inneholder disse elementene.
ta: உருமாற்ற எடிட்டரில் இந்த கூறுகள் உள்ளன.

source: *Name*: The name for the transformation.
de: *Name*: Der Name für die Transformation.
ja: *変換名* ：変換の名前。
nb: *Navn*: Navnet på transformasjonen.
ta: *பெயர்*: மாற்றத்திற்கான பெயர்.

source: *Description*: Space for you to provide a description of the transformation so you (and others) know what it does.
de: *Beschreibung*: Hier können Sie eine Beschreibung der Transformation angeben, damit Sie (und andere) wissen, was sie bewirkt.
ja: *説明* （Description）：変換の内容が分かるように、あなた自身や他の人のために説明を記入するスペースです。
nb: *Beskrivelse*: Her kan du gi en beskrivelse av transformasjonen, slik at du (og andre) vet hva den gjør.
ta: *விளக்கம்*: மாற்றத்தின் விளக்கத்தை நீங்கள் வழங்குவதற்கான இடம், எனவே அது என்ன செய்கிறது என்பதை நீங்கள் (மற்றவர்கள்) அறிவீர்கள்.

source: *Variable suffix* (optional): Here, you can define the default name formatting for the transformed variable. By default, the variable suffix will be appended to the source variable name with a dash (-) in between. However, you can override this behavior by using an three dots (...), which will be replaced by the variable name. For instance, if you transform a variable called Q1, you could use variable suffixes to apply the following naming schemes (if left empty, the transformation name is used as the variable suffix):
de: *Variablensuffix* (optional): Hier können Sie die Standard-Namensformatierung für die transformierte Variable festlegen. Standardmäßig wird das Variablensuffix an den Namen der Quellvariablen angehängt, mit einem Bindestrich (-) dazwischen. Sie können dieses Verhalten jedoch außer Kraft setzen, indem Sie drei Punkte (...) verwenden, die dann durch den Variablennamen ersetzt werden. Wenn Sie beispielsweise eine Variable mit dem Namen Q1 transformieren, können Sie Variablensuffixe verwenden, um die folgenden Benennungsschemata anzuwenden (wenn Sie nichts eingeben, wird der Transformationsname als Variablensuffix verwendet):
ja: *変数の接尾辞* （Variable suffix）（省略可）：ここでは、変換変数のデフォルトの命名形式を定義できます。デフォルトでは、変数接尾辞が変換元変数名の後ろにダッシュ（-）で区切って付加されます。しかし、三点リーダ（...）を使うことでこの動作を上書きできます。たとえば、Q1という変数を変換する場合、変数接尾辞を使って次のような命名規則を適用できます（空欄のままにすると、変換名が変数の接尾辞として使われます）。
nb: *Variabelsuffiks* (valgfritt): Her kan du definere standard navneformatering for den transformerte variabelen. Som standard blir variabelsuffikset lagt til kildevariabelnavnet med en bindestrek (-) mellom. Du kan imidlertid overstyre dette ved å bruke tre prikker (...), som da erstattes av variabelnavnet. Hvis du for eksempel transformerer en variabel som heter Q1, kan du bruke variabelsuffikser til å bruke følgende navngivningsskjemaer (hvis du lar det stå tomt, brukes transformasjonsnavnet som variabelsuffiks):
ta: * மாறி பின்னொட்டு* (விரும்பினால்): இங்கே, மாற்றப்பட்ட மாறிக்கான இயல்புநிலை பெயர் வடிவமைப்பை நீங்கள் வரையறுக்கலாம். இயல்பாக, மாறி பின்னொட்டு மூல மாறி பெயருடன் இடையில் ஒரு கோடு (-) உடன் சேர்க்கப்படும். இருப்பினும், மூன்று புள்ளிகளை (...) பயன்படுத்துவதன் மூலம் இந்த நடத்தையை நீங்கள் மேலெழுதலாம், இது மாறி பெயரால் மாற்றப்படும். உதாரணமாக, நீங்கள் Q1 எனப்படும் மாறியை மாற்றினால், பின்வரும் பெயரிடும் திட்டங்களைப் பயன்படுத்த மாறி பின்னொட்டுகளைப் பயன்படுத்தலாம் (காலியாக இருந்தால், உருமாற்ற பெயர் மாறி பின்னொட்டாகப் பயன்படுத்தப்படுகிறது):

source: *Transformation*: This section contains the rules and formulas for the transformation. You can use all the same functions that are available in computed variables, and to refer to the values in the source column (so you can transform them), you can use the special ``$source`` keyword. If you want to recode a variable into multiple groups, it’s easiest to use multiple conditions. To add additional conditions (i.e., if-statements), you click on the ``Add recode condition`` button:
de: *Transformation*: Dieser Abschnitt enthält die Regeln und Formeln für die Transformation. Sie können alle Funktionen verwenden, die für berechnete Variablen zur Verfügung stehen. Um auf die Werte in der Ausgangsspalte zu verweisen (damit Sie diese umwandeln können), können Sie das spezielle Schlüsselwort ``$source`` verwenden. Wenn Sie eine Variable in mehrere Gruppen umkodieren wollen, ist es am einfachsten, mehrere Bedingungen zu verwenden. Um zusätzliche Bedingungen (d. h. Wenn-Anweisungen) hinzuzufügen, klicken Sie auf die Schaltfläche ``Umkodierungsbedingung hinzufügen``:
ja: *変換* ：このセクションには、変換のためのルールや数式を記述します。計算変数で利用できるすべての関数を使うことができ、元の列の値を参照して変換を行う場合は、特別な ``$source`` キーワードを使います。変数を複数のグループに再コード化したい場合は、複数の条件を使うのが最も簡単です。追加の条件（つまりif文）を追加するには、 ``変換条件を追加`` （Add recode condition）ボタンをクリックします。
nb: *Transformasjon*: Denne delen inneholder regler og formler for transformasjonen. Du kan bruke alle de samme funksjonene som er tilgjengelige i beregnede variabler, og for å referere til verdiene i kildekolonnen (slik at du kan transformere dem), kan du bruke det spesielle nøkkelordet ``$source``. Hvis du vil omkode en variabel til flere grupper, er det enklest å bruke flere betingelser. For å legge til flere betingelser (dvs. if-betingelser) klikker du på knappen ``Legg til omkodingsbetingelse``:
ta: *மாற்றம்*: இந்த பிரிவில் மாற்றத்திற்கான விதிகள் மற்றும் சூத்திரங்கள் உள்ளன. கணக்கிடப்பட்ட மாறிகளில் கிடைக்கக்கூடிய அனைத்து அதே செயல்பாடுகளையும் நீங்கள் பயன்படுத்தலாம், மேலும் மூல நெடுவரிசையில் உள்ள மதிப்புகளைக் குறிக்க (எனவே அவற்றை மாற்றலாம்), நீங்கள் சிறப்பு `` $ மூல`` முக்கிய சொற்களைப் பயன்படுத்தலாம். நீங்கள் ஒரு மாறியை பல குழுக்களாக மறுபரிசீலனை செய்ய விரும்பினால், பல நிபந்தனைகளைப் பயன்படுத்துவது எளிதானது. கூடுதல் நிபந்தனைகளைச் சேர்க்க (அதாவது, புள்ளிவிவரங்கள்), நீங்கள் `` ரெகோட் நிபந்தனையைச் சேர்க்கவும்` பொத்தானைக் சொடுக்கு செய்க:

source: *Used by*: Indicates how many variables are using this particular transformation. If you click on the number it will list these variables.
de: *Verwendet von*: Zeigt an, wie viele Variablen diese bestimmte Transformation verwenden. Wenn Sie auf die Zahl klicken, werden diese Variablen aufgelistet.
ja: *使用中* （Used by）：この特定の変換を使用している変数の数を示します。数字をクリックすると、それらの変数が一覧表示されます。
nb: *Brukes av*: Angir hvor mange variabler som bruker denne transformasjonen. Hvis du klikker på tallet, får du en liste over disse variablene.
ta: *பயன்படுத்திய*: இந்த குறிப்பிட்ட மாற்றத்தை எத்தனை மாறிகள் பயன்படுத்துகின்றன என்பதைக் குறிக்கிறது. நீங்கள் எண்ணைக் சொடுக்கு செய்தால், அது இந்த மாறிகள் பட்டியலிடும்.

source: *Measure type*: By default the measure type is set to Auto, which will infer the measure type automatically from the transformation. However, if Auto doesn’t infer the measure type correctly, you can override it over here.
de: *Skalenniveau*: Standardmäßig ist das Skalenniveau auf „Auto“ eingestellt, wodurch das Skalenniveau automatisch aus der Transformation abgeleitet wird. Wenn „Auto“ das Skalenniveau jedoch nicht korrekt herleitet, können Sie es hier überschreiben.
ja: *測定値型* （Measure type）：初期設定では、測定値型は「自動」に設定されており、変換内容から自動的に測定値型が推定されます。しかし、自動で正しく測定値型が推定されない場合は、ここで手動で上書きできます。
nb: *Måltype*: Som standard er måltypen satt til Auto, som automatisk bestemmer måltypen fra transformasjonen. Hvis Auto ikke bestemmer måltypen riktig, kan du imidlertid overstyre den her.
ta: *அளவீட்டு வகை*: இயல்பாகவே அளவீட்டு வகை ஆட்டோவாக அமைக்கப்பட்டுள்ளது, இது அளவீட்டு வகையை மாற்றத்திலிருந்து தானாகவே ஊகிக்கும். இருப்பினும், ஆட்டோ அளவீட்டு வகையை சரியாக ஊகிக்கவில்லை என்றால், நீங்கள் அதை இங்கே மேலெழுதலாம்.

source: **Example 1: Reverse scoring of items**
de: **Beispiel 1: Invertieren von Items**
ja: **例1：逆転項目の処理**
nb: **Eksempel 1: Inversjon av spørsmål / items**
ta: ** எடுத்துக்காட்டு 1: உருப்படிகளின் தலைகீழ் மதிப்பெண் **
