Repository: sjentsch/jamoviDocs-i18n
Catalog: */LC_MESSAGES/usermanual.po
Languages: de, ja, nb, ta

source: In the unlikely event that jamovi does not open a file correctly, file an issue (bug report) in the GitHub `issue tracker <https://github.com/jamovi/jamovi/issues>`__.
de: Wenn jamovi eine Datei nicht korrekt öffnet, reichen Sie bitte einen Fehlerbericht in unserem GitHub `issue tracker <https://github.com/jamovi/jamovi/issues>`__ ein. Wir sind bestrebt, unsere Impor-Routinen so robust wie möglich zu machen.
ja: 万が一、jamoviでファイルを正しく開けない場合は、GitHubの `issueトラッカー <https://github.com/jamovi/jamovi/issues>`__ にバグ報告（issue）を提出してください。
nb: I det usannsynlige tilfellet at jamovi ikke åpner en fil riktig, kan du sende inn et problem (feilrapport) i 'issue tracker <https://github.com/jamovi/jamovi/issues>'__ på GitHub.
ta: சாமோவி ஒரு கோப்பை சரியாக திறக்காத சாத்தியமில்லாத நிகழ்வில், கிட்அப்பில் ஒரு சிக்கலை (பிழை அறிக்கை) தாக்கல் செய்யுங்கள் `வெளியீடு டிராக்கர் <https://github.com/jamovi/jamovi/issues> __.

source: Analyses
de: Analysen
ja: 分析
nb: Analyser

source: Analyses can be selected from the ``Analyses`` ribbon along the top. Selecting an analysis will present an “options panel” for that particular analysis, allowing you to assign different variables to different parts of the analysis, and select different options. At the same time, the results for the analysis will appear in the right “results panel”, and will update as you make changes to the options.
de: Analysen können über das ``Analyses``-Ribbon-Menü (oben im jamovi-Fenster) ausgewählt werden. Wenn Sie eine Analyse auswählen, wird ein “Options-Panel” für diese Analyse angezeigt. Dort können Sie Variablen zu den verschiedenen Teilen der Analyse zuweisen (z.B. abhängige Variable) und verschiedene Analyse-Optionen auswählen. Sobald Sie neue Variablen zuweisen oder Analyse-Optionen ändern, werden die Ergebnisse für die Analyse im rechten “Ergebnisbereich” angezeigt oder aktualisiert.
ja: 分析は、画面上部の ``分析`` （Analyses）リボンから選択できます。分析を選択すると、その分析専用の「オプションパネル」が表示され、さまざまな変数を分析の各部分に割り当てたり、さまざまなオプションを選択したりできます。同時に、分析結果が右側の「結果パネル」に表示され、オプションを変更するたびに結果も自動的に更新されます。
nb: Analyser kan velges fra ``Analyser``-ribbon-menyet (øverste linje i jamovi-vinduet). Hvis du velger en analyse, vises et «inngave-panel» for den analysen du har valgt, hvor du kan tilordne forskjellige variabler til forskjellige funksjoner av analysen (f.eks. avhengige variable) og velge forskjellige opsjoner for hvordan analysen bør gjennomføres (f.eks. hvilke forutsetningene for analysen bør testes). Samtidig vil resultatene for analysen vises i høyre «resultatpanel», og vil oppdateres når du gjør endringer i opsjonene.
ta: மேலே உள்ள `` அனலீச்`` நாடாவிலிருந்து பகுப்பாய்வுகளைத் தேர்ந்தெடுக்கலாம். ஒரு பகுப்பாய்வைத் தேர்ந்தெடுப்பது அந்த குறிப்பிட்ட பகுப்பாய்விற்கான “விருப்பங்கள் குழு” ஐ வழங்கும், இது பகுப்பாய்வின் வெவ்வேறு பகுதிகளுக்கு வெவ்வேறு மாறிகளை ஒதுக்க அனுமதிக்கிறது, மேலும் வெவ்வேறு விருப்பங்களைத் தேர்ந்தெடுக்கவும். அதே நேரத்தில், பகுப்பாய்விற்கான முடிவுகள் சரியான “முடிவுகள் குழு” இல் தோன்றும், மேலும் நீங்கள் விருப்பங்களில் மாற்றங்களைச் செய்யும்போது புதுப்பிக்கப்படும்.

source: When you have the analysis set up correctly, you can dismiss the analysis options by clicking the arrow to the top right of the options panel. If you wish to return to these options, you can click on the results that were produced. In this way, you can return to any analysis that you (or say, a colleague) created earlier.
de: Wenn Sie alle erforderlichen Einstellungen für die Analyse vorgenommen haben und einen größeren Teil des jamovi-Fensters für das Anzeigen der Ergebnisse zur Verfügung haben möchten, können Sie die Analyseoptionen durch Klicken auf den Pfeil oben rechts im Optionsfeld ausblenden. Wenn Sie danach Änderungen an den Analyseoptionen vornehmen möchten, können Sie das Panel mit den Analyseoptionen einblenden indem Sie auf die Ergebnisse klicken. Auf diese Weise können Sie Änderungen an Analysen vornehmen, die Sie (oder ein Kollege) zuvor erstellt haben.
ja: 分析の設定が完了したら、オプションパネルの右上にある矢印をクリックすることで、分析オプションを非表示にできます。再びオプションを表示したい場合は、作成された結果をクリックするだけです。このようにして、自分（あるいは同僚）が以前に実施した分析に、いつでも戻って編集できます。
nb: Når du har konfigurert analysen riktig, kan du lukke inngave-panelen for denne analysen ved å klikke pilen øverst til høyre i alternativpanelet. Hvis du ønsker å gå tilbake til inngave-panelen, kan du klikke på resultatene. På denne måten kan du gå tilbake til alle analyser du (eller en kollega) har opprettet tidligere.
ta: நீங்கள் பகுப்பாய்வு சரியாக அமைக்கும்போது, விருப்பங்கள் குழுவின் மேல் வலதுபுறத்தில் அம்புக்குறியைக் சொடுக்கு செய்வதன் மூலம் பகுப்பாய்வு விருப்பங்களை நிராகரிக்கலாம். இந்த விருப்பங்களுக்குத் திரும்ப விரும்பினால், தயாரிக்கப்பட்ட முடிவுகளைக் சொடுக்கு செய்யலாம். இந்த வழியில், நீங்கள் முன்னர் உருவாக்கிய எந்தவொரு பகுப்பாய்விற்கும் (அல்லது ஒரு தம ஊழியர்) திரும்பலாம்.

source: If you decide you no longer need a particular analysis, you can remove it with the results context menu. Right-clicking on the analysis results will bring up a menu, and by selecting ``Analysis``, and then ``Remove``, the analysis can be removed.
de: Wenn Sie eine bestimmte Analyse nicht mehr benötigen, können Sie diese über das Kontextmenü der Analyse im Ergebnis-Panel entfernen. Klicken Sie dafür mit der rechten Maustaste auf die Ergebnisse dieser Analyse und wählen Sie dort ``Analysis`` und dann ``Remove``.
ja: 特定の分析が不要になった場合は、結果のコンテキストメニューからその分析を削除できます。分析結果を右クリックするとメニューが表示されるので、 ``分析`` （Analysis）を選択し、続けて ``削除`` （Remove）を選ぶことで、その分析を削除できます。
nb: Hvis du bestemmer deg for at du ikke lenger trenger en bestemt analyse, kan du fjerne den med hurtigmenyen for resultater. Høyreklikk på analyseresultatene vil få opp en meny, og ved å velge ``Analyse``, og deretter ``Fjern``, kan analysen fjernes.
ta: உங்களுக்கு இனி ஒரு குறிப்பிட்ட பகுப்பாய்வு தேவையில்லை என்று நீங்கள் முடிவு செய்தால், அதை முடிவு சூழல் மெனுவுடன் அகற்றலாம். பகுப்பாய்வு முடிவுகளில் வலது சொடுக்கு செய்வது ஒரு மெனுவைக் கொண்டுவரும், மேலும் `` பகுப்பாய்வு`` என்பதைத் தேர்ந்தெடுப்பதன் மூலம், பின்னர் `` அகற்று``, பகுப்பாய்வை அகற்றலாம்.

source: You can head to the entries under “Analyses” in the menu on the right-hand side for a series of short, non-technical tutorials on how to conduct common statistical procedures in jamovi. The :doc:`introduction <../analyses/jg_overview>` gives an overview over the available analyses, or you can otherwise directly access specific analyses by selecting them from the menu on the right-hand side.
ja: ページ左のメニューにある「分析」の項目に進むと、jamoviでよく使われる統計手法の実施方法について、専門的すぎない簡単なチュートリアルがいくつか用意されています。 :doc:`概要 <../analyses/jg_overview>` には利用可能な分析の概要が説明されていますが、特定の分析をについて知りたい場合は、メニューから該当する分析を選択することもできます。
ta: சாமோவியில் பொதுவான புள்ளிவிவர நடைமுறைகளை எவ்வாறு நடத்துவது என்பது குறித்த குறுகிய, தொழில்நுட்பமற்ற பயிற்சிகளுக்கு வலது புறத்தில் உள்ள பட்டியலில் உள்ள “பகுப்பாய்வுகளின்” கீழ் உள்ளீடுகளுக்கு நீங்கள் செல்லலாம். தி :ref:`அறிமுகம் <../analyses/jg_00_overview>` ிடைக்கக்கூடிய பகுப்பாய்வுகளைப் பற்றிய ஒரு கண்ணோட்டத்தை அளிக்கிறது, அல்லது வலது புறத்தில் உள்ள மெனுவிலிருந்து அவற்றைத் தேர்ந்தெடுப்பதன் மூலம் குறிப்பிட்ட பகுப்பாய்வுகளை நேரடியாக அணுகலாம்.

source: jamovi produces nice APA formatted tables, and attractive plots. It is often useful to be able to copy and paste these, perhaps into a Word document, or into an email to a colleague. To copy results, right click on the object of interest, and from the menu select exactly what you want to copy. The menu allows you to choose to copy, say only the image, or the entire analysis. Selecting copy, copies the content to the clipboard, and can be pasted into the other program in the usual way.
de: jamovi erzeugt Tabellen und Diagramme, die im Einklang mit den Richtlinien des **APA Publication Manual** formatiert sind. Diese lassen sich leicht (per copy-and-paste) in ein Dokument in einer Textverarbeitung oder in eine E-Mail an einen Kollegen kopieren. Hierfür klicken Sie mit der rechten Maustaste auf das gewünschte Objekt und wählen Sie aus dem Menü den Teil der Resultate aus, die Sie kopieren möchten: nur das gewählte Bild / die gewählte Tabelle oder die gesamte Analyse. Wenn Sie "Kopieren" wählen, wird der Inhalt in die Zwischenablage kopiert und kann auf die gewohnte Weise in andere Programme eingefügt werden.
ja: jamoviは、見栄えの良いAPA形式の表やスタイリッシュなグラフを作成します。これらをWord文書や同僚へのメールなどにコピー＆ペーストできれば便利ですね。結果をコピーするには、コピーしたい対象を右クリックし、メニューからコピーしたい内容を選択してください。メニューでは、画像だけをコピーするか、分析全体をコピーするかを選ぶことができます。「コピー」を選択すると内容がクリップボードに保存され、他のプログラムに貼り付けることができます。
nb: jamovi produserer attraktive APA-formaterte tabeller og diagrammer. Å kunne kopiere og lime inn disse, kanskje i et tekstdokument eller i en e-post til en kollega, er ofte svært nyttige. Hvis du vil kopiere resultater, høyreklikker du objektet du er interessert i, og i kontekstmenyen velger du hvilke deler du vil kopiere. Menyen lar deg velge å kopiere, bare et diagram eller hele analysen. Etter du har gjort valg, kopieres det valgte innholdet til utklippstavlen, og det kan limes inn i andre programmer på vanlig måte.
ta: சாமோவி நல்ல APA வடிவமைக்கப்பட்ட அட்டவணைகள் மற்றும் கவர்ச்சிகரமான அடுக்குகளை உருவாக்குகிறார். இவற்றை ஒரு சொல் ஆவணமாக அல்லது தம ஊழியருக்கு மின்னஞ்சலில் நகலெடுத்து ஒட்டுவது பெரும்பாலும் பயனுள்ளதாக இருக்கும். முடிவுகளை நகலெடுக்க, ஆர்வமுள்ள பொருளை வலது சொடுக்கு செய்து, மெனுவிலிருந்து நீங்கள் நகலெடுக்க விரும்புவதைத் தேர்ந்தெடுக்கவும். பட்டியல் உங்களை நகலெடுக்கவும், படத்தை மட்டும் சொல்லவோ அல்லது முழு பகுப்பாய்விலோ தேர்வு செய்ய அனுமதிக்கிறது. நகலைத் தேர்ந்தெடுப்பது, உள்ளடக்கத்தை இடைநிலைப்பலகைக்கு நகலெடுக்கிறது, மேலும் வழக்கமான வழியில் மற்ற நிரலில் ஒட்டலாம்.

source: The Spreadsheet
de: Die Datentabelle
ja: スプレッドシート
nb: Regnearket
ta: விரிதாள்

source: In jamovi, data is represented in a spreadsheet, with each column representing a “variable”.
de: In jamovi werden die Daten in einer Tabelle dargestellt, in der jede Spalte eine „Variable“ darstellt.
ja: jamoviでは、データはスプレッドシートで表現されており、各列が「変数」を表しています。
nb: I jamovi representeres data i et regneark, der hver kolonne representerer en «variabel».
ta: சாமோவியில், தரவு ஒரு விரிதாளில் குறிப்பிடப்படுகிறது, ஒவ்வொரு நெடுவரிசையும் “மாறி” என்பதைக் குறிக்கும்.

source: Data Variables
de: Datenvariablen
ja: データ変数
nb: Datavariabler
ta: தரவு மாறிகள்

source: The most commonly used variables in jamovi are “Data Variables”, these variables simply contain data either loaded from a data file, or “typed in” by the user. Data variables can be one three data types:
de: Die am häufigsten verwendeten Variablen in jamovi sind „Datenvariablen“. Diese Variablen enthalten Daten, die entweder aus einer Datendatei geladen oder vom Benutzer „eingetippt“ wurden. Datenvariablen können einer der drei folgenden Datentypen sein:
ja: jamoviで最も一般的に使われる変数は「データ変数」です。この変数は、データファイルから読み込んだデータや、ユーザーが直接入力したデータです。データ変数は、次の3つのデータ型のいずれかになります。
nb: De mest brukte variablene i jamovi er «Datavariabler». Disse variablene inneholder data som enten lastes inn fra en datafil, eller «skrevet inn» av brukeren. Datavariabler kan være én av tre datatyper:
ta: சாமோவியில் பொதுவாகப் பயன்படுத்தப்படும் மாறிகள் “தரவு மாறிகள்” ஆகும், இந்த மாறிகள் தரவுக் கோப்பிலிருந்து ஏற்றப்பட்ட தரவைக் கொண்டிருக்கின்றன, அல்லது பயனரால் “தட்டச்சு செய்யப்பட்டுள்ளன”. தரவு மாறிகள் ஒரு மூன்று தரவு வகைகளாக இருக்கலாம்:

source: ``Integer``
ja: ``整数``
ta: `` முழு எண்``

source: ``Decimal``
ja: ``小数``
ta: `` தசம``

source: ``Text``
ja: ``文字``
ta: `` உரை``

source: and one of four measure types:
de: und eines von vier Skalenniveaus:
ja: また、測定値型は次の4つです。
nb: og en av fire målenivåer:
ta: மற்றும் நான்கு அளவீட்டு வகைகளில் ஒன்று:

source: |nominal| ``Nominal``
ja: |nominal| ``名義``

source: |ordinal| ``Ordinal``
ja: |ordinal| ``順序``

source: |continuous| ``Continuous``
ja: |continuous| ``連続``

source: The measure types are designated by the symbol in the header of the variable’s column. Note that some combinations of data-type and measure-type don’t make sense, and jamovi won’t let you choose these.
de: Die Skalenniveaus werden durch das Symbol in der Kopfzeile der Variablenspalte angezeigt. Beachten Sie, dass einige Kombinationen von Datentyp und Skalenniveau nicht als Kombination auftreten können / sollten und das jamovi Sie solche Kombinationen nicht wählen lässt.
ja: 各変数列のヘッダーには、測定値型が記号で示されます。なお、データ型と測定値型の組み合わせによっては意味をなさないものもあり、jamoviではそのような組み合わせは選択できません。
nb: Målenivåne er angitt med symbolet i overskriften til variabelens kolonne. Merk at noen kombinasjoner av datatype og måletype ikke gir mening, og jamovi lar deg ikke velge disse.
ta: அளவீட்டு வகைகள் மாறியின் நெடுவரிசையின் தலைப்பில் உள்ள சின்னத்தால் நியமிக்கப்படுகின்றன. தரவு வகை மற்றும் அளவீட்டு வகைகளின் சில சேர்க்கைகள் அர்த்தமல்ல என்பதை நினைவில் கொள்க, மேலும் இவற்றை தேர்வு செய்ய சாமோவி உங்களை அனுமதிக்க மாட்டார்.

source: ``Nominal`` and ``Ordinal`` are, predictably, for nominal and ordinal variables. ``Continuous`` is for variables with numeric values which are considered to be *Interval* or *Ratio* scales (Equivalent to ``Scale`` in SPSS). The ``ID`` measure type is, unlike the others, unique to jamovi. It’s intended for variables that contain identifiers that you would almost never want to analyse. For example, a persons name, or a participant ID. The advantage of IDs, is that jamovi does not need to maintain a list of levels internally, which can improve performance when interacting with very large data sets.
de: ``Nominal`` und ``Ordinal`` kennzeichnen nominale und ordinale Variablen. ``Continuous`` ist für Variablen mit numerischen Werten, die als *Intervall*- oder *Ratio*-Skalen betrachtet werden (äquivalent zu ``Scale`` in SPSS). Der Skalentyp ``ID`` existiert nur in jamovi. Er ist für Variablen gedacht, die Identifikatoren enthalten, die man nie analysieren möchte (z.B. Name oder ID eines Versuchsteilnehmers). Der Vorteil von IDs ist, dass jamovi intern keine Liste von Faktorstufen im Speicher halten muss (R repräsentiert Text-Variablen intern oft als Faktoren), was die Leistung bei der Interaktion mit sehr großen Datensätzen verbessern kann.
ja: ``名義`` と ``順序`` は、その名の通り名義尺度変数や順序尺度変数に使われます。 ``連続`` は、数値データで間隔尺度や比率尺度とみなされる変数に使われます（SPSSの ``スケール`` と同等です）。 ``ID`` 型は、他とは異なりjamovi独自のものです。これは、分析対象としない識別子（例：氏名や参加者IDなど）を含む変数に使われます。ID型の利点は、jamoviが内部で水準（レベル）リストを保持する必要がなくなるため、非常に大きなデータセットを扱う際のパフォーマンスが向上することです。
nb: ``Nominal`` og ``Ordinal`` er for nominale og ordinale variabler. ``Continuous`` er for variabler med numeriske verdier som anses å være *Intervall*- eller *forholdstall*-skalaer (tilsvarer ``Scale`` i SPSS). Måltypen ``ID`` er unik for jamovi. Den bør brukes for variabler som inneholder identifikatorer som du nesten aldri vil analysere (f.eks. et personnavn eller en deltaker-ID). Fordelen med ``ID`` er at jamovi ikke trenger å opprettholde en liste over nivåer internt. Det kan forbedre prosesseringshastighet når du bruker svært store datasett.
ta: `` பெயரளவு`` மற்றும் `` ஆர்டினல்`` ஆகியவை பெயரளவு மற்றும் சாதாரண மாறிகளுக்கு கணிக்கத்தக்கவை. `` தொடர்ச்சியானது`` என்பது எண் மதிப்புகளைக் கொண்ட மாறிகள் * இடைவெளி * அல்லது * விகிதம் * அளவீடுகளாகக் கருதப்படுகிறது (SPSS இல் `` அளவுகோல்` க்கு சமம்). `` ஐடி`` அளவீட்டு வகை, மற்றவர்களைப் போலல்லாமல், சாமோவிக்கு தனித்துவமானது. இது நீங்கள் ஒருபோதும் பகுப்பாய்வு செய்ய விரும்பாத அடையாளங்காட்டிகளைக் கொண்ட மாறிகளுக்காக வடிவமைக்கப்பட்டுள்ளது. எடுத்துக்காட்டாக, ஒரு நபரின் பெயர், அல்லது பங்கேற்பாளர் ஐடி. ஐடிகளின் நன்மை என்னவென்றால், சாமோவிக்கு உள்நாட்டில் நிலைகளின் பட்டியலை பராமரிக்க தேவையில்லை, இது மிகப் பெரிய தரவுத் தொகுப்புகளுடன் தொடர்பு கொள்ளும்போது செயல்திறனை மேம்படுத்த முடியும்.

source: When starting with a blank spreadsheet and typing values in, the data and measure types will change automatically depending on the data you enter. This is a good way to get a feel for which variable types go with which sorts of data. Similarly, when opening a data file, jamovi will infer the variable type from the data in each column. In both cases, this automatic approach may not be correct, and it may be necessary to manually specify the data and measure type with the variable editor.
de: Wenn Sie mit einer leeren Datentabelle beginnen und Werte eingeben, ändern sich Datentypen und Skalenniveaus automatisch in Abhängigkeit von den eingegebenen Daten. Dies ist eine gute Möglichkeit, ein Gefühl dafür zu bekommen, welche Variablentypen zu welcher Art von Daten passen. In ähnlicher Weise versucht jamovi beim Öffnen einer Datendatei den am besten passenden Variablentyp aus den Daten in jeder Spalte abzuleiten. In beiden Fällen kann es sein, dass diese automatische Bestimmung nicht korrekt ist. Daher kann es notwendig werden, den Datentyp und das Skalenniveau im Nachhinein manuell anzupassen.
ja: 空白のスプレッドシートから値を入力し始めると、入力したデータの内容に応じてデータ型や測定値型が自動的に切り替わります。これは、どの変数型がどのようなデータに対応しているかを理解するのによい方法です。同様に、データファイルを開いた場合も、jamoviは各列のデータから変数型を推測します。いずれの場合も、これらの自動判定が必ずしも正しいとは限りません。その場合は、変数エディタを使ってデータ型や測定値型を手動で指定する必要があります。
nb: Når du starter med et tomt regneark og skriver inn verdier, så endres dataene og målenivåene automatisk avhengig av dataene du skriver inn. Dette er en god måte å få en følelse av hvilke målenivåer brukes med hvilken slags data. På samme måte vil jamovi bestemme målenivået fra dataene i hver kolonne når du åpner en datafil. I begge tilfeller kan det hende at den automatiske tilnærmingen ikke er riktig, og det kan være nødvendig å manuelt angi data- og målenivå med å redigere variabelen.
ta: வெற்று விரிதாளுடன் தொடங்கி மதிப்புகளைத் தட்டச்சு செய்யும் போது, நீங்கள் உள்ளிட்ட தரவைப் பொறுத்து தரவு மற்றும் அளவீட்டு வகைகள் தானாக மாறும். எந்த வகையான தரவை எந்த மாறுபட்ட வகைகள் செல்கின்றன என்பதற்கான உணர்வைப் பெற இது ஒரு சிறந்த வழியாகும். இதேபோல், தரவுக் கோப்பைத் திறக்கும்போது, ஒவ்வொரு நெடுவரிசையிலும் உள்ள தரவுகளிலிருந்து மாறி வகையை சமோவி ஊகிக்கும். இரண்டு நிகழ்வுகளிலும், இந்த தானியங்கி அணுகுமுறை சரியாக இருக்காது, மேலும் தரவை கைமுறையாகக் குறிப்பிடுவது மற்றும் மாறி எடிட்டருடன் அளவீட்டு வகையை அளவிடுவது அவசியமாக இருக்கலாம்.

source: The variable editor can be invoked by selecting ``Setup`` from the ``Data`` tab, double-clicking on the column header, or by pressing ``F3``. The variable editor allows you to change the name of the variable, and (for data variables) the data type, the measure type, the order of the levels, and the label displayed for each level. The variable editor can be dismissed by clicking the close arrow, or by pressing ``F3`` again.
de: Der Variablen-Editor kann durch Auswahl von ``Setup`` auf der Registerkarte ``Daten``, durch Doppelklick auf die Spaltenüberschrift der betreffenden Variable oder durch das Drücken von ``F3`` aufgerufen werden. Im Variablen-Editor können Sie den Namen der Variable und (bei Datenvariablen) den Datentyp, das Skalenniveau, die Stufen eines Faktors und das Label / die Bezeichnung für die unterschiedlichen Faktorstufen ändern. Der Variablen-Editor kann durch Anklicken des Schließpfeils oder durch erneutes Drücken der Taste ``F3`` verlassen werden.
ja: 変数エディタは、 ``データ`` （Data）タブの ``設定`` （Setup）を選択するか、列ヘッダーをダブルクリックするか、 ``F3`` キーを押すことで起動できます。変数エディタでは、変数名の変更や（データ変数の場合は）データ型、測定値型、水準の順序、各水準に表示されるラベルの変更が可能です。変数エディタは、閉じる矢印をクリックするか、再度 ``F3`` キーを押すことで閉じることができます。
nb: Variabelredigering kan startes ved å velge ``Setup`` fra ``Data``-fanen, dobbeltklikke på kolonneoverskriften eller ved å trykke ``F3``. Variabelredigering lar deg endre navnet på variabelen, og (for datavariabler) datatypen, målenivå, rekkefølgen på nivåene / trinnene og beskrivelse som vises for hvert nivå. Variabelredigering kan lukkes ved å klikke på lukkepilen eller ved å trykke ``F3`` på nytt.
ta: `` தரவு`` தாவலில் இருந்து `` அமைவு` என்பதைத் தேர்ந்தெடுப்பதன் மூலமும், நெடுவரிசை தலைப்பில் இருமுறை சொடுக்கு செய்வதன் மூலமோ அல்லது `` F3`` ஐ அழுத்துவதன் மூலமோ மாறி எடிட்டரை செயல்படுத்தலாம். மாறி எடிட்டர் மாறியின் பெயரை மாற்ற உங்களை அனுமதிக்கிறது, மற்றும் (தரவு மாறிகளுக்கு) தரவு வகை, அளவீட்டு வகை, நிலைகளின் வரிசை மற்றும் ஒவ்வொரு நிலைக்கும் காட்டப்படும் சிட்டை. நெருங்கிய அம்புக்குறியைக் சொடுக்கு செய்வதன் மூலம் அல்லது மீண்டும் `` F3`` ஐ அழுத்துவதன் மூலம் மாறி எடிட்டரை நிராகரிக்கலாம்.

source: New variables can be inserted or appended to the data set using the ``Add`` button from the data ribbon. The ``Add`` button also allows the addition of *Computed variables*.
de: Neue Variablen können mit der Schaltfläche ``Hinzufügen`` aus der Registerkarte ``Daten`` in den Datensatz eingefügt (vor der aktuellen Cursor-Position) oder angehängt werden (am Ende der existierenden Variablen). Die Schaltfläche ``Hinzufügen`` ermöglicht auch das Hinzufügen von *Berechneten Variablen*.
ja: 新しい変数は、データリボンの ``追加`` （Add）ボタンを使ってデータセットに挿入したり追加したりできます。 ``追加`` ボタンからは *計算変数* を追加することもできます。
nb: Nye variabler kan settes inn eller legges til datasettet ved å bruke ``Add``-knappen fra ``Data``-fanen. ``Add``-knappen lar også legge til *Beregnede variabler*.
ta: தரவு நாடாவிலிருந்து `` சேர்` பொத்தானைப் பயன்படுத்தி புதிய மாறிகள் தரவு தொகுப்பில் செருகப்படலாம் அல்லது சேர்க்கப்படலாம். `` சேர்` பொத்தானை *கணக்கிடப்பட்ட மாறிகள் *சேர்க்க அனுமதிக்கிறது.

source: Computed Variables
de: Berechnete Variablen
ja: 計算変数
nb: Beregnede variabler
ta: கணக்கிடப்பட்ட மாறிகள்

source: Computed Variables are those which take their value by performing a computation on other Variables. Computed Variables can be used for a range of purposes, including log transforms, z-scores, sum-scores, negative scoring and means.
de: Berechnete Variablen sind solche, die ihren Wert durch die Durchführung einer Berechnung basiert auf einer oder mehreren anderen Variablen erhalten. Berechnete Variablen können für eine Reihe von Zwecken verwendet werden, z. B. für logarithmische Transformationen, z-Transformationen, das Berechnen von Skalenwerten (Summe oder Mittelwert), für die Inversion von Skalenitems, etc.
ja: 計算変数は、他の変数に対して計算を行うことで値が決まる変数のことです。計算変数は、対数変換、zスコア、合計スコア、逆点化、平均値の算出など、さまざまな目的で利用できます。
nb: Beregnede variabler er variabler som tar verdien ved å utføre en beregning basert på andre variabler. Beregnede variabler kan brukes til en rekke formål, inkludert logaritmiske transformasjoner, z-transformasjoner, poengsummer, inversjon av skalaitems, gjennomsnitter, osv.
ta: கணக்கிடப்பட்ட மாறிகள் மற்ற மாறிகள் மீது ஒரு கணக்கீட்டைச் செய்வதன் மூலம் அவற்றின் மதிப்பை எடுத்துக்கொள்கின்றன. கணக்கிடப்பட்ட மாறிகள் பதிவு மாற்றங்கள், இசட்-ச்கோர்ச், சம்-ச்கோர்ச், எதிர்மறை மதிப்பெண் மற்றும் வழிமுறைகள் உள்ளிட்ட பல நோக்கங்களுக்காக பயன்படுத்தப்படலாம்.

source: *Computed variable*\ s can be added to the data set, with the ``Add`` button available on the data tab. This will produce a formula box where you can specify the formula. The usual arithmetic operators are available. Some examples of formulas are:
de: *Berechnete Variablen* können dem Datensatz mit der Schaltfläche ``Hinzufügen``, die unter der Registerkarte ``Daten`` verfügbar ist, hinzugefügt werden. Dabei wird ein Formel-Feld angezeigt, in dem Sie die Formel angeben oder zusammenklicken (fx-Button) können. Es stehen die üblichen arithmetischen Operatoren zur Verfügung. Einige Beispiele für Formeln sind:
ja: データタブにある ``追加`` （Add）ボタンを使うことで、 *計算変数* をデータセットに追加できます。これをクリックすると、数式を指定するための数式ボックスが表示されます。ここでは通常の算術演算子が利用可能です。数式は次のように使用します。
nb: *Beregnede variabler* kan legges til datasettet, med ``Legg til``-knappen tilgjengelig på ``Data``-fanen. Dette vil produsere en inngavefelt hvor du kan spesifisere formelen. I tillegg er de vanlige aritmetiske operatorene tilgjengelige. Noen eksempler på formler er:
ta: *தரவு தொகுப்பில் கிடைக்கும் `` சேர்` பொத்தானைக் கொண்டு, கணக்கிடப்பட்ட மாறி*\ கள் தரவு தொகுப்பில் சேர்க்கப்படலாம். இது ஒரு சூத்திர பெட்டியை உருவாக்கும், அங்கு நீங்கள் சூத்திரத்தைக் குறிப்பிடலாம். வழக்கமான எண்கணித ஆபரேட்டர்கள் கிடைக்கின்றன. சூத்திரங்களின் சில எடுத்துக்காட்டுகள்:
