Repository: sjentsch/jamoviDocs-i18n
Catalog: */LC_MESSAGES/usermanual.po
Languages: de, ja, nb, ta

source: By default, ``Rj`` makes use of the version of ``R`` bundled with jamovi. This includes many packages (``jmv`` and all it’s `dependencies <https://cran.r-project.org/package=jmv>`_\ ), and will be sufficient for many people, but if you need to make use of additional ``R`` packages then you’ll need to make use of the ``System R`` version. If you select ⚙ (at the top right of the code box), you’ll see an option to change the ``R version`` used. The ``System R`` version uses the version of ``R`` you have installed on your system. This has the advantage that your ``R`` code now has access to all of the packages you have installed for that version of ``R``. The last thing you will need is to have the |jmvconnect| R package installed in the R library on your system. This package allows the ``R`` version on your system to access the jamovi data sets. You can install it in ``R`` with:
nb: Som standard bruker ``Rj`` versjonen av ``R`` som følger med jamovi. Denne inneholder mange pakker (``jmv`` og alle dens `avhengigheter <https://cran.r-project.org/package=jmv>`_\ ), og vil være tilstrekkelig for de fleste. Hvis du trenger å gjøre bruk av ytterligere ``R``-pakker, må du bruke ``System R`` versjonen. Hvis du velger ⚙ (øverst til høyre i kodeboksen), vil du se et alternativ for å endre ``R version`` som brukes. Versjonen ``System R`` bruker den versjonen av ``R`` som du har installert på systemet ditt. Dette har den fordelen at ``R``-koden din nå har tilgang til alle pakkene du har installert for den versjonen av ``R``. Det siste du trenger er å ha R-pakken |jmvconnect| installert i R-biblioteket på systemet ditt. Denne pakken gir ``R``-versjonen på systemet ditt tilgang til jamovi-datasettene. Du kan installere den i ``R`` med:

source: There may be times where you’ll want to transition to an R session for analysing a data set. This is where the |jmvconnect| R package comes in handy. |jmvconnect| let’s you read the data sets from a running jamovi instance into an R session. It has two functions: ``what()`` lists the available data sets, and ``read()`` reads them. For example, you might use:
nb: Det kan hende at du ønsker å gå over til en ``R``-sesjon for å analysere et datasett. Det er her R-pakken |jmvconnect| kommer til nytte. Med |jmvconnect| kan du lese datasettene fra en jamovi-instans som kjører, til en R-økt. Den har to funksjoner: `what()` viser de tilgjengelige datasettene, og `read()` leser dem. Du kan for eksempel bruke:

source: Rj, |jmvconnect| and |jmvReadWrite| make is easy to access R from jamovi, and jamovi from R.
nb: Rj, |jmvconnect| og |jmvReadWrite| gjør det enkelt å få tilgang til R fra jamovi, og til jamovi fra R.
